{
   "user": "24framesofnick",
   "reviews": {
      "dune-part-two": "10/10 That's it. That's the best sci fi ever made  There is simply nothing that could ever be as spectacular, as grand, as well thought out, as beautiful, as fucking AMAZING  This is a movie that exists only once in a generation. A story that grabs you and pulls you in. Enticing you to follow the journey until you're ripped to shreds from exhaustion  There is a scale here that could only be accomplished today in this time of our species....     ",
      "dune-2021": "10/10 If I could fuck a movie, I'd fuck this movie     ",
      "drive-away-dolls": "6/10 Needs more sauce     ",
      "perfect-days-2023": "10/10 Adorable, beautiful, and heartbreaking  How can we continue our mundane day to day. Appreciate the small things around us. Take inventory of everything that makes us feel fulfilled. Never stop taking the small moments to breath in between  It'll be difficult sometimes and sometimes our satisfying routine might be broken but if we can continue to keep looking at the experiences given to us in the right light then we'll be okay  The music is beautifully used  I also went to the bathroom to piss for a moment so it was like full immersion I was really in the movie     ",
      "the-lobster": "10/10 This was very formative for my movie taste when i was in high school  The comedic timing is immaculate and the performances are so perfect. The goofy shooting range fight being one of my favorite examples of just awkward stiff people knocking each other around like wooden children  I love letting the audience be forced to understand the message and emotions and how it makes some people just too weirded out even to this day  It's beautifully shot and the...     ",
      "perfect-blue": "10/10 Jesus fucking Christ do not hit the cart to this     ",
      "the-lord-of-the-rings-the-return-of-the-king": "10/10 What an incredible fucking series. I'm gonna be really sad that i finished my first watched for this trilogy but I'm grateful for the journey that I went on  Watching the extended version for all of these has given me such a massive appreciation for everything they represent   When everyone kneeled for the hobbit crew at the end I fucking wept. These boys are absolute legends and no one will ever come close   Incredible battles, music, performances. Such a great story and satisfying lore  This shit really had it all and I'll be looking to recapture this feeling for the rest of my life     ",
      "the-wolfpack": "6/10 Now give them Letterboxd     ",
      "madame-web": "2/10 A moderator has removed this review.     ",
      "a-ghost-story-2017": "9/10 Yeah my ass was crying again my ass is always crying     ",
      "before-sunset": "10/10 FUCK FUCK FUCK FUCK FUCKING FUCKIN MOTHERFUCKER FUCKING WHAT THE ACTUAL FUCK I CANT FUCKING DO THIS IM FUCKING CRYING FUCK YOU FUCKER FUCKS     ",
      "before-sunrise": "9/10 They're so fucking cute I wanna die. I know this shit won't last. It's puppy love. I'm praying on their downfall. Blah blah blah this is where those lil hot dogs come from     ",
      "the-taste-of-things": "9/10 I just love seeing people being masters at their craft  The elegance and passion not extruding from a pompous self centered nature but a pure unfiltered enjoyment of dedicating yourself to something as beautiful as cooking  The romance is slowly simmering, the setting is golden and baked  The music never showing its face in favor of hearing each silent emotion that comes with such a tasking yet rewarding activity   My man was grunting, puffing and breathing all up in the mic like yo, HES LOCKED INNNN  Absolutely beautiful movie     ",
      "super-bowl": "2/10 The script was ass     ",
      "how-to-have-sex": "8/10 British men are fucking vile creatures     ",
      "lisa-frankenstein": "8/10 The type of movie that'll only get the appreciation it deserves in 5 years     ",
      "the-princess-bride": "9/10 Just watched this in a park with grass on my ass and people clapping and laughing and shit and that made me really happy     ",
      "the-lord-of-the-rings-the-two-towers": "9/10 I have no idea what The Ent was saying but I was loving every word of it  There is possibly no opening moment more hype than Gandalf vs the Balrog that shit had me fucking jumping and hollering  The battle of helms deep was jaw dropping like how the FUCK did Peter Jackson pull that shit off and still I'm hearing the next movie goes even further  This one definitely dragged a little more on certain scenes with the extended version but I still appreciate the extra lil bits  Shoutout my boy Gimli, I did not recognize your game but now I see the truth     ",
      "shortcomings": "7/10 This flew under everyone's radar last year but it's really sweet and funny   Always need a movie where the main character is a prick every now and then  Also yall check the director     ",
      "the-raid-2011": "10/10 Still has yet to be a martial arts hand to hand action movie that even touches this level 10 years later  The only thing close enough is raid 2   This will always be my go to for visceral bloody action where it feels like the actors are genuinely trying to kill each other     ",
      "the-lord-of-the-rings-the-fellowship-of-the-ring": "7/10 Nobodies following a ring? They're following this frodo guy dumb     ",
      "dumb-money": "5/10 I got bored and put clips of BlackBerry on instead     ",
      "society-of-the-snow": "8/10 THE INDOMITABLE HUMAN SPIRIT RAHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHH  I was squirming, crying, gripping the hair on the top of my skull  Very intense, very powerful     ",
      "the-zone-of-interest": "9/10 There is an evil in this world thats impossible to look away from  The small details, the tiny blink and miss moments, the daily repetition of life. It's never been more haunting to watch someone clean or do chores  I didn't flinch, I didn't move an inch   Don't make a sound  You are left to audibly digest all horrors that mankind can bring  You must gaze into the very dark chasm of this world and only then can you speak     ",
      "fallen-leaves-2023": "7/10 At first I was joking about the karaoke being like Alan wake 2 cause of Finnish people and then AHTI THE FUCKING JANITOR SHOWED UP. THATS MY GOAT THATS MY GOAT ALAN WAKE 2 HIVE RISEEEE     ",
      "django-unchained": "8/10 Tarantino blew up     ",
      "mean-girls-2024": "5/10 7 bathroom blinkertons had me freaking out during some of the songs  ALSO SOMEONE GAVE ME A FREE ICE CREAM SUNDAE THAT THE THEATER ACCIDENTALLY MADE TWO OF THAT WAS SICK  Dont be fooled by the rating I had an insanely great time watching this  The main boyfriend looks like someone made Dan Dehaan in the sims 2  Also giving Cady a galaxy flip is the funniest product placement because it works with her true self being a real fucking...     ",
      "the-warriors": "9/10 Running simulator ahhhhhhhh  Real gang shit. Nahhh but this movie is so good cause it's just bros on bros doing bro shit and fighting and kissing. The sheer amount of New York subway locations is amazing and they were really proud of them because they really let you fucking tour every ceramic tile of each station  Like fuck I feel like I learned the entire New York transit system in one movie. But that's fucking COOL     ",
      "lucky-three-an-elliott-smith-portrait": "10/10 I didn't do it today I didn't do it today I didn't do it today I didn't do it today I didn't do it today I didn't do it today I didn't do it today I didn't do it today I didn't do it today I didn't do it today I didn't do it today I didn't do it today I didn't do it today I didn't do it today I didn't do it today I didn't do it today...     ",
      "memories-of-murder": "9/10 when I'm playing dying light and I press L3 and L1 at the same time  Haunting, disturbing, but also insanely funny. This movie is able to send chills down your spine and somehow cut to a guy looking at dicks in a bath house and keep both tones in check. I didn't even know it was a true story before watching and learning so just makes that ending rattle through your skull  Incredible movie     ",
      "goodfellas": "10/10 Genuinely might be the greatest movie ever made     ",
      "burn-after-reading": "9/10 Need me a fuck machine for my birthday     ",
      "all-of-us-strangers": "8/10 GETTING HEAD TO THE FALLOUT 3 SONG     ",
      "casino": "9/10 Me in another life     ",
      "tenet": "6/10 would've been a banger Freddie Wong/Rocket Jump video in 2011     ",
      "blackberry-2023": "9/10 I FUCKING LOVE MATT JOHNSON     ",
      "about-time": "10/10 Why is this one of the greatest movies I have ever fucking seen     ",
      "ted": "4/10 FIRST MOVIE OF THE YEAR LMFAOOOOOOOOOOOO     ",
      "when-harry-met-sally": "9/10 When Harry met Sally's haircut salon     ",
      "collateral": "6/10 Still not getting Michael Mann. Maybe he's just not for me     ",
      "ferrari-2023": "6/10 Italian men need name tags they all look the same     ",
      "playtime": "10/10 The type of movie to make you say:\"They don't make em like they used to\"     ",
      "meg-2-the-trench": "2/10 As a The Meg defender this shit really boring as fuck     ",
      "war-for-the-planet-of-the-apes": "8/10 CAESAR IS TOP 5 CHARACTERS OF ALL TIME I DONT GIVE A FUUUUUUUCK     ",
      "dawn-of-the-planet-of-the-apes": "8/10 PROTECT MAURICE I FUCKING LOVE MAURICE     ",
      "rise-of-the-planet-of-the-apes": "7/10 CAESAR IS SO FUCKING RAWWWWWWWWWW     ",
      "anyone-but-you": "6/10 Ngl if given the opportunity I would rim Glen Powell     ",
      "trainspotting": "10/10 The Boy And The Heroin     ",
      "poor-things-2023": "10/10 It's interesting knowing a movie will be your favorite of the year long before you ever get to watch it.   Poor things is a stunning story about discovery, SO MUCH discovery. Its a movie that can juggle a billion aspects of life. Moving on from one to the next so seamlessly akin to how we do in our everyday lives.  There's so much humanity found in a movie about a sown-together cadaver reanimated. What drives us, what makes us curious,...     ",
      "leo-2023": "4/10 In my suicide note     ",
      "the-iron-claw-2023": "7/10 A slow creep towards tragedy. Great performances and incredibly sexy men. At times missing that big OOMF I was hoping for but overall love how the story is told     ",
      "the-boy-and-the-heron": "9/10 You can sit and ponder the very nature of existence and grief. Juggling the choice of letting go or staying. Asking yourself if you really had enough time with someone you love before that time runs out.  Or you can crank 90's and build a block tower     ",
      "godzilla-minus-one": "9/10 Just death, destruction, and an emotional core  All I could ever ask for in a classic Godzilla     ",
      "napoleon-2023": "6/10 It slaps if you think about it like a really long family guy cutaway gag     ",
      "american-fiction": "8/10    Me and the dad have something in common. Not yet but probably one day idk  (Cause he k*lls himself)     ",
      "good-burger-2": "1/10 Kai Cenat is rizzing the Ohio skibidi burger?     ",
      "about-my-father": "2/10 I like that one Robert de niro comedy where he shows his cock and fucks like crazy this is not that one tho     ",
      "the-holdovers": "10/10 Like a warm hug from a friend you haven't seen in years all while crying in their shoulder over and over again about how much you missed them     ",
      "thanksgiving-2023": "7/10 Eli Roth made a good movie finally 💕     ",
      "the-hunger-games-the-ballad-of-songbirds-snakes": "7/10 GTA 4 the ballad of gay tony or something idk     ",
      "the-killer-2023": "9/10 Would be so much easier if bro knew how to save scum     ",
      "dream-scenario": "8/10 I̶̡̝̝̅̾ ̷̧͎̭̾͒W̷̢̥̰͊͝I̵̫͗̅͋L̵͖̹̞̋̃̈́Ḽ̵̟̖̽ ̶̳̂̑B̵̢̢̠̍͗͝E̴̖̝͒ ̵̨̮̔̈̓I̵̯̪͝N̷̙̣̙̓̉̈́ ̵̦̼̎̀͂Y̷̹̬̽O̸̦̬̚͜U̶̖̥̍̓R̵̳͈̎͘ ̶̰̖͖̑D̵̘͒R̶̫̊͠E̴̖͛̋Ḁ̸͖̉Ḿ̵̥̜̫͊̎Ş̶̰͔̅̇ ̶̱͗T̸͈̠̃̈́̓Ò̸̢͍̗̆Ň̵̫̬̈I̵̘̠̽G̵͈̙̓̋H̸̹̺́T̴͓̦́͝     ",
      "priscilla": "8/10 Austin Butler can suck my fat fucking nuts     ",
      "totally-killer": "5/10 This shit kinda pissed me off     ",
      "five-nights-at-freddys": "3/10 Would've been better if Chica had big tits     ",
      "killers-of-the-flower-moon": "9/10 I hope the first person to watch this as tiktok clips gets hit by a car     ",
      "anatomy-of-a-fall": "8/10 Imagining 50 cent watching this in the theater got me giggling     ",
      "paddleton": "9/10    I immersed myself by taking an edible that happened to hit when he took the final pill. I broke down into fucking tears I'm fucking destroyed. This was so beautiful and small and sweet and just fuck     ",
      "videodrome": "8/10 They got the guy from family guy in this     ",
      "ma-2019": "3/10 Farkle should've died violently     ",
      "burnt": "5/10 Kinda like if The Bear was made by Disney     ",
      "monster-house": "8/10 AHHHHHHHHH WHY IS IT SO SCARYYYYY STILL     ",
      "the-human-voice-2020": "7/10 Broke girl don't got AirPod pros     ",
      "strange-way-of-life": "5/10 Pedro Pascal ass Pedro Pascal ass Pedro Pascal ass Pedro Pascal ass Pedro Pascal ass Pedro Pascal assPedro Pascal ass Pedro Pascal ass Pedro Pascal assPedro Pascal ass Pedro Pascal ass Pedro Pascal ass Pedro Pascal ass Pedro Pascal ass Pedro Pascal assPedro Pascal ass Pedro Pascal ass Pedro Pascal ass     ",
      "scary-stories-to-tell-in-the-dark-2019": "5/10 Grew up reading the books, sadly nothing in this could capture the magic of the original illustrations     ",
      "stop-making-sense": "10/10 They got the song from GTA 5 in this     ",
      "the-creator-2023": "5/10 Bruh should create a better movie 💀     ",
      "the-texas-chainsaw-massacre-2": "8/10 The batshit comedy and the setting make this soooo fucking fun wow     ",
      "no-one-will-save-you": "7/10 Garry's mod jpeg chases you around the map type movie     ",
      "boys-state": "8/10 That kid played darude sandstorm on a trumpet     ",
      "the-texas-chain-saw-massacre": "9/10 ITS JUST LIKE THE VIDEO GAME OMGMGMGMGMGMGMGMGGMGMGMGM     ",
      "you-are-so-not-invited-to-my-bat-mitzvah": "5/10 Them kids on news.com watching sad dog clips     ",
      "bottoms": "10/10 All other comedy movies should just give up cause you're not gonna TOP this     ",
      "madagascar": "6/10 Alex got the hot tits     ",
      "elemental-2023": "6/10 It's so sterile     ",
      "coraline": "10/10 one of the greatest animated movies ever fucking made. gets better each year     ",
      "landscape-with-invisible-hand": "7/10 If they rub those damn paddles together again I'm gonna kill myself     ",
      "forgetting-sarah-marshall": "7/10 You can forget Sarah Marshall but you'll never forget deez nuts     ",
      "get-him-to-the-greek": "5/10 This movie predicted real life LOLOLOLOLOLOOLOLOLOLOLOLOLOLOLOLOLOLOLOLOLOLOLOLOLLLOLOLOLOLOLOLOLOLOOLOLOL     ",
      "oldboy": "10/10 This happened to my buddy Eric  I don't talk to him anymore     ",
      "beautiful-disaster": "1/10 Directors name is Roger CUMble     ",
      "bratz": "4/10 bratatatatatatatatatatatatat     ",
      "the-nice-guys": "9/10 Jesus fucking Christ Ryan gosling you are the greatest man to ever live I fucking worship you     ",
      "the-hurt-locker": "7/10 It was this or bluey    should've chose bluey     ",
      "la-la-land": "10/10 It's insane how there's still haters of this movie bruh like imma put you in a saw trap     ",
      "teenage-mutant-ninja-turtles-mutant-mayhem": "8/10 Need every frame tattooed inside of my fucking skull this shit is GORGEOUS     ",
      "theater-camp-2023": "8/10 My entire life I will be stuck in the shadows of being a Ben Platt look alike and that fucking sucks     ",
      "talk-to-me-2022": "7/10 If you use Snapchat in 2023 you deserve to die tbh    Nah but 15 year old me is so happy to see RackaRacka go from YouTube to the big screen finally. hope to see a lot more from them soon     ",
      "pusher-ii": "10/10 I like this one     ",
      "they-cloned-tyrone": "7/10 The only time I've ever heard anyone talk positively about Hollow Man     ",
      "lets-be-cops": "2/10 I could not tell you why I immediately watched this as soon as I got home from seeing Oppenheimer     ",
      "oppenheimer-2023": "10/10 This shit tore my hymen     ",
      "barbie": "9/10 I thank god and all that is holy for letting me exist in the same time on earth as Ryan Gosling     ",
      "pusher": "9/10 Danish word of the day: Lørdag   which means Saturday 👍     ",
      "sindy-the-fairy-princess": "1/10 Barbie wishes it was this good💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀💀     ",
      "dog-day-afternoon": "9/10 Weirdest diary of a wimpy kid movie     ",
      "mission-impossible-dead-reckoning-part-one": "8/10 That lord xenu coochie workin wonders     ",
      "after-hours": "9/10 This is what axel webber does every night in my head     ",
      "aliens": "9/10 Mother bitch got her sack blown out down in the egg  room :(     ",
      "alien": "10/10 Need me a god damn throat goat like Kane     ",
      "fargo": "9/10 Oh yeah 🤤🤤🤤🤤🤤🤤🤤🤤🤤🤤     ",
      "joy-ride-2023": "7/10 GIVE ME MORE RAUNCHY COMEDIES I NEEEEED IT     ",
      "nimona-2023": "8/10 There is so much that I loved about this holy shit     ",
      "run-rabbit-run-2023": "2/10 I CANT FUCKING SEE ANYTHING     ",
      "past-lives": "10/10 The white guy wrote a book called boner 💀💀     ",
      "bruce-almighty": "10/10 This might actually be the best movie ever made     ",
      "mr-poppers-penguins": "4/10 There's a coup in Russia rn y'all     ",
      "no-hard-feelings-2023": "5/10 Funniest joke in the movie is when Matthew Broderick said \"I'll drive\"     ",
      "asteroid-city": "9/10 A couple rows down there was a guy laughing the hardest ive ever heard anyone laugh   It was so infectious and just radiated pure joy.  Movies are so much fun to experience with other little humans     ",
      "flamin-hot": "4/10 I like takis more :/     ",
      "the-flash": "3/10 The ugliest fucking movie I've ever seen     ",
      "but-im-a-cheerleader": "8/10 The stole the music from roblox fashion famous     ",
      "air-2023": "6/10 Don't ever put Ben afflecks DOGS🦶🏻in my face again👃👃👃👃👃     ",
      "80-for-brady": "4/10 Why are old people having fun they're literally gonna die tomorrow 😭     ",
      "the-super-mario-bros-movie": "6/10 It's a mid     ",
      "spider-man-across-the-spider-verse": "10/10 No words can do this justice     ",
      "spider-man-into-the-spider-verse": "10/10 Nick cage can shoot his Noir web anywhere he wants     ",
      "the-little-mermaid-2023": "4/10 I watched it high and Sebastian was freaking me the fuck out     ",
      "fast-x": "3/10 I'm not excusing this one Jesus fucking Christ     ",
      "nirvana-the-band-the-show": "10/10 I would chop off my arm for another season of this show     ",
      "nathan-for-you-finding-frances": "10/10 Directors will spend entire careers trying to make something as good as this and never come close  Edit: damn I did not know I said the same shit as Karsten word for word😭😭😭     ",
      "shiva-baby-2020": "8/10 Taking salvia and watching this and Krisha back to back to experience the most uncomfortable mental state ever     ",
      "nicky-deuce": "1/10 Paulie stop kissing Gibby 😭     ",
      "guardians-of-the-galaxy-vol-3": "8/10 Fuck you     ",
      "nope": "9/10    Giant gaping butthole in the sky eats Californians     ",
      "mission-impossible-fallout": "9/10 Good lord     ",
      "mission-impossible-rogue-nation": "8/10 The theater sequence is chefs kiss 💋     ",
      "mission-impossible-ghost-protocol": "8/10 My girlfriend said \"I am excited to see Jeremy Renner in this movie\"     ",
      "mission-impossible-iii": "6/10 J.J. Abrams loves making it so you can't see anything and wants you to just imagine the movie in your head     ",
      "mission-impossible-ii": "4/10 What the FUUUUUUUUUUCKAlso Tom is so Leon Kennedy in this movie     ",
      "mission-impossible": "7/10 If Tom Cruise wasn't weird he'd be the coolest guy to ever exist im sorry     ",
      "evil-dead-rise": "9/10 Me one microsecond without the zaza     ",
      "beau-is-afraid": "8/10 https://youtu.be/ZEW2wn2HcIo     ",
      "fantastic-mr-fox": "10/10 He's literally me     ",
      "superhero-movie": "2/10 The director went from this to the last of us HBO 😭     ",
      "hoodwinked": "7/10 Granny got the grippy     ",
      "murder-mystery-2": "3/10 The most Adam Sandler has ever moved his body     ",
      "dungeons-dragons-honor-among-thieves": "8/10 This went so fucking hard for no reason     ",
      "21-jump-street": "10/10 On march 24th 2023 Kanye West said he is no longer anti semitic because of this movie and Jonah Hill     ",
      "john-wick-chapter-4": "10/10 Me and my best friend ending our 14 year long recess war story     ",
      "green-book": "4/10 Why the fuck did I watch this     ",
      "scream-vi": "7/10 Ghostface got too many dickriders😭     ",
      "creed-iii": "8/10 Unrelated but I would love to beat the shit out of Sam levinson     ",
      "lyle-lyle-crocodile": "2/10 I'd peel the scales off his body one by one     ",
      "ant-man-and-the-wasp-quantumania": "4/10 First movie of the year and it fucking SUCKED     ",
      "puss-in-boots-the-last-wish": "10/10 Nearly every single second of this movie is perfectly crafted to take advantage of the medium of animation  This is how you do it folks     ",
      "women-talking": "9/10 And I was listening!     ",
      "babylon-2022": "8/10 Yeah it's insane. All of it works or some of it works or none of it works, I don't really know. But I had fun     ",
      "avatar-the-way-of-water": "8/10 If Avatar has a million fans, then I'm one of themIf Avatar has one fan, then I'm THAT fanIf Avatar has no fans, that means I'm dead     ",
      "diary-of-a-wimpy-kid": "8/10    Greg throws children in a fucking ditch     ",
      "diary-of-a-wimpy-kid-rodrick-rules-2022": "3/10 Oh honey...     ",
      "skinamarink": "9/10 I got too scared and stopped watching     ",
      "the-guardians-of-the-galaxy-holiday-special": "6/10 Christ Pratt doesn't deserve this     ",
      "glass-onion": "8/10 Wait is this a sequel to knives out?     ",
      "trolls": "6/10 I hate that I enjoyed this...     ",
      "alvin-and-the-chipmunks": "7/10 IAN FUCKING KISSES ALVIN ON THE LIPS     ",
      "the-menu-2022": "6/10 I want the chef to react to the food I make while high   click this to see the food i make while high      ",
      "aftersun": "10/10 It's hard to find something to write for this. There's so many things going wrong with my life right now so many things I wish I could change so many things I'll never change never get to change and never be able to change but I hope I'll get better and stay better.   This might just be my favorite movie of the year and it's something I'll need to remember for the rest of my life and make sure I do better for myself and the people around me     ",
      "the-banshees-of-inisherin": "10/10 If I lived In Ireland I'd kill myself     ",
      "knives-out-2019": "9/10    I'd commit suicide too in the room where he died it's so cozy     ",
      "the-whale-2022": "6/10 I watched for Brendan     ",
      "decision-to-leave": "8/10 Horny ass motherfuckers     ",
      "tar-2022": "9/10 She never considered youngboy better     ",
      "halloween-ends": "2/10 WHAT IN THE ACTUAL FUCK IS THIS MOVIE. THIS IS HOW YALL END THIS MID ASS TRILOGY??? THIS IS A FUCKING PRANK YOURE FUCKING TROLLING     ",
      "triangle-of-sadness": "9/10 Next time I see a rich person I'm breaking their arm     ",
      "bullet-train": "5/10 Those lemon stealing whores     ",
      "paul-2011": "5/10 I watched this super fucking high and all I have to say is Sigourney weaver hot     ",
      "blonde-2022": "2/10 Thought this was gonna be about frank ocean but it was an exploitative shit fest instead     ",
      "avatar": "8/10 After seeing this in imax 3D as an adult I will dickride defend this movie hard     ",
      "pinocchio-2022": "2/10 Snap his fucking neck     ",
      "cyberpunk-edgerunners": "9/10 Fuck you for breaking me     ",
      "dont-worry-darling": "3/10 A steaming pile of dog shit covered in Macy's department store perfume     ",
      "see-how-they-run-2022": "7/10 This movie just spawned out of nowhere but it was very enjoyable     ",
      "pearl-2022": "6/10 Pearl is a crazy fucking bitch     ",
      "barbarian-2022": "8/10 Watching this while on vacation going from bnb to bnb is full immersion     ",
      "spencer-2021": "9/10 There's not one character named spencer in this movie     ",
      "the-muppets": "10/10 Watching this high as fuck was the single most joy I've ever felt in my entire life     ",
      "trick-r-treat": "6/10 Wish I was getting fucked by hot werewolf ladies as they were eating the flesh from my throat     ",
      "elvis-2022": "6/10 Jesus Christ I should've plugged Elvis's shit filled bumhole so he would've popped like a balloon     ",
      "dragon-ball-super-super-hero": "4/10 The last movies animation was nearly perfect so they made this one ugly as shit to balance it out     ",
      "the-black-phone": "5/10 I know when that hotline bling that could only mean one thing     ",
      "we-met-in-virtual-reality": "7/10 I was staring at tits the entire time     ",
      "bodies-bodies-bodies": "7/10 Don't ever show me Pete Davidson without tattoos again, it's gross     ",
      "transformers-the-last-knight": "2/10 Michael bay had to be on some fucking ungodly substance to come up with this shit     ",
      "prey-2022": "8/10 No because this is sick as fuck     ",
      "predator": "8/10 Men fucking and dying     ",
      "kikis-delivery-service": "8/10 LIZA KOSHYS DOING THE KIKI DO YOU LOVE ME CHALLENGE     ",
      "not-okay": "7/10 Well, if you wanted honestyThat's all you had to sayI never want to let you downOr have you go, it's better off this wayFor all the dirty looksThe photographs your boyfriend tookRemember when you broke your footFrom jumping out the second floor?I'm not okayI'm not okayI'm not okayYou wear me outWhat will it take to show youThat it's not the life it seems? (I'm not okay)I've...     ",
      "baywatch": "2/10 Sometimes I used to eat sand as a kid for the crunchy salty taste     ",
      "the-gray-man-2022": "4/10 The fuck is this shit     ",
      "old-school": "4/10 I rather Todd Phillips make these movies than garbage ass Joker     ",
      "wedding-crashers": "6/10 Wtf David dobrik directed this??😭😭😭     ",
      "big-daddy": "7/10 I want a son     ",
      "paws-of-fury-the-legend-of-hank": "3/10 Maybe it's cause I watched this high as fuck but this being a story about racism is crazy     ",
      "the-sea-beast-2022": "8/10 the water is fucking gorgeous and red is adorable🥺     ",
      "the-binge": "5/10 I just want to see Skyler Gisondo in more main roles please     ",
      "rrr": "10/10 Brotherly love that is just ungodly powerful  Jesus this movie Is fucking amazing     ",
      "couples-retreat": "2/10 I'm a sucker for movies where couples go to tropical locations I don't give a shit fuck you leave me alone     ",
      "marcel-the-shell-with-shoes-on-2021": "10/10 Maybe I'll just fucking kill myself     ",
      "thor-love-and-thunder": "5/10 Great first draft! Excited to see when it's finished     ",
      "minions": "5/10 Scarlett overkill is so fucking hot Jesus Christ     ",
      "despicable-me-3": "4/10 Gru and his brother had sex     ",
      "minions-the-rise-of-gru": "5/10 The minions caused 9/11     ",
      "the-big-short": "5/10 This is moulin rouge for crypto bros     ",
      "love-on-a-leash": "10/10 She fucked a dog call that shit red rocket     ",
      "crazy-stupid-love": "8/10 I wish Ryan gosling would come up to me in a bar and ask me to go home with him     ",
      "cha-cha-real-smooth": "8/10 I'm excited for Cooper Raiff to make more movies     ",
      "obi-wan-kenobi-the-patterson-cut": "4/10 I don't give a shit     ",
      "lightyear-2022": "6/10 Honestly buzz lightyear should've just killed himself     ",
      "valerian-and-the-city-of-a-thousand-planets": "4/10 Definition of too much bullshit     ",
      "hustle-2022": "7/10 I know nothing about basketball but this was nice     ",
      "joker-folie-a-deux": "2/10 I already know this shit gonna be ASS     ",
      "spree-2020": "8/10 And to think I just got followers by reviewing the Sing movies     ",
      "the-virgin-suicides": "8/10 I've had sex     ",
      "the-bobs-burgers-movie": "8/10 Bob suffers more than any other character in fiction     ",
      "top-gun-maverick": "9/10 HOLY MOLY I LOVE HOT MEN     ",
      "toy-story-2": "9/10 Better than all of them     ",
      "toy-story": "8/10 I sympathize with Sid, he's just poor so he creates new toys because he can't afford new ones     ",
      "toy-story-4": "9/10 My fucking eyes can't handle so much moisture     ",
      "toy-story-3": "7/10 4 is better     ",
      "chip-n-dale-rescue-rangers": "6/10 The first and only ip show off movie to actually use that as a good plot device and make it matter for the story and feel actually fun  Also family guy car     ",
      "ex-machina-2015": "10/10 Oscar Isaac injected himself deep into my heart with this movie when I was just 16 it's crazy to see where he's at now     ",
      "the-spongebob-movie-sponge-on-the-run": "4/10 The animation in this is absolutely fucking incredible and that is the only reason it gets higher than 1 star  Idk what crack these writers were on but it's so depressing to see such a disconnect between the animation team and the writing team  The first spongebob movie should've been the end, the second was 100% references so I had nostalgic bias and this holy shit  It's just so sad to see this type of incredible fucking animation go to such waste     ",
      "the-spongebob-movie-sponge-out-of-water": "5/10 It's so pointless     ",
      "the-spongebob-squarepants-movie": "10/10 It's quite literally perfect     ",
      "petite-maman": "8/10 Wait that kid looks just like the other kid     ",
      "cheaper-by-the-dozen-2003": "6/10 Nothing cozier     ",
      "were-all-going-to-the-worlds-fair": "7/10 Not one single fair in this movie stupid as shit     ",
      "doctor-strange-in-the-multiverse-of-madness": "6/10 It's okay     ",
      "the-break-up": "5/10 Jennifer Aniston AWOOOOGA     ",
      "drag-me-to-hell": "6/10 Christine fucking sucks drag her out of this movie dude     ",
      "the-ritual-2017": "6/10    Phil deserved better     ",
      "the-internship": "3/10 Fuck you google I use bing now!     ",
      "cube": "5/10 Squares are fucking scary man     ",
      "the-unbearable-weight-of-massive-talent": "6/10 Nick rhymes with dick     ",
      "the-bad-guys-2022": "6/10 the best sly cooper movie we'll never get  also the fox is hot     ",
      "the-northman": "9/10 If I could fuck a movie I would FUCK this movie     ",
      "pirates-of-the-caribbean-dead-mans-chest": "8/10 Some of the coolest fucking action ever put on screen     ",
      "pirates-of-the-caribbean-the-curse-of-the-black-pearl": "8/10 They just don't make them how they used to     ",
      "fantastic-beasts-the-secrets-of-dumbledore": "2/10 Not giving this money!     ",
      "edge-of-tomorrow": "8/10 So fucking fun every time     ",
      "sonic-the-hedgehog-2": "6/10 Call him knuckles for how deep his fist gonna be in my-     ",
      "the-adam-project": "5/10 Adam sucks ass     ",
      "everything-everywhere-all-at-once": "10/10 This is the greatest multiverse movie of all time if not the greatest movie of all time     ",
      "the-beach-bum": "8/10 Florida man the movie     ",
      "king-richard": "7/10 Haven't seen the movie but DAMN WILL SMITH PUNCHED THE FUCK OUT OF CHRIS ROCK DID YALL SEE THAT AT THE OSCARS LMFAOOOO     ",
      "the-power-of-the-dog": "8/10 I think this is gay but I'm not sure     ",
      "drive-my-car": "9/10 How the fuck is this nominated in the same category as Don't Look Up for the Oscar's     ",
      "jujutsu-kaisen-0": "7/10 Panda ❤️     ",
      "megamind": "8/10 Better on every rewatch  And megamind is genuinely hot     ",
      "x-2022": "7/10 I thought this was gonna be a movie about famous twitch streamer xqc but it's just a bunch of people having sex and dying??     ",
      "turning-red": "7/10 PERIODS? IN MY DISNEY MOVIE????? THIS IS OUTRAGEOUS!!!     ",
      "citizen-kane": "2/10 I could do better     ",
      "the-tomorrow-war": "3/10 The tomorrow bore. Haha. Ha     ",
      "the-batman": "8/10 My favorite part of the movie was when Robert Pattinson pulled out his cock and did the helicopter     ",
      "the-dark-knight-rises": "6/10 The penis cock rises     ",
      "the-dark-knight": "8/10 Michael Caines best performance since Jaws 4: The Revenge     ",
      "the-mitchells-vs-the-machines": "9/10 Throughout the whole movie I had tears in my eyes. Consistently rich in emotions, so fucking funny insanely gorgeous  People have issue with the technology message thing but I think this is the only example where it's really really worked, there are few instances where it's a little preachy but instead of going \"technology bad\" the movie shows how good it is for connections. I mean fuck it ends on using technology in an insanely wholesome way, so all the...     ",
      "jeen-yuhs-a-kanye-trilogy": "9/10 Omg the name sounds like genius     ",
      "the-favourite": "10/10 I love women     ",
      "uncharted-2022": "4/10 It's far more rewarding to watch a cutscene compilation of the games on YouTube     ",
      "marry-me-2022": "3/10 Throughout the movie there is unbelievable lens distortion that fucking HURTS your eyes and is so funny. It makes everyone look like fucking stick people. It's just one camera but it happens so much and is so funny   But also love bad rom coms fun movie     ",
      "valentines-day": "3/10 Cal Jacob's from euphoria     ",
      "i-want-you-back": "7/10 I want Charlie Day to be in more rom coms. This is a demand     ",
      "the-descendants": "6/10 Some say I look like George Clooney     ",
      "jackass-forever": "8/10 The jacks are such asses 💀💀     ",
      "cool-dog": "10/10    Holy fucking shit he was gonna die at the end holy shit I was crying man what the fuck this movie is better than citizen Kane     ",
      "sing-2": "2/10 Fuck you     ",
      "100-girls": "1/10 I highly recommend everyone get drunk with friends and watch this     ",
      "planet-of-the-apes": "7/10 Look at all those NFT's     ",
      "shithouse": "9/10 It may be called shithouse but the movie is fire...house     ",
      "warm-bodies": "7/10 Shit so fucking fun bro     ",
      "the-dead-dont-die-2019": "7/10 Dudeeeeeeeeee     ",
      "american-pie": "10/10 HELL YEAH MEN LETS GOOOO     ",
      "american-pie-presents-girls-rules": "1/10 I hate women i am misogynistic     ",
      "enter-the-void": "9/10 What a cute movie     ",
      "the-worst-person-in-the-world": "8/10 There's a guy named aksel and I have a friend named aksel     ",
      "the-boss-baby-family-business": "2/10 Baba     ",
      "sing-2016": "2/10 I will literally snap the gorillas short fucking legs     ",
      "sing-2016-1": "2/10 Fuck you buster moon     ",
      "sing-2001": "2/10 Fuck you buster moon     ",
      "sing": "2/10 Fuck you buster moon     ",
      "from-paris-with-love": "10/10 Real movie  real movie  real movie  real movie  real movie real movie real movie   real movie real movie real movie   real movie real movie real movie  real movie real movie real movie real movie real movie real movie real movie real movie real movie real movie real movie real movie  real movie real movie real movie real movie real movie real movie real movie real movie real movie real movie real movie real movie  real movie real movie real movie real movie real movie real movie real movie real movie real movie real movie real movie real movie     ",
      "mid90s": "9/10 Fuck this shit always hits     ",
      "jexi": "2/10 Guys this leaves showtime in 14 days make sure you watch!     ",
      "hotel-transylvania-transformania": "3/10 Why don't you transform these nuts     ",
      "euphoria-fck-anyone-whos-not-a-sea-blob": "9/10 I have to say that these two special episodes are the best episodes of the show     ",
      "euphoria-trouble-dont-last-always": "9/10 This is like the pickle Rick episode of Rick and morty     ",
      "scream-2022": "8/10 I love the part where the person screams     ",
      "smiling-friends": "10/10 Funniest shit I've seen in years     ",
      "dogman-2018": "8/10 The title doesn't lie there are a lot of dogs and men in this movie     ",
      "blended": "3/10 Better than I remember but I like just go with it more still     ",
      "uncut-gems": "10/10 Grown ups taught him well     ",
      "just-go-with-it": "4/10 Better than that blended movie and I will not explain  Jennifer Aniston was my awakening     ",
      "the-summit-of-the-gods": "9/10 I really enjoyed this     ",
      "the-longest-yard-2005": "5/10 It's like holes but football instead of holes     ",
      "belle-2021": "7/10 Better than the actual beauty and the beast because it's about gamers     ",
      "the-proposal-2009": "10/10 Banger     ",
      "dont-look-up-2021": "4/10 I'm not gonna watch this     ",
      "venom-3": "10/10 Venom 3: pee     ",
      "idiocracy": "6/10 What don't look up wants to be     ",
      "how-the-grinch-stole-christmas-2000": "4/10 Terrifying and unworthy     ",
      "licorice-pizza": "7/10 Why would you put licorice on a pizza     ",
      "red-rocket-2021": "9/10 this movie is like a GTA cutscene in the best way possible way     ",
      "hawkeye-2021": "6/10 It's fine I guess     ",
      "harry-potter-and-the-prisoner-of-azkaban": "10/10 I solemnly believe that if alfonso cuaron did not come on to direct this fucking masterpiece of a third movie then Harry Potter would not have turned into the mega franchise that it is today  This movie just goes so fucking HARD     ",
      "spider-man-the-dragons-challenge": "2/10 The multiverse is getting weird     ",
      "where-the-wild-things-are": "10/10 I'll never be able to accurately describe how this movie makes me feel and that's okay     ",
      "spider-man-no-way-home": "7/10    I wanted a Spider-Man orgy and didn't get it     ",
      "no-way-home": "2/10 Spider-Man literally isn't in this?! What the fuck     ",
      "spider-man-far-from-home": "8/10 FUCKING ZOOM ZOOM ZIP ZAP     ",
      "spider-man-homecoming": "8/10 My high school was just like this     ",
      "the-amazing-spider-man-2": "4/10 Everyone wants to fuck the shit out of Andrew Garfield in this movie and that's understandable     ",
      "the-amazing-spider-man": "5/10 Spider-Man uses bing instead of google in this movie     ",
      "the-polar-express": "5/10 What a POLARizing film     ",
      "cmon-cmon": "8/10 Gonna fight the urge to make a sex joke like \"cum on\" and write a mature review instead     ",
      "clifford-the-big-red-dog": "2/10 Big red bitch     ",
      "jodorowskys-dune": "8/10 I could do what he didn't     ",
      "diary-of-a-wimpy-kid-2021": "5/10 :(     ",
      "encanto": "8/10 Malcom in the middle meets the x men     ",
      "ghostbusters-afterlife": "6/10 Ghostbust a nut     ",
      "red-notice": "4/10 I noticed red vent and kill yellow 😭😭😂😂     ",
      "italian-spiderman": "10/10 You can't stop the gabagool Spider-Man     ",
      "all-too-well-the-short-film": "10/10 I'm giving this 5 stars so my girlfriend sees that I watched it     ",
      "monsters-vs-aliens": "5/10 Big mommy mommy milkers  mommy big step on me mommy big mommy mommy     ",
      "eternals": "5/10 Why don't you ETERNALLY suck my balls     ",
      "the-french-dispatch": "9/10 Yo wtf this is like a Wes Anderson movie     ",
      "last-night-in-soho": "7/10 British people talk funny     ",
      "9": "6/10 Kids movie where dolls fight for their lives after the world ends in a terrifying way   somehow still less scary than happy feet     ",
      "halloween-kills": "5/10 25 KILLSTREAK MICHAEL CALL IN A TACTICAL NUKE     ",
      "paranorman": "7/10 ParaBalls in yo mouth     ",
      "i-know-what-you-did-last-summer": "7/10 All I did last summer was jerk off and watch old survivor seasons     ",
      "scream": "9/10 God DAMN this shit was insanely ahead of its time in almost every single way     ",
      "catch-me-if-you-can-2002": "6/10 Horny ass Spielberg horny ass DiCaprio horny ass me     ",
      "the-addams-family-2": "2/10 How dare you make a sequel     ",
      "venom-let-there-be-carnage": "6/10 As someone who didn't give a shit about the first this was a short sweet surprise  Really fun and purposefully goofy, a great love story  THAT END CREDITS THO     ",
      "squid-game": "9/10 I'd die first     ",
      "dear-evan-hansen": "2/10 Evan hansen is just a punk ass bitch grow up     ",
      "norm-of-the-north-family-vacation": "1/10 Norm killed my family and is making me bury the bodies and dig my own grave before he kills me as well     ",
      "norm-of-the-north-king-sized-adventure": "1/10 Norm found my family and is threatening them to scare me     ",
      "norm-of-the-north-keys-to-the-kingdom": "1/10 Norm broke into my house and broke my legs     ",
      "norm-of-the-north": "1/10 Shitty ass dog looking bear fuck this movie     ",
      "the-matrix": "8/10 Taking the red pill up my ass to shock Morpheus     ",
      "incendies": "8/10 Incendies nuts     ",
      "12-rounds": "1/10 My introduction to John cena's absolutely delicious looking biceps     ",
      "hes-all-that": "2/10 Addison rae should listen to Elliott smith     ",
      "shang-chi-and-the-legend-of-the-ten-rings": "6/10 I like the fights in this one. I don't like the jokes in this one     ",
      "raw-2016": "10/10 Wish I could watch this again for the first time     ",
      "daddys-home-2": "3/10 .     ",
      "daddys-home": "2/10    ",
      "paw-patrol-the-movie": "2/10 Too many bitches     ",
      "john-carter": "5/10 John carter I hardly know her     ",
      "black-widow-2021": "6/10 I mean it's okay     ",
      "vacation-friends": "3/10 I honestly think John cena is a gift to this world     ",
      "reminiscence-2021": "3/10 Reminisce this dick     ",
      "val": "8/10 Very personal, beautiful and inspiring   I will now film every single second of my life although it might not be as interesting as Vals     ",
      "the-twilight-saga-breaking-dawn-part-2": "2/10 Jacob go to fucking jail     ",
      "the-founder": "5/10 This made me not want McDonald's ever again     ",
      "the-twilight-saga-breaking-dawn-part-1": "5/10    Ewwwwwww vampire baby die     ",
      "the-twilight-saga-eclipse": "4/10 Jacob what the fuck is wrong with you     ",
      "the-twilight-saga-new-moon": "5/10 Bark     ",
      "free-guy": "5/10 There will never be a movie that says video game terms in a way that doesn't make me wanna shoot myself     ",
      "twilight-2008": "7/10 This is such a good movie! Has anyone seen it?     ",
      "fred-the-movie": "2/10    Fred keeps bodies under the floor boards     ",
      "the-suicide-squad": "9/10 Yeah it's fucking good, like really fucking good     ",
      "space-jam-a-new-legacy": "4/10 I wish they killed bugs bunny for real fucking do it     ",
      "jungle-cruise": "5/10 Life's a jungle and I'm just swimming in it     ",
      "the-departed": "9/10 Fuckin cocksucka     ",
      "franklin-and-the-green-knight": "10/10 Green knight is the best picture of 2021 like everyone says WOW     ",
      "alvin-and-the-chipmunks-the-squeakquel": "10/10 Bible 2     ",
      "escape-room-tournament-of-champions": "6/10 Well I DIDNT wanna escape the theater this time   No but seriously this one was fucking non stop fun. All the bullshit from the first is cut and it's just constant puzzle and craziness. Really fucking fun genuinely     ",
      "mom-and-dad-2017": "4/10 THERES MY LITTLE PISS AND VINEGAR     ",
      "fear-street-1666": "8/10 \"666 party with the devil bitch\"  Is a song I heard at warped tour once     ",
      "fear-street-1978": "6/10 The 70's weren't even a real decade     ",
      "fear-street-1994": "6/10 I'm a creep dun dun dun I'm a weriddoooooooooooooohohohoho     ",
      "roadrunner-a-film-about-anthony-bourdain": "7/10 The man who saw the world but couldn't escape it  Incredibly edited, beautiful words  Weird parts like ai voice creation and such   Overall Bourdain was a storyteller and this fit him very nicely     ",
      "loki-2021": "8/10 I'm excited for marvel stuff again thanks to this show     ",
      "black-widow": "8/10 Did not expect this from Marvel a nice surprise!     ",
      "heat-1995": "5/10 Am I missing something?!?!     ",
      "freaky": "6/10 Omg this is just like freaky Friday     ",
      "zola": "7/10 Very dreamlike in an ironic way, great acting, honestly wish it was longer. The true story is a crazy part but the ending is just non existent because of that. you almost wish it was fake so there could be an ending in some way     ",
      "dirty-grandpa": "4/10 Actually funny moments?     ",
      "mike-and-dave-need-wedding-dates": "3/10 Mike and Dave need to shut the fuck up     ",
      "sex-tape": "2/10 Having the email \"your rental order of SEX TAPE\" pop up on your phone screen is a monkaW😂😂     ",
      "trainwreck": "4/10 TrainwrecksTV documentary? He's not even in it???     ",
      "f9": "8/10 This franchise is art beyond belief     ",
      "moulin-rouge-2001": "2/10 This is what that fucking Mr. Krabs disoriented meme feels like and it's not fun     ",
      "in-the-heights": "6/10 I have a fear of heights they're high     ",
      "luca-2021": "8/10 NONA NONA NONA ALL MY NONAS NONA NONA NONA     ",
      "spies-in-disguise": "6/10 It's not bad     ",
      "jaws-the-revenge": "10/10 There's a part where the shark roars in anger that it wants to kill the mom and the mom is telepathically connected to the shark and knows where it is at all times whenever it's attacking  Also michael caine  Bad movie     ",
      "cruella": "6/10 The movie is fun but there's obviously so much that does not work. The cgi dogs, the 3000 licensed songs back to back to back, the weird ass plot that is laughable as hell  But it's fun, there's really funny moments and it can be creative \"sometimes\" it's definitely trying and it's entertaining either way     ",
      "bo-burnham-inside": "10/10 :)     ",
      "a-quiet-place-part-ii": "6/10 Worst theater experience of my life fun movie tho     ",
      "friends-the-reunion": "6/10 I like when the girl sings about the stinky cat     ",
      "army-of-the-dead-2021": "6/10 Dawn of the dead is definitely the better zombie Snyder flick but this is still super fun but holy shit movies like this do not need to be 2 hours and 30 minutes  There is so much that you could just take out to make it a tighter dumb zombie fun Ass movie     ",
      "i-am-legend": "7/10 This holds up insanely well in a lot of ways especially the beginning. The city and the effects they use to make the setting complete is so fucking good   There's some cheesy stuff with the vampire zombies like one of them releasing fucking hounds like resident evil but besides that this movie still holds up   I honestly just love the feeling of the beginning city moments     ",
      "nobody-2021": "8/10 The strangest Mitski music video ever     ",
      "god-father": "2/10 I don't get what all the hype was about     ",
      "joker-2019": "5/10 The more I think about it the more I hate it     ",
      "resident-evil-vendetta": "10/10 The action in this movie is actually peak     ",
      "another-round": "8/10 Mads you are gods gift     ",
      "mortal-kombat-2021": "5/10 What are we doing, some kinda kombat? A mortal kombat?     ",
      "sound-of-metal": "8/10 SOUND OF Riz Ahmed winning an Oscar metal     ",
      "demon-slayer-kimetsu-no-yaiba-the-movie-mugen-train": "8/10 Set your heart ablaze     ",
      "aksel": "1/10 I know a guy named aksel  Would not recommend 🖕     ",
      "hairspray-2007": "4/10 For a movie/musical all about integration and non segregation this sure is just white people patting themselves on the back for being bare minimum goodish people   Very very very dated in its \"lessons\"     ",
      "gladiator-2000": "8/10 Boy am I GLAD I watched Gladiator haha FUCK     ",
      "lion": "7/10 That's not a lion that's a man!     ",
      "godzilla-2014": "8/10 This is the best of the monster verse movies and I stand by that     ",
      "king-kong-2005": "8/10 King daddy for real     ",
      "godzilla-vs-kong": "6/10 Everytime humans on screen I sleep  But the monster shit is insanely fucking cool, Godzilla king of monsters I was pissed because I just wanted big fucking monster fights and COULDNT see anything the fight sucked fat nuts  Here you can see things  Fun times  They don't kiss but they get really close     ",
      "bad-trip-2021": "8/10 It's called bad trip but it's a GOOD time hahahahah     ",
      "inside-llewyn-davis": "10/10 When I first watched this I don't think I was ready enough in my own maturity I mean I was only 15   But this is one of those movies that you just know were great even if you couldn't understand it or get behind it at a younger age or a different point in your life. There are so many movies like that but this is a great example of something that just hits harder thinking back on years later  It's an incredible movie and I think I finally feel why     ",
      "a-silent-voice": "9/10 Wow wow wow wow wow WOW     ",
      "devilman-crybaby": "10/10 There was my life before watching devilman  And there's my life after watching devilman  Watching this years ago signified a massive change in my life     ",
      "zack-snyders-justice-league": "6/10 Better I guess?     ",
      "the-way-way-back": "6/10 I literally fucking love water parks like fuck I will drink all the piss water     ",
      "the-thing": "9/10 SUS the movie 😭😭vote him out he vented LOL     ",
      "yes-day": "2/10 H.E.R being in this movie is just like the weeknd being in uncut gems     ",
      "burning-2018": "10/10 Steven Yeun is now nominated for an Oscar for Minari, I highly recommend this movie where his facial expressions tell 3 different emotions every second and you never know what he's thinking  This is a very slow burn as the title suggests but it's incredibly creepy the longer it drags on. If there was ever an example of why Steven Yeun is one of this generations best actors this is it     ",
      "scary-movie-3": "3/10 I can't believe that some of the jokes actually fucking got me fuck what the fuck I'm drained     ",
      "pitch-perfect": "6/10 Stop saying I look like Ben platt shut up stop please no     ",
      "the-hangover-part-iii": "1/10 AHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHFUCK FUCK FUCKAHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHFUCK FUCK FUCKFUCK FUCKFIGIIIII GIISHAHHHHHHHHHHHHHAHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHFUCK FUCK FUCKAHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHFUCK FUCK FUCKFUCK FUCKFIGIIIII GIISHAHHHHHHHHHHHHHH     ",
      "cloudy-with-a-chance-of-meatballs": "10/10 I don't think the world realizes how perfect this movie is     ",
      "michael-1996": "10/10 Haven't watched this but giving it five stars because it helps me remember how to spell Micheal     ",
      "beastie-boys-story": "9/10 White boys snapped 🥺😔     ",
      "minari": "9/10 Steven Yeun mmmmmmmmmmmmm     ",
      "daddy-day-care": "10/10 The tag line is fucking \"who's your daddy\"     ",
      "grown-ups-2": "1/10 Wow bad 👎     ",
      "grown-ups": "10/10 saskatchewan grown ups     ",
      "starstruck-2010": "8/10 Well Weston Koury. I did it. I fucking did it. I hope you're happy I watched STARSTRUCKSterling is hot as hell and it was fantastic     ",
      "vinland-saga": "10/10 This is the greatest story I have seen in all my life  This is the greatest story I have seen  This is the greatest story  This is the greatest  Story  Mmmmmmmmmmm     ",
      "judas-and-the-black-messiah": "10/10 Absolutely fucking phenomenal. Every actor in this literally had the most powerful performance  Even the guy with one second of screen time who was just in the FNAF movie with Nicholas Cage that came out the exact same time  This is a fucking classic of a movie instantly down to almost every second     ",
      "weathering-with-you": "8/10 Splash     ",
      "its-such-a-beautiful-day": "10/10 I watched this in high school and wanted to show every single one of my friends I had. No matter who they were I wanted their reactions just to see what they'd think. This weirdly shaped me and I don't know if that's a good or bad thing    I don't think there's been a movie that effected me deeper than this or a movie a I can pinpoint to when I truly just started thinking deeper about shit. It's special truly and I've suppressed it for years.  remembering it is scary but also incredibly comforting     ",
      "willys-wonderland": "4/10 What an incredible time we live in to see Nick Cage in Five nights at Freddie's. Truly an inspirational crossover     ",
      "here-comes-the-boom": "5/10 Kevin James is hot     ",
      "deep-blue-sea": "10/10 Better than jaws   fuck jaws     ",
      "henry-portrait-of-a-serial-killer": "4/10 Literally just murder people porn  Why did I watch this in eighth grade I feel like I scarred myself     ",
      "jumper": "6/10 Jesus fuck Hollywood make another movie where it's just a dumbass that can teleport and he uses his power to benefit himself. This is the only one where the main character genuinely just uses his power to rob a bank cause like fuck it's so fun     ",
      "are-we-done-yet": "10/10 Yo?     ",
      "leon-the-professional": "4/10 The absolute worst music choices I've ever heard. Literally ruins the movie     ",
      "mean-girls": "7/10 I only knew the girl getting hit by the bus scene and thought this was a murder apocalypse movie   It's not that but it's still good!     ",
      "sky-high-2005": "8/10 There will never be another sky high     ",
      "scott-pilgrim-vs-the-world": "10/10 You can say scott is a bad character and still recognize this movie is a near masterpiece that's the fucking point     ",
      "promising-young-woman": " havent seen but sounds PROMISING LOL     ",
      "paddington": "7/10 This is just the Curious George movie and you know it     ",
      "rampage-2018": "4/10 I grew up playing the ever living shit out of the video game like that was one of my favorite games ever. This is just a lose excuse to have a big dumb giant animal movie with giant animals for 20% of the movie. It honestly didn't even have to be based on the game there's no fucking reason     ",
      "soul-2020": "10/10 Thank you     ",
      "leviathan-2014": "10/10 I've honestly never seen a movie with acting that doesn't feel like acting. It's like this movie just found a drunk chaotic family with issues and started recording all of their issues. It feels so insanely authentic to the point where you wanna cry just looking at them drown out their problems in any way they can     ",
      "we-can-be-heroes-2020": "6/10 Why was the trailers advertising it as a sharkboy and lava girl sequel when literally they're in it for 2 minutes and shark boy DOESNT EVEN FUCKING SPEAK  HE DOESNT SPEAK HE NEVER SPEAKS HE JUST GRUNTS LMFAOAOAOAOAOAOAOoa     ",
      "burrow": "10/10 FUCKKKKKKK     ",
      "interstellar": "8/10 To me this will always be half the most amazing space masterpiece that gives me the most genuine chills and goosebumps and makes me question everything in life  And half stupid ass bumbfuck ending dumbass stupid ass what the dumb halo ring human life bull bdkrkfigi     ",
      "alive-2020": "7/10 Me twitch streaming during the apocalypse     ",
      "the-package-2018": "4/10 Everyday I think about this movie for no reason and I fucking hate it     ",
      "what-happened-to-monday": "6/10 Dogshit writing but so much cool clone twin shots and some fun action. Good vfx and concept, but that writing poopoo     ",
      "the-babysitter-killer-queen": "2/10 Somehow this makes the first movie better     ",
      "mulan-2020": "2/10 Don't even gotta watch fuck you!     ",
      "phineas-and-ferb-the-movie-candace-against-the-universe": "8/10 Feb     ",
      "turbo": "4/10 A lot of fucking death in this one Jesus Christ     ",
      "blindspotting": "10/10 Still the most overlooked and underrated movie ever made     ",
      "oceans-eleven-2001": "8/10 A movie so good they skipped 1-10 hahahaha!!!     ",
      "talladega-nights-the-ballad-of-ricky-bobby": "8/10 The best purposefully trashy movie, a guilty pleasure of nostalgia and joy     ",
      "the-fate-of-the-furious": "8/10 The rock can beat my ass any day     ",
      "furious-7": "8/10 I fucking cried bro I fucking cried fuck what     ",
      "fast-furious-6": "6/10 Okay, back to the bullshit     ",
      "fast-five": "7/10 Genuinely and unironically great     ",
      "fast-furious": "4/10 Too serious but the turning point in the series     ",
      "the-fast-and-the-furious-tokyo-drift": "4/10 The only boring character is the main character     ",
      "2-fast-2-furious": "5/10 Not fast enough!     ",
      "the-fast-and-the-furious-2001": "4/10 Incredible masculine man kiss vibes     ",
      "hamilton-2020": "8/10 Lin Manuel miranda lip bite      ",
      "sleepless-in-seattle": "6/10 Tom Hanks is stalked for an hour and 30 minutes     ",
      "guardians-of-the-galaxy-vol-2": "8/10 Had a friend say this was trash  It's okay to be completely wrong sometimes  This movie has the most heart and soul in the marvel universe. It's gorgeously written and extremely powerful     ",
      "power-rangers": "6/10 Underrated     ",
      "scoob": "5/10 Damn     ",
      "batman-vs-teenage-mutant-ninja-turtles": "9/10 This a masterpiece and y'all afraid to admit it     ",
      "solo-a-star-wars-story": "8/10 I'm Han Solo I'm Han Solo I'm Han Solo solo soloolllloooo     ",
      "the-ant-bully": "7/10 Underrated as FUCK     ",
      "extraction-2020": "5/10 Man brain guhgsh shoot shoot I like  Turn brain off enjoy slight     ",
      "the-perks-of-being-a-wallflower": "6/10 THE FUCK IS THIS SHIT     ",
      "mamma-mia-here-we-go-again": "6/10 First is better but still fun     ",
      "mamma-mia": "7/10 First time watching this gotta say I really love it  As Mario would say  Mamma Mia!     ",
      "onward-2020": "7/10 Bitches really too hard on this for no reason     ",
      "the-boss-baby": "5/10 Actually...not the worst     ",
      "kung-fu-panda-3": "6/10 Gay dads!     ",
      "hollow-man": "4/10 Damn how HOLLOW     ",
      "the-invisible-man-2020": "9/10 The only thing that I SEE is haha good movie     ",
      "total-recall": "10/10 Hot dog 3 titties so good     ",
      "the-gentlemen": "4/10 Boring fucking christ     ",
      "like-a-boss": "10/10 In many ways, the work of a critic is easy. We risk very little, yet enjoy a position over those who offer up their work and their selves to our judgment. We thrive on negative criticism, which is fun to write and to read. But the bitter truth we critics must face, is that in the grand scheme of things, the average piece of junk is probably more meaningful than our criticism designating it so. But there are times when...     ",
      "gemini-man-2019": "10/10 HAHAHAHAH     ",
      "dora-and-the-lost-city-of-gold": "10/10 Yes     ",
      "fast-furious-presents-hobbs-shaw": "9/10 I like boys and men     ",
      "midsommar": "8/10 Never taking a trip w da boys     ",
      "crawl-2019": "6/10 I live here     ",
      "stuber": "4/10 It's just my vidcon trip     ",
      "men-in-black-international": "6/10 Meh     ",
      "paul-blart-mall-cop-2": "1/10 Suck my fat fucking nuts     ",
      "godzilla-king-of-the-monsters-2019": "5/10 Bruh why you so loud god damn     ",
      "brightburn": "5/10 THE FUNNIEST FUCKING END CREDITS CUT IN THE WORLD     ",
      "long-shot-2019": "7/10 I deadass fucking cried this is so cute     ",
      "paul-blart-mall-cop": "1/10 Fuck you     ",
      "us-2019": "9/10 Them     ",
      "glass-2019": "4/10 Ass     ",
      "replicas": "10/10 10/10 BEST MOVIE EVER MADE BOOT THE MAPPING SEQUENCE OH NO ITS ME KEANU REEVES A ROBOT WEARING A FUCKING SUIT WHY IS THE ROBOT WEARING A SUIT WHY IS HE WEARING A SUIT THIS IS A MOVIE MADE NY ENTERTAINMENT MOTION PICTURES AND COMPANY FILMS AHAHAHAHAHAHAHAHA     ",
      "black-mirror-bandersnatch": "7/10 Bandersnatched my wig     ",
      "if-beale-street-could-talk": "9/10 Beale Street would say this movie is great     ",
      "escape-room-2019": "3/10 ahahahahahahahahhahahahaha     ",
      "bird-box": "4/10 Need more dog boxes     ",
      "aquaman-2018": "4/10 Aquaduct is now my favorite soap opera     ",
      "mirai": "8/10 It's like a happy Japanese Coraline     ",
      "sorry-to-bother-you": "10/10 It's okay man, bother me all you want     ",
      "fantastic-beasts-the-crimes-of-grindelwald": "4/10 Grindelballs     ",
      "overlord-2018": "7/10 More like Overload with fun am I right     ",
      "bohemian-rhapsody": "5/10 OOOOOOAHHHHH no.     ",
      "a-star-is-born-2018": "10/10 Severe lack of solar systems but overall a good time     ",
      "assassination-nation": "5/10 Huhhhhhhhhhhhh     ",
      "the-predator": "2/10 Prededon't     ",
      "slender-man": "1/10 Slender ain't thicc     ",
      "crank-high-voltage": "9/10 Dank     ",
      "her": "10/10 Him     ",
      "drive-2011": "10/10    Vroom vroom I'm a car     "
   }
}