{
   "user": "brat",
   "reviews": {
      "the-hudsucker-proxy": "8/10 Jennifer Jason Leigh with the rapid-fire verve of Rosalind Russell in His Girl Friday mixed with the brainy elegance of Katharine Hepburn in The Philadelphia Story with a touch of the big city brassiness of Jean Arthur in Mr. Deeds Goes to Town ...! i am head over heels for the way she dismissively flicks her wrist at the newspaper men, the cartoonish way she's always slapping Bruce Campbell—one of the all time great hand performances??  i'm not sure if...     ",
      "rise-blood-hunter": "3/10 Lucy Liu vampire reporter!! movie begins with her seducing a woman and goes sharply downhill from there. speaking of women, it could've been cool if they hired maybe 2-3 more of them to be involved with the production. as it is, everything they make Lucy Liu do comes off as fetishized in a way i found degrading and displeasing, especially as a vampire reporter myself. our stories matter and deserve respect!  that said, she has this line i keep doing...     ",
      "tenet": "5/10 we drove 2 hours from LA to san diego just to see Tenet! At The Drive-In then spent about 75% of the trip home complaining about basically every aspect.   it's a puzzle box with no reward or sense of satisfaction. i enjoy being challenged by complex films when they proffer some sort of emotional truth, but Tenet is all logos and no pathos — the only time any character exhibited any remotely mortal quality was when robert pattinson got sleepy...     ",
      "spy-kids-3-d-game-over": " \"don't fall in love with a game, Juni\" —grandpa from Spy Kids 3-D: Game Over and my friends whenever i talk about my virtual vampire bf from Baldur's Gate 3 like he's real     ",
      "the-bitter-tears-of-petra-von-kant": "9/10 luxurious + lugubrious chamber melodrama about how hard it is to wait for a phone call when you're a girl or gay or both     ",
      "watching-the-detectives": "6/10 Cillian Murphy x Lucy Liu rom-com set in a video store. it starts with Cillian's cinephile character getting dumped by his gf because he makes her watch The Seventh Seal and fawns over Bergman too much. ok me vibes ...   against my better judgment i have been reluctantly charmed and am awarding this nerd male fantasy movie a generous three stars and a heart. i think if they had not cast two of the most telegenic people on the planet this would be borderline unwatchable. but as it is, Cillian Murphy and Lucy Liu kiss through a hole in the fence, and that is certifiably cute :)     ",
      "birdman-or-the-unexpected-virtue-of-ignorance": "8/10 there are so many Birdman haters i feel like i need to justify my 4-star rating with a review. here it is:   this movie is indebted to Opening Night (1977), was shaped by and for theater kids, and is annoying to the general public. and you know what? so am i >:)     ",
      "poor-things-2023": "9/10 a grotesque picaresque! a phallic phantasmagoria. a ballad, a battle cry, a bildungsroman. words can be anything you want them to! Bella Baxter has seized upon this notion and inhaled it with gusto like a flaky pastry. she moves with a jerky insouciance across London, Lisbon, Alexandria, Paris, eager to sculpt every cell of her malleable mind, body and soul.  she is shameless. she is reckless. she is underworked and oversexed, pulsing, beating, bursting through the fleshy walls of God's...     ",
      "mickey-blue-eyes": "5/10 i made my friends watch the \"foppish Hugh Grant marries into the hypermasculine Italian mafia rom-com\" with me for my birthday and even though two people left a quarter of the way through i'm pretty sure they all still like me! yay!!!     ",
      "love-actually": "6/10 to me, you (Love Actually) are (so egregiously flawed that you swing back around to) perfect. on one hand, it is a horribly written trainwreck that finessed its way into the holiday canon through sheer star power and a grand total of 3-5 charming moments in a 135-minute movie. on the other, i need to rewatch it every December or risk septic shock. more urgently, i need to smoke three fat blunts with Hugh Grant (sativa), Colin Firth (indica), and Emma Thompson (hybrid)     ",
      "may-december": "9/10 a beautiful venomous butterfly of a movie! my Portland pal Todd Haynes' latest is a probe into the delusional denials of perpetrators, their abject refusals to take culpability, their banning from entry even a germ of the thought that maybe, just maybe, they did something wrong. it's also about how Julianne Moore's character might not have enough hot dogs for their cookout and this is the worst thing that has ever happened to her, much worse than anything she might...     ",
      "the-house-of-mirth": "8/10 we have exactly ONE non X-Files feature film with Gillian Anderson in the leading role she deserves and they don't even let you stream it. i mean yeah it's on Showtime, but nobody has Showtime. i know this because i've been trying so hard to watch The Curse :(  also, Gillian stars as Lily Bart, a beautiful woman in gambling debt, much like Marge Simpson. Lily Bart Marge Simpson. Lisa Bart Marge Simpson. makes you think for sure     ",
      "greenberg": "4/10 hoo boy that Greenberg fella pissed me off something awful but the Greta Gerwig character (innocent, deserves justice) had two lines that made this worth it:1. \"I was thinking this morning that I've been out of college now for as long as I was in. And nobody cares if I get up in the morning.\" (#1 thought had at age 26)2. \"I've got to stop doing things just 'cause they feel good.\" (#1 lesson learned at age 27)     ",
      "daybreakers": "5/10 Ethan Hawke movie where he plays a vampire named Edward: *establishes its dystopian world via news headline that reads \"How A Single Bat Started It All\"*my broken brain that has been fed a steady diet of Mr. Brightside on repeat for 20 years: it started out with a bat how did it end up like that it was only a bat it was only a bat     ",
      "killers-of-the-flower-moon": "9/10 i interviewed new Letterboxd member Martin Scorsese about the films that informed Killers of the Flower Moon, and what's more, i managed to not pass away while doing it. full 11-minute video here, deep-dive article here, and his official list of 59 companion pictures to his entire filmography (which he overcame his fear of e-mails to send to us) is here. i cannot believe i got to type all of that, and that i got to press post, and that the links...     ",
      "the-big-shave": " a perfect short because the runtime of 5 minutes and 53 seconds turns out to be exactly how long it takes me to eat half of a Jersey Mike's sub sandwich! #italianamerican     ",
      "spider-man-3": "5/10 in 2007 i saw this movie twice in theaters because 1. it looks like Spy Kids 3D and i was 11 years old2. emo Peter Parker's dance sequences (plural) evoked intrigue, titillation3. was investing in my Topher Grace stocks early   i would like to give this a \"heart\" for the reasons listed above, but i would not like for it to show up in my \"liked\" section, as it doesn't necessarily represent me nor my values. pretend i am giving this \"half a heart\", which signifies heyyy babe i'm just having fun; let's not get serious     ",
      "a-personal-journey-with-martin-scorsese-through-american-movies": " \"John was fearless. A true renegade, setting up one psychodrama after another with the complicity of a whole close group of actor friends. He insisted on having fun while making films, while looking for some kind of truth—maybe even a revelation .... All of Cassavetes' films, they were all epics of the human soul.\" —Marty succinctly pinning down exactly what made John Cassavetes such an intuitive, singularly iconoclastic director :)     ",
      "all-of-us-strangers": "8/10 setting your treatise on the power of love to a song called 'The Power of Love' might come off as treacly to some, but i cried three separate times, so whatever, ya got me. its intermittent moments of on-the-nose earnestness are offset by dips into the abstract: fever dreams morph into sweaty nightmares; fixed reality collides with malleable memory; the knot of fear temporarily untangles, only to re-tie itself into an even tauter pretzel.  basically, this is a feature length...     ",
      "the-feeling-that-the-time-for-doing-something-has-passed": "6/10 worth my time just for the 45-second scene where the failgirl lead is arguing with her dinner date about musicals and insists, \"Les Mis is the best! ‘Empty Chairs at Empty Tables'? ‘A Heart Full of Love'? ‘Bring Him Home'? ‘Valjean's Soliloquy?!?!\"   i wrote this down because i think i've said that word for word but picked different songs (‘Master of the House', ‘On My Own', ‘The Confrontation', ‘Do You Hear the People Sing?')     ",
      "dog-day-afternoon": "10/10 a perfect picture for about 10 million reasons, one of which being that Al Pacino gets to deliver two of the most powerful lines in cinema history:\"The guy who kills me, I hope he does it because he hates my guts, not because it's his job.\"and\"What? Oh girlie, please.\"     ",
      "julie-julia": "7/10 the high-pitched squeals and guttural moans emitted from me and the girlies when Chris Messina eats the bruschetta needs to be studied in an audio laboratory     ",
      "postcards-from-the-edge": "8/10 coincidence that they cast dennis quaid aka harrison ford Lite™ as carrie fisher's love interest?? i think not!!!! 👀     ",
      "ishtar": "7/10 Elaine May knows that comedy is when one guy is short and one is tall and they are both dumb as hell! yet, much like another almost-as-talented Jewish prophet, they crucified her for telling the truth (can be dangerous business)     ",
      "heartburn": "7/10 Mike Nichols movie adapted from Nora Ephron book starring Meryl Streep :) please don't get mad at me but i wish they had cast somebody with sex appeal in the Jack Nicholson role. i thought this was maybe a normal opinion until i read all the reviews by girls going feral for him. i may not be a part of that community but i wish i were so i could give this a full 4 stars like i did for the original novel on Goodreads. a life in which i cannot log and rate every piece of media i consume is no life at all     ",
      "angels-in-america": "10/10 352 minutes of me rocking back and forth with my head in my hands repeatedly muttering \"it's the great American play it's the great American play it's the great American play\"     ",
      "eden-2014-1": "8/10 didn't expect this to be historical fiction about Daft Punk. the bit where they keep getting rejected from clubs because no one recognizes them with their helmets off is funny. should've ended with an epilogue that says \"and that spurned electronica duo? yeah, they went on to make a little ditty called Instant Crush feat. Julian Casablancas ...\"  Greta Gerwig as manic American dream girl was another welcome surprise! to me, this takes place during the time period when Frances Ha...     ",
      "the-accidental-husband": "3/10 you've got Miss Kill Bill. you've got Mr. Darcy. HOW do you fumble the bag this badly... Griffin Dunne you will pay for your crimes against the noble sub-genre of New York-set romantic comedies. your aunt Joan Didion couldn't have done a pass on this script? maybe injected it with some much needed wit, charm, perhaps even a touch of pathos?   at its best when being After Hours for girls (Uma Thurman trying to do a task but is continuously...     ",
      "barbie": " Barbie is a bubbly, Technicolor concoction of contemporary and Golden Age Hollywood, complete with plenty of sugar on the rim and novelty curly straw. yes, Greta Gerwig's fantasy-comedy-kind-of-musical is inescapably a corporate studio movie, but it's wonderful to see what she and her crew can do with their monolith-sized budget: perfectly pink and practical production design by Sarah Greenwood and hundreds of sparkling costumes by Jacqueline Durran (both women worked on Joe Wright's Pride & Prejudice and Atonement). also, Ryan Gosling...     ",
      "indiana-jones-and-the-kingdom-of-the-crystal-skull": "5/10 The Legend of Indy: Tears of the Kingdom of the Crystal Skull  being severely Zelda-pilled made this more tolerable than days past. giant landscape geoglyphs ... physics-based puzzles using crystals as keys ... caves containing creatures with funny bulbous heads ... Lydia Tár in Peru wielding the Master Sword ... i'm astral projecting out of the Lost City of Gold and into Hyrule. knowledge is NOT my treasure—rupees are! :)     ",
      "mean-girls": "8/10 loooove revisiting the films of my coming-of-age as an adult because i notice so many surreptitious new details. this time it's the fact that Regina George has posters of The Strokes and this image of Colin Farrell on her bedroom walls. she's just like me fr! and that's terrifying     ",
      "down-with-love": "10/10 advocates for a utopian society by encouraging the Shiv Roy-ification of women (dominant redhead) and the Tom Wambsgans-ification of men (submissive worm). Succession proved that this is an ultimately ineffective fix, but the crucial difference here is that Barbara Novak and Catcher Block actually have brains, so it works!  💘     ",
      "penny-serenade": "7/10 have never seen Cary Grant cry on camera before and here he weeps soooo hard that a long string of snot drips down his nose... didn't know he had yucky stuff like that in him. thought he was entirely made up of Acqua Di Parma cologne and that liquid silver from Terminator 2: Judgment Day     ",
      "scream-vi": "    now that it is canon that Oppenheimer star Jack Quaid's character Richie Kirsch had a Letterboxd, i am going full Richie Truther. editing a flower crown and the word \"INNOCENT!\" on a pic of him now even though realistically he probably had me blocked and wished for my death on reddit dot com. Richie call me we can overcome this!!! you can be my latest ghost husband!!!!!     ",
      "ratz": " this movie is about changing two rats into guys! whatever!!! the best part is the guys keep their rat brains so they do not know English and are chewing through garage doors and kitchen pantries in search of cheese instead of being hot Spring Fling dates like the girls intended.  wait no, the BEST part is when they go to the mall and the rat-guys steal a popular girl's cheeseburger (they love cheese, remember), prompting the lead girl to say,...     ",
      "magic-mikes-last-dance": "5/10 not a good sign when a film that positions itself as an ode to women's pleasure left me (woman) bone-dry in the theater. i think it's very telling that the majority of the top positive/popular reviews are by men, and i don't mean that in a snarky eye-rolling critical way, but in a Hmmm I Think Maybe That's Whom This is Actually For And That's Fine way. happy for them even though these things' theses say (and boy does this...     ",
      "titanic-1997": "10/10 nothing has ever wrecked me like this. i repeat, no real-life event in the history of the world holds a candle to the awesome, inimitable wrecking power of this film     ",
      "beyond-utopia": "9/10 revolutionary. one of the best, most informative, most harrowing, most important documentaries i've ever seen. using hidden camera footage, candid interviews, crucial historical context, and so much more, it thoroughly and bravely reveals truths about North Korea that the Kim regime has gone to great lengths to cover up. there is so little in-depth reporting about the relatively new country's atrocities because it's virtually impossible to get anything in or out, much less record. it's a minor miracle that these...     ",
      "infinity-pool": "8/10 (NC-17 cut—see comments for more info)  freaky, funny, goopy, gory, GREAT! a charred-black class satire, a speculative sci-fi, a fluid-filled horror, and an erotic phantasmagoria all at once. together, Alexander Skarsgård and Mia Goth explore the body's capacity to repulse and delight, to entrap and liberate. extreme close-ups of the leads' facial features envelop the frame; the lens purposefully distorts background characters' heads into orbicular blobs. in a world with (almost) no consequences, how far would the wealthy go in...     ",
      "the-disappearance-of-shere-hite": "8/10 invigorating and hopeless. Shere Hite unlocked the secrets of orgasmic pleasure and was swiftly celebrated then just as swiftly punished for it. how did i get through all those women's history classes without hearing her name alongside Betty Friedan or Simone de Beauvoir? once a woman stands up for herself, allows herself to be publicly and righteously angry, she disappears. an act that should make one burn brighter is instead the catalyst for fading away.   Nicole Newnham's documentary entwines gorgeously...     ",
      "grind": "4/10 sometimes a movie you've never heard of nor have any desire to see starts autoplaying and you watch the whole thing purely because Adam Brody is in it as a sensitive skater boy     ",
      "avatar-the-way-of-water": "6/10 i can suspend my disbelief for teenage na'vi sigourney weaver but i draw the line at american jemaine clement     ",
      "women-talking": "8/10 \"I'm so sorry, Ona.\"\"One day, I would like to hear those words from someone who should be saying them.\"  a case study in universal empathy and righteous rage and fractured language and apologies that never come. director Sarah Polley is careful to refrain from depicting or reveling in any violence, opting to center the internal aftermath rather than the horrific inciting incident (which happened in 2009 to a Mennonite community in Bolivia).   more thoughts about Women Talking (including the controversial color grading) in my interview with the film's stars Claire Foy, Judith Ivey and Sheila McCarthy for Letterboxd's Journal! ;)     ",
      "mrs-harris-goes-to-paris": "7/10 listen ... this is crazy to admit ... ahhh here goes ... i have a private list of every 2022 movie i've seen ranked purely by personal enjoyment. right now, Mrs. Harris is at #4. she's above Crimes of the Future, above RRR, above both The North/Batman, above a total of ~40 others. i think i enjoyed it so much because Isabelle Huppert is SO mean as Lesley Manville's Phantom Thread character and Lesley Manville is SO charming as Paddington...     ",
      "jeanne-dielman-23-quai-du-commerce-1080-bruxelles": "10/10 quietly radical. yes, it's boring, and that's the point: being a housewife is boring! especially in the 70s, when you don't have games on your phone!!! if it's this \"tedious\" (non-derogatory) to watch her for 3 hours and 20 minutes, imagine the drudgery of actually living it. it's sooo easy and fun to sing yes i do the cooking, yes i do the cleaning but not so to actually do it...   Chantal Akerman forces you to memorize and empathize with...     ",
      "two-weeks-notice": "7/10 i've said it before and i'll say it again ........ the scene where Hugh Grant carries Sandra Bullock through traffic so she can blow out an RV bathroom is THE definition of romance ........ the epitome of modern-day chivalry! ladies, if your man won't go to the ends of the earth to prevent you from shitting yourself in public .... DUMP HIM     ",
      "sex-and-the-city-2": "2/10 extra 1/2 star for beginning with Liza Minnelli in a bedazzled suit doing a choreographed dance to Single Ladies after officiating a gay wedding. smart creative choice, as it sets you up to believe that the movie may be good     ",
      "sex-and-the-city": "4/10 every time i tell a friend i watched the Sex and the City movie they say \"is that the one where they go to Mexico and Charlotte shits herself?\" and i think that's beautiful     ",
      "guillermo-del-toros-pinocchio": "8/10 dang, GDT dropped that little wooden freak right into WWII-era fascist Italy! Pinocchio in his Porco Rosso era (call that Porcorocchio), but instead of his companion being the most beautiful woman in the world, it's the most beautiful cricket in the world (Ewan McGregor, who sings an original song, as does... Christoph Waltz?!).  oh, and Lydia Tár plays a monkey. perfect voice cast that directly appeals to me. GDT knows i've been burned too many times by the 12 other Pinocchio movies released within the past year. thank you king for reforming the Pinocchio-industrial complex. now we can finally abolish it :)     ",
      "meet-me-in-the-bathroom": "6/10 fuck it, i have decided to go long on Meet Me in the Bathroom because 14-Year-Old Me had the titular song's lyrics in the Favorite Quotes section of her now-defunct Facebook! i miss her naïveté ...  well, here's Present Me's review. watch if you are a fan of any of these bands: The Strokes, Yeah Yeah Yeahs, Interpol, LCD Soundsystem, The Moldy Peaches, TV on the Radio, The Rapture. then read Lizzy Goodman's oral history from which this was adapted....     ",
      "ticket-to-paradise-2022": "6/10 come for George Clooney and Julia Roberts, stay for ......... the comedic stylings of Lucas Bravo from Emily in/Mrs. Harris Goes to Paris?!?!?!?! 🤩  i know Lucas Bravo sounds like a fake name but i'm pretty sure he's real and i'm 100% sure he's going to be a star. watch this space     ",
      "re-animator": "8/10 loved it from the opening credits: a cascade of neon-lined Gray's Anatomy illustrations, implying a reinvigoration of fossilized knowledge. one of the scariest parts about science is how it is constantly changing; the break-neck velocity with which facts you thought were objective become obsolete. that is not at all the central horror of this story, which revolves around a twink mad doctor getting addicted to reviving dead tissue, but it is an auxiliary element that i found interesting :)  ultimately,...     ",
      "tar-2022": "9/10 \"TÁR GOES HÁRD\" — BRÁT     ",
      "who-took-the-bomp-le-tigre-on-tour": " a hefty portion of my personality can be distilled into Le Tigre's 1999 song \"What's Yr Take on Cassavetes?\" so i was ready to riot (grrrl) when it was tragically omitted from their DIY concert doc. turns out you just have to go to the DVD bonus features and click Live Performances! Oscilloscope knows exactly what the 269 people who have logged this on Letterboxd want: Cassavetes references in their feminist punk :)     ",
      "pinocchio-2022": "2/10 Robert Zemeckis' spiritual successor to Welcome to Marwen :( technology has not regressed but the working conditions for VFX artists have, and this is one of the clearest recent examples. Figaro is maybe the first cinema cat i've ever seen that wasn't cute, mostly because the CGI animation didn't look finished? if you told me this came out in 2002 I would have believed you up until Keegan Michael-Key shows up to tell a vacuous Chris Pine joke :( feels...     ",
      "topsy-turvy": "7/10 spent a big chunk of the runtime wondering what i recognized that \"Three Little Maids\" song from and then a guy outside the theater said \"the only Gilbert & Sullivan song i knew was the one that Sideshow Bob sings when Bart is trying to stall him in the Cape Feare episode\" 🙏 YESSSS i love the communal moviegoing experience!!!!! Sideshow Bob you will always be famous  EDITORIAL CORRECTION in the form of a comment from @JKAidan: Apologetically, while searching for...     ",
      "le-samourai": "8/10 LOVE when a traditionally handsome man turns out to be a lonely weirdo who spends his days chillin' in his dilapidated studio apartment with his caged pet when he's not risking his life at his unconventional job ❤️   (this guy and also fox mulder)     ",
      "spin-me-round": "5/10 ... at least tim heidecker got a free trip to italy (reason why cast signed on) and aubrey plaza got to kiss a woman (reason why i signed on)     ",
      "last-night-in-soho": "4/10 The Other Night in LA i had a 102-degree fever dream after falling asleep watching the Sex and The City episode where Carrie walks in a fashion show (S4xE2) and i fully became Carrie Bradshaw. like, same blue sequined Dolce & Gabbana dress, same Alan Cumming guest appearance as stylist who says \"me likey\", same everything. and the best part? it wasn't a sophomoric parable decrying the surface-level horrors of being a beautiful ingénue in the city!   anyway, Edgar Wright may have...     ",
      "the-janes": "7/10 \"Between 1968 and 1973, Jane provided an estimated 11,000 safe, affordable, illegal abortions. After Roe v. Wade, Cook County Hospital closed its septic abortion ward. It was no longer needed.\"  filmed long before that villainous Supreme Court decision was leaked in May 2022, the smiles on these >60-year-old Janes' faces when they fondly recall the memory of Roe becoming law in the 70s, a cause they literally poured blood sweat and tears into, are nothing short of devastating now. a...     ",
      "fire-of-love-2022": "8/10 The Life Volcanic with Katia and Maurice Krafft  French New Wave rom-com-tragi-documentary about a volcanologist power couple made me weep in the AMC. a starry-eyed reminder of romance and science's unlikely propensity to intertwine, told using sizzling 16mm archival footage and lyrical voiceover narration that i truly believed was performed by Jennifer Jason Leigh until the end credits told me it was Miranda July? lmk if i should be tarred & feathered for thinking this!     ",
      "who-framed-roger-rabbit": "8/10 if i had seen this at age 11 the Jessica Rabbit intro scene would've made me spontaneously combust. i would've imprinted on her soooo hard like thousands -maybe millions- of others. i could've been normal. instead, i watched Flushed Away, and now i'm married to a rat. call me BRAT RAT     ",
      "company-2008": "8/10 Raúl Esparza eating esparusual  ^ soooo yeah that's what i want my review to be. i've thought about it a lot and i don't have anything else to say about this staging of Company that i watched on youtube at 2 in the morning. sorry! \"Raúl Esparza eating esparusual\" is all you get. you could read it as an Eating Raoul joke if you want! it's not, but you could read it that way! anything to make you feel better about this.   Raúl Esparza eating esparusual     ",
      "the-black-phone": "5/10 fran already said this but ethan hawke's \"everything's all fucked up and i have to be upstairs for awhile\" is THE funniest line delivery in recent memory. it's 8:30am and i'm just standing at the kitchen sink laughing out loud to myself about it     ",
      "return-to-reason": " what upppp letterboxd i'm at MoMA learning about Man Ray. for instance, did you know he was an experimental filmmaker in addition to infamous SpongeBob supervillain?     ",
      "mad-god": "8/10 Phil Tippett!!!!! Phil Tippett. Phil Tippett worked on Star Wars, Jurassic Park, Starship Troopers, RoboCop, and the Twilight Saga. this guy designed Jabba the Hutt AND supervised the CGI vampire birth scene from Breaking Dawn: Part 1 (two equally important cinematic events), and in between those ~30 years he was working on this passion project: an experimental stop-motion dystopian nightmare yuck-fest with no dialogue about the abject horrors of war, the body, and Eraserhead baby-esque creatures. to me, that's one of the top 3 coolest things ever. Phil actually Tipped it that absolute Mad God hahahahahahaha!     ",
      "dead-ringers": "9/10 new fav cronenberg alert! instead of his usual venereal horror, the horror here is more psychological, derived from extreme co-dependency, fractured identity, and debilitating paranoia. how do adult identical twins who have spent their whole lives believing they're one soul go about separating themselves without losing their respective individualities? thematically and visually (those blood-red surgical robes!), this is some of cronenberg's strongest and most cohesive work.  (also... not to make every possible thing about robert pattinson... but... he would've nailed...     ",
      "crimes-of-the-future-2022": "7/10 as a Certified Cronenbabe, it's gratifying to see the definitive king of body horror return to his old-school roots. reminded me of an amalgamation of eXistenZ, Dead Ringers, and his novel Consumed, which are my favorite works of his, so i was an automatic sucker for this. fantastic speculative world-building exercise, and even if the plethora of themes/ideas didn't fully coalesce in the end, its imagery and effects were so grotesquely unique that i have to admire it.   this one...     ",
      "men-2022": "4/10 Alex Garland is in his mother! era. make of that what you will.     ",
      "pinocchio-a-true-story": "2/10 gay-coded pinocchio gets shot with a gun by a talking cat. it's no ratatoing but at least it's a true story     ",
      "the-northman": "8/10 hypnotically rhythmic, like the slap of an oar against the salty sea or the cavernous echo of a bear's death-knell roar. Robert Eggers takes a tale older than Hamlet and forges it in hot blood and magma, then soaks it in cold sweat and mud — i thought The Lighthouse was filthy (in more ways than one 😏) but he really dials up the dirt! my friend Grace tweeted it made her want to smash a rock open with her...     ",
      "everything-everywhere-all-at-once": "9/10 everything modern-day action blockbusters everywhere should be all at once: kinetic, daring, expertly choreographed, endlessly creative, laugh-out-loud funny, doesn't look like bland CGI shit, and anchored by a genuine emotional core.  finds balance in the chaos and chaos in the balance; a mess of contradictions that's actually not messy at all, because every detail in every sequence is discernibly crafted with zealous care. The Daniels also excel at proving that intelligent filmmaking and \"lowbrow\" humor are not mutually exclusive: butt-plug...     ",
      "stay": "6/10 got addicted to the new Lego Star Wars and watched this purely because Lego Obi-Wan reactivated my Ewan McGregor Disorder (EMD). it's a long road to recovery and i'm not interested in taking it     ",
      "the-conversation": "8/10 \"Feeling that the character was one-dimensional, Harrison Ford decided to play him as gay, a risky choice in 1974, and personally purchased the loud green silk suit for 900 dollars (4,285 in 2015 dollars). Francis Ford Coppola was at first shocked by the outfit at rehearsals, but after discussing it with Ford, was so impressed with this interpretation, that he expanded the role into a supporting character, gave the character a name (Martin Stett) and had Production Designer Dean Tavoularis create an office that reflected the character's orientation.\" - IMDb  fellas is it gay to wear a green suit and have a well-decorated office 🤔     ",
      "x-2022": "6/10 undeniably cool to see an original horror movie with all practical effects (made by Wētā Workshop of Lord of the Rings) and a clear love of the genre! went to a screening at the New Beverly and Eli Roth surprise showed up to moderate the Q&A -- he called it \"Texas Chainsaw meets Boogie Nights, but without being gimmicky.\"   got to talk about the film (along with Turning Red, Umma, and more) on Letterboxd's new podcast Weekend Watchlist, which i'm thrilled to be officially co-hosting!!! 🧡💚💙     ",
      "the-batman": "8/10 seen a lot of people comparing this to Zodiac and Se7en (agree) but not too many commenting on its most clear influence... the Saw Sa(w)ga. they straight up put Jigsaw in this movie and called him \"The Riddler\"? you can't fool me. i recognize that modulated voice, those motives, those theatrical torture traps that looked like they were pulled straight from Saw III and Saw V ...   none of this is a complaint! drop more superheroes into their own versions...     ",
      "kimi": "7/10 obviously soderbergh's intent with the shaky cam/low FPS is to capture the vertigo of agoraphobia, but ultimately this is a movie about how it feels to be too stoned at the grocery store     ",
      "american-psycho": "9/10 sooo much funnier upon 4th rewatch — a definitive satirical masterpiece? we were laughing our asses off imagining Dennis from It's Always Sunny's face superimposed over Patrick Bateman's hahaha   \"TOOLS! TOOLS! this is duct tape, zip ties, and gloves! I have to have my TOOLS! it's fetish... it's fetish shit! I-I-I like to BIND, I like to... be BOUND\"     ",
      "after-yang": "10/10 finally had that feeling i'm searching for every time i go to the movies: that tugging in your chest that signals you're watching something special, a new favorite; every scene, every frame is exactly what you were hoping for and more. WOW it feels good to fall head over heels for a new film again!  in his follow up to the meticulously gorgeous Columbus, Kogonada breaks down the barriers of the traditional nuclear household, positing that true family isn't conjured...     ",
      "the-tragedy-of-macbeth": "7/10 when i was Witch #1 in Sunset High School's 2011 Macbeth production i played it exactly like this     ",
      "skellig": " back in my tim roth era (never left it)     ",
      "resurrection-2022": "7/10    better, weirder, gorier, creepier than expected!  seems like a run-of-the-mill paranoid thriller until the audacious 8-minute unbroken close-up monologue by rebecca hall shatters the veil of normalcy. tim roth goes Full Freak and i love him for it!     ",
      "high-school-musical-3-senior-year": " they finally let ryan go full Fosse :')     ",
      "high-school-musical": " LucasGrabeel,BigTalent,Quite!Indeed,A+!     ",
      "liberal-arts": "2/10 fyi the very viral screencap of elizabeth olsen going \"you think it's cool to hate things, but it's not. it's boring. talk about what you love and keep quiet about what you don't,\" is from this sinister wretched vile little movie, written and directed by Ted Mosby of How I Met Your Mother.   Zibby (SHE'S NAMED \"ZIBBY\"!!!) is a free-spirited college student and Ted Mosby is the professor having a mid-life crisis who wants to fuck her sooooo bad because...     ",
      "the-power-of-the-dog": "8/10 the masculine urge to cope with your step-uncle's pointed homophobia by storming outside and aggressively hula-hooping     ",
      "bridget-joness-diary": "8/10 my favorite christmas movie because it includes all the best yuletide traditions! reindeer sweaters 🦌👕 kissing in the snow 💋❄️ two dashing englishmen engaging in physical combat for the love of a woman 🤼‍♂️❤️     ",
      "licorice-pizza": "7/10 here is the script i say whenever a co-worker asks me for my thoughts on Licorice Pizza: \"i liked it! was disappointed that i didn't love it, but Phantom Thread is my favorite PTA so my expectations were set pretty high. do you have a favorite PTA? Inherent Vice? wow! (note: i work at a record store) yeah i like the part in that one where josh brolin eats the weed, haha ...   but, yeah, anyway Licorice Pizza! as i...     ",
      "porco-rosso": "8/10 gina from porco rosso (english dub) is meg from hercules for girls whose lin from spirited away (english dub) was rosie octavius from the spider-man 2 video game     ",
      "thief": "8/10 james caan rockin white cuffed jeans, no shirt, and aviator shades is an all-time beach fit. absolutely recreating this look next time i'm frolicking on the san diego shore to celebrate pulling off one last big heist     ",
      "spencer-2021": "8/10 a surreal portrait of an isolated woman haunted by the burden of the past, the present, and the future. a psychological semi-horror, an antediluvian horror, a delicate horror; a decadent, hollow-eyed specter draped in the finest of pearls. how do you know what's real when you're living so high above everyone else, drowning in the yawn of the milky clouds?   but what's most terrifying about Spencer is its swirling depiction of the distinct pressure that comes with trying to rush your nervous breakdown in the bathroom because a roomful of uptight dorks are impatiently awaiting your return. aah!     ",
      "ira-abby": "6/10 chris messina indie romcom with 3.1 star rating is the first movie that the roomie and i watched on our new 65\" tv. been trying to thirst-watch it for years (the 2018 release of Sharp Objects). you couldn't rent it, couldn't stream it, couldn't even torrent it! i swear!! then one day hbo just unceremoniously drops it? the SAME month i inherit a giant tv? uhhhh yeah, you KNOW we're breaking that thing in with freakin IRA & ABBY!  here's some...     ",
      "bergman-island-2021": "8/10 a must-see for any and all Bergman Babes! rich interrogation of his life's work translated into a naturalistic romantic drama. oftentimes, the more i read/learn about a [usually male] artist i admire, the less enamored i am by them. thorny, devious, sometimes cruel; interesting as characters, as ideals, as archetypes, but unpleasant to think of them as real people who inflicted real pain instead of immaculate gods.   it's refreshing to see a nuanced and empathetic filmmaker like mia hansen-løve explore this layered idea,...     ",
      "titane": "9/10 beneath its steely and bloody exterior, beneath its impeccably directed body horror, even beneath all the fascinating things it has to say about the fluidity of gender, Titane is ultimately a film about love. about what happens when love brushes up against hate and fear and rage and alienation and every negative emotion oozing through your veins like motor oil. how love is born from the most unlikely sources, how it takes myriad forms (romantic, platonic, paternal, maternal, etc.).   Cronenberg's...     ",
      "pulse-2001": "8/10 a techno-ghost story that suggests the hollow detachment of the internet is a symptom that is both highly contagious and inescapable 😁  Pulse presciently predicted in 2001 that widespread internet use would lead to chronic loneliness, isolation, and misery; states of mind that are represented here as shadowy black stains and paranoid red tape. the dreary and dread-filled atmosphere supersedes its thin plot, crafting something trepidatious and ambiguous, eliciting scares from the ethereal and the existential rather than the visceral. had to see it on 35mm with a crowd so the internet ghosts that feed off of solitude couldn't get me     ",
      "life-itself-2018": "1/10 knew it would be bad of course, but didn't realize it would be one of the most evil, repugnant, treacherous pieces of media i've ever consumed. it's like if my nemesis John Green tossed Margaret (2011) and Babel (2006) into a blender that eviscerates all intelligence and meaning. somehow manages to render Oscar Isaac, a famously charismatic man, completely devoid of charm.   i started laugh-crying and rolling around on my friend's apartment floor 12 minutes in when the self-insert protagonist...     ",
      "the-voyeurs-2021": " a twisty ode to hitchcock/de palma that effectively captures that specific, strange eroticism of going to the optometrist. at its best when leaning into the stickiness of voyeurism vs. exhibition, of the power inherent in the act of looking. nice to see someone trying to revive and modernize the erotic thriller — also, sydney sweeney is a star!     ",
      "enchanted": "7/10 if my bf of 5 years left me for a cartoon princess .......... :/     ",
      "annette": "8/10    *at the hyperbowl halftime performance* oof. Yikes 😬thanks for letting me know, baby annette. unfollowing henry mchenry now. sorry i saw a joke tweet he made about how he became a comedian to disarm people, and that making people laugh is the only way he can tell the truth without getting killed. it wasn't very funny but i followed anyway. didn't realize he killed multiple people and made you perform internationally against your will, literally objectifying you to the point of depersonalization     ",
      "final-destination": "7/10 there's a guy in this named agent schrek. characters keep saying things like \"get me agent schrek!\" and \"agent schrek is on the line.\" if this movie had come out just one year later, they tragically would've had to change that. oh and also ummm all the airplane explosion stuff :/     ",
      "four-weddings-and-a-funeral": "6/10 FOR EVERY FOUR WEDDINGS THERE MUST BE A B̴͙̝̦̐͌͝L̵̜̋͠Ò̷̞̂͊̑͝Ò̷̳̭̫̳͗͝D̵̺͚͇̱̎͘ ̶͚̍̒̄Ṕ̷͔̕R̵͚̳̀Ȉ̸̼̣̽̈́C̸̡̙̟̑̔͝Ę̴̗̰̂͂͠͝ OF ONE FUNERAL  T̶̞̥̯̏̔͋̎̓H̴̨̏͑͋̓̏͜E̶͚̬̗̦̫͋̅̑̉ ̵͇͐̔̓B̴͙̝̦̐͌͝L̵̜̋͠Ò̷̞̂͊̑͝Ò̷̳̭̫̳͗͝D̵̺͚͇̱̎͘ ̶͚̍̒̄Ṕ̷͔̕R̵͚̳̀Ȉ̸̼̣̽̈́C̸̡̙̟̑̔͝Ę̴̗̰̂͂͠͝ ̵̡̻̥̅́̚M̷̡͔̙̈́̀̈́̚U̸̫̗̔̇̃͝S̵̟̋͠T̷͖͓̈ ̷͕̓͘͘͠B̶͓̱̻͝Ẽ̷̩̗̫͕̞͐ ̶̥̖̝͆͛̎͐̔P̷̖̈́Ȧ̵̧̠̫Ị̴̞͓̎̀͠͝D̸̡͕̭̪̈́̀͐ͅT̶̞̥̯̏̔͋̎̓H̴̨̏͑͋̓̏͜E̶͚̬̗̦̫͋̅̑̉ ̵͇͐̔̓B̴͙̝̦̐͌͝L̵̜̋͠Ò̷̞̂͊̑͝Ò̷̳̭̫̳͗͝D̵̺͚͇̱̎͘ ̶͚̍̒̄Ṕ̷͔̕R̵͚̳̀Ȉ̸̼̣̽̈́C̸̡̙̟̑̔͝Ę̴̗̰̂͂͠͝ ̵̡̻̥̅́̚M̷̡͔̙̈́̀̈́̚U̸̫̗̔̇̃͝S̵̟̋͠T̷͖͓̈ ̷͕̓͘͘͠B̶͓̱̻͝Ẽ̷̩̗̫͕̞͐ ̶̥̖̝͆͛̎͐̔P̷̖̈́Ȧ̵̧̠̫Ị̴̞͓̎̀͠͝D̸̡͕̭̪̈́̀͐ͅT̶̞̥̯̏̔͋̎̓H̴̨̏͑͋̓̏͜E̶͚̬̗̦̫͋̅̑̉ ̵͇͐̔̓B̴͙̝̦̐͌͝L̵̜̋͠Ò̷̞̂͊̑͝Ò̷̳̭̫̳͗͝D̵̺͚͇̱̎͘ ̶͚̍̒̄Ṕ̷͔̕R̵͚̳̀Ȉ̸̼̣̽̈́C̸̡̙̟̑̔͝Ę̴̗̰̂͂͠͝ ̵̡̻̥̅́̚M̷̡͔̙̈́̀̈́̚U̸̫̗̔̇̃͝S̵̟̋͠T̷͖͓̈ ̷͕̓͘͘͠B̶͓̱̻͝Ẽ̷̩̗̫͕̞͐ ̶̥̖̝͆͛̎͐̔P̷̖̈́Ȧ̵̧̠̫Ị̴̞͓̎̀͠͝D̸̡͕̭̪̈́̀͐ͅT̶̞̥̯̏̔͋̎̓H̴̨̏͑͋̓̏͜E̶͚̬̗̦̫͋̅̑̉ ̵͇͐̔̓B̴͙̝̦̐͌͝L̵̜̋͠Ò̷̞̂͊̑͝Ò̷̳̭̫̳͗͝D̵̺͚͇̱̎͘ ̶͚̍̒̄Ṕ̷͔̕R̵͚̳̀Ȉ̸̼̣̽̈́C̸̡̙̟̑̔͝Ę̴̗̰̂͂͠͝ ̵̡̻̥̅́̚M̷̡͔̙̈́̀̈́̚U̸̫̗̔̇̃͝S̵̟̋͠T̷͖͓̈ ̷͕̓͘͘͠B̶͓̱̻͝Ẽ̷̩̗̫͕̞͐ ̶̥̖̝͆͛̎͐̔P̷̖̈́Ȧ̵̧̠̫Ị̴̞͓̎̀͠͝D̸̡͕̭̪̈́̀͐ͅ     ",
      "ella-enchanted": " cary elwes dropping two feel-good fairy-tale rom-coms in the same year (this and Saw) is aspirational     ",
      "the-green-knight": "6/10 no offense but every adult erroneously calling this erotic or horny should try having satisfying sex. THINK before you get my hopes up     ",
      "pig-2021": "7/10 Presenting: A Portland Pig Perspective  watched this one entirely through the lens of someone who lived in Portland for 20 years. was most fascinated by the tension between the down-to-earth Oregonians who live here simply because they love nature, and the old (and increasingly new!) money Portlanders who could care less about the environment. this resentment has only been building as more and more people move to Portland -- especially since many of these newbies tend to be on the...     ",
      "when-in-rome-2010": "3/10 1 star for lee pace being 6'5\", 1/2 a star for josh duhamel being 6'4\". no more stars will be awarded because they never let these guys share a scene. and also because it's simply wretched     ",
      "legally-blonde": "8/10 something new to love on every rewatch! this time it's when Elle reassures Jennifer Coolidge's character by saying, \"Don't worry. My girlfriend Serena barfed on a guy during The Blair Witch Project, and they ended up dating for three months!\"     ",
      "barbarella": "7/10 🎶 she's got a Barbarella silver swimsuit and when she needs to shelter from reality she takes a dip in my daydreams 🎶  proof that sometimes a movie can succeed purely on the power of vibes and Jane Fonda     ",
      "the-green-ray": "10/10 articulates the inarticulable. that perpetual loneliness stemming from an inability to connect, a refusal to play the \"singles\" game of one night stands and futile flirting. a cavernous longing for actual romance, for actual companionship. the irrational urge to push people away and isolate when what you really want is the opposite. the feeling of laying on a crowded beach and still falling victim to the perception that you're the only person in the world.   and complaining about the emptiness...     ",
      "something-wild": "8/10 stayed up for my first midnight screening at the new bev and WOOHOO this was a blast!! first shot of young jeff daniels make me go \"oh nooo he's hottttt!\"   exceedingly charming performances and funny + compelling script that was written by a guy who was still in film school ....... which i suppose explains the occasional messiness, but somehow the several tone shifts work. like melanie griffith's character, the story is impulsive, capricious. whirlwind romance IS messy, especially when...     ",
      "luca-2021": "8/10 watched with the italian side of my family — uncle said he \"didn't care for it\" because of all the \"italian stereotypes\" like the pasta and the vespas. i was like, dude, you have a vespa in your front yard, you made spaghetti for dinner, and you named your kids leonardo and giuseppe. come on!   anyway, this is the first pixar movie i've liked enough to rewatch multiple times in ... over a decade? have said this before, but i...     ",
      "blazing-saddles": "7/10 this could never be made today 🤠 but only because laugh-out-loud studio comedies no longer exist 😔     ",
      "pirates-of-the-caribbean-at-worlds-end": "5/10    the way my interest in this franchise died when english character actor tom hollander did 💥😴 apologies to michael bolton but i will not be completing the tale of captain jack sparrow     ",
      "sinister": "6/10 \"my husband keeps making our family move into crime scene houses haunted by violent murders and now he's unleashed a paegan deity all because he wants to write the next great american true-crime book\" is a marital problem i would actually love to have. i think my friends would be sympathetic and it would be fun to complain about on our girls nights out! 😝     ",
      "a-history-of-violence": "7/10 david cronenberg's Les Mis. yeah i'll say it     ",
      "house-of-tolerance": "8/10 i am always, always talking about this, but the horrors that men inflict upon women's bodies is relentlessly eternal.   through disease, through physical violence, through rampant fetishism, through silencing, the male clients scar the women of the Apollonide brothel both literally and figuratively. one of them is plagued by nightmares where she cannot stop crying thick white tears of cum (a scene that made me cry tears of saline). but despite it all, there is laughter and camaraderie. in private,...     ",
      "pirates-of-the-caribbean-dead-mans-chest": "7/10 davy jones going Phantom Mode and playing organ with his face tentacles ... the sword fight on the spinning wheel ... oodles of Cronenbergian slime ... will and elizabeth being hot and refusing to communicate with each other ... english character actor tom hollander as smarmy powdered wig villain ..........  yup yup i'm annointing Dead Man's Chest as my official fav Pirate. who dares to join me crew 🏴‍☠️     ",
      "new-york-new-york": "8/10 the fact that this vibrant collision of romanticism and realism is somehow considered a \"lesser\" marty picture is a testament to the man's inability to miss. despite its box office failure and lukewarm reviews (musicalphobia is real...), its sonic impact has loudly and clearly reverberated throughout culture, decades and decades on. i'm talking specifically about when alex the lion sings New York, New York in Madagascar :)   more proof for my theory that 1977 was the greatest year for cinema     ",
      "my-best-friends-wedding": "6/10 had put off watching this for years because i always assumed the best friend's wedding in question was a gal pal, and that the conceit of the movie was julia roberts trying to steal her best friend's man. mean!   movie is still mean but not as mean as that. extra 1/2 star for rupert everett's rendition of \"I Say A Little Prayer\" and because i watched with my mommy and she liked it     ",
      "cinema-paradiso": "8/10    they paved paradiso and put up a parking lot     ",
      "the-wind-rises": "9/10 suggests that dreaming is pragmatic because it's the only way forward, that finding the beauty in the everyday rebuffs the hideousness of war and disaster, and that sometimes all a guy needs are his planes and his girl 😃  most likely would've cried if watched alone in theaters and not in friend's living room 😃     ",
      "the-twilight-saga-eclipse": "4/10 suck a dick jacob     ",
      "cruella": "7/10 i think the \"why would disney make a sympathetic movie about a puppy killer? 😡\" faux-outrage is the biggest SNOOZE!! you think they're actually gonna show her killing puppies? really? think about this for more than 5 seconds then criticize this 324-billion dollar corporation for ANYTHING else! we're drowning in a sea of reheated, lukewarm content and you're mad at the one that lets emma stone do deranged glam-punk camp? grow UP and have some FUN!     ",
      "eden-lake": "6/10    don't have enough knowledge of english class warfare to comment, sorry! luckily i do have enough knowledge on proposal scenes to confirm this one is an all-timer (gf tries to staunch bf's stab wound with coat, stumbles upon engagement ring in his pocket, bf launches into romantic monologue while bleeding out)     ",
      "smithereens": "8/10 \"You know, I had this dream last night: the whole world had been blown up five years ago, right to smithereens, and everyone was just floating around on parts of it, and they hadn't even realized what had happened yet... Tell me the truth, am I like really awful or something?\"  this is the movie i've been looking for!!!! Susan Seidelman's Smithereens feels cut from a similar cloth as Barbara Loden's Wanda, but smeared in that unmistakable scuzz of New...     ",
      "saw-3d": "4/10 watching the first Saw: oh no jigsaw's making a guy cut off his own leg!!!  watching the 7th Saw: the franchise's undeniable box office success demonstrates that it is in fact possible to integrate the new french extremity movement into the hyper-capitalist US film industry — the result is a radical, chimeric hybrid of populism and fringe interest. also jigsaw is my friend and he's right 80% of the time     ",
      "saw-iv": "6/10 this one's fun because the jigsaw killer finally switches it up and starts going after rapists and abusers instead of, like, people with depression     ",
      "saw": "7/10 ideal first date is getting caught in a sick and twisted jigsaw trap together because solving murder puzzles is inherently romantic (x-files, pushing daisies, etc), PLUS you're permanently trauma bonded if you survive. if you don't, to die by saw's blade is such a heavenly way to die. there's no way to lose     ",
      "columbus-2017": "10/10 even more pin-point precise on rewatch. themes are numerous (balance and structure, responsibility vs. ambition, attention vs. interest, the burden of the future, etc.), and they stack on top of each other like concrete jenga blocks, building a modernist architectural feat like the tower featured on the poster. so lofty, yet so down-to-earth. the atmosphere is quiet and meditative -- music doesn't really kick in until the 38-minute mark, when Casey is explaining her passion for the architecture of the...     ",
      "crash": "8/10 watched this in the living room and now all my roommates think i want to reshape the malleable human body through the immortal steeliness of technology by doinking my car :/     ",
      "the-great-mouse-detective": "7/10 can i use the \"gay rat\" tag if ratigan continuously insists he's a mouse? gonna do it no matter what but thought i'd be polite and ask first     ",
      "smooth-talk": "8/10 flirting with disaster and getting away with it. looking for trouble and screaming when you find it. the endemically teenage desire to die for just a little bit of attention.   Smooth Talk hasn't left my mind since i watched it. laura dern has always been a superstar. at work yesterday, i found a joyce carol oates collection and read the short story it was based off of (Where Are You Going, Where Have You Been?) on my 15-minute break. i...     ",
      "stargirl": "4/10 in Stargirl, 16-year-old protagonist leo's birthday is a major plot point. he receives a porcupine necktie every year from a mysterious benefactor. he is sad that his mom is working and cannot be home to celebrate. he is thrilled when manic pixie Stargirl surprises him at school with a ukelele serenade of Happy Birthday.   the next day, leo receives a text and we see the date on his phone: September 12th. as leo's birthday was the day before, this means...     ",
      "the-muppet-movie": "8/10 need to smoke a blunt with janice     ",
      "dinner-with-friends": "6/10 toni collette, greg kinnear, andi macdowell, and dennis quaid in a movie directed by norman jewison and shot by ROGER DEAKINS? AND it's based off of one of those plays that are entirely about two sets of couples fighting in various locations around the house?????  of COURSE the girlies and i loved this in spite of its flaws of COURSE we gasped and cheered and cackled through the entire 94-minute runtime of COURSE there's a classic scene of toni freaking out at the family dinner table     ",
      "ruby-sparks": "6/10    clever premise that wusses out with a 500 Days of Summer-esque ending but wilds out with the casting of annette bening and antonio banderas as the parents of paul dano and ❤️🇮🇹chris messina🇮🇹❤️  in zoe kazan's own words, the film is meant to challenge and subvert the gaze (noble goal!), and maybe her original screenplay did, but the end product materializes as toothless. we never get to see ruby as a real person, nor her life outside of calvin, and i'm...     ",
      "the-princess-diaries-2-royal-engagement": " chris pine     ",
      "slaying-the-dragon": " hard to rate this, as it's a 58-minute made-for-PBS special, but it's the only documentary i could find about the history and impact of cinema's dehumanizing stereotypes of asian and asian-american women. through archival footage of old films and interviews with pioneering asian actresses and other experts, our on-screen legacy is examined through a different, fresher lens (the doc is directed by chinese-american Deborah Gee and funded by Asian Women United).   we are told to be quiet, docile, submissive, passive;...     ",
      "chicago": "10/10 kept waiting for amy dunne to show up during cell block tango like \"my darling husband nick loved a girl i was pretending to be. 'cool girl.' men always use that, don't they? as their defining compliment. 'she's a cool girl.' cool girl is hot. cool girl is game. cool girl is fun. cool girl never gets angry at her man. she only smiles in a chagrined, loving manner, then presents her mouth for fucking. anyway, he dragged me, penniless, to...     ",
      "lara-croft-tomb-raider": "6/10 was trying to decide what to watch for international women's day and my boy roommate jokingly suggested tomb raider, unaware i own the blu-ray ($2.99 at amoeba music) and live my life as a lara croft apologist. then my other boy roommate stood up to turn off the lights so my girl roommate and i didn't have to move from the couch. allyship is awesome :) and so is this silly little movie that haters take too seriously! lara BEEN croft     ",
      "opening-night": "9/10 someone hire me as a film programmer so i can bill this and Her Smell (2019) together as a double feature called ABCDEFG: Aging Blonde Creatives Do Extreme Freak-Outs, Great!     ",
      "the-princess-diaries": "7/10 rewatching as an adult means noticing that mia has an elliott smith poster on her bedroom wall ... if that's who she's listening to on the poster then i hope she's okay <3     ",
      "rec": "7/10 lived my whole life thinking i'd seen this but it turned out i just saw the american remake Quarantine (2008) twice     ",
      "society": "7/10    eyes glued to the screen during the 20 minute flesh-squelching face-sucking anal-fisting body horror orgy but had to look away when they showed 5 seconds of worms in an apple :/     ",
      "the-lost-world-jurassic-park": "6/10 my jurassic park scheme would not be to open a deadly amusement park but to domesticate and snuggle the little dinosaurs :) in fact i think i will go do that right now     ",
      "i-blame-society": "8/10 fell in love with this one from the very first scene, where writer/director/star gillian wallace-horvat (playing a fictionalized version of herself) tries to convince a friend to let her come to his house so she can film herself \"hypothetically\" plotting to murder his girlfriend. her thesis is derived from a \"compliment\" she once received — that she would make a great murderer — which made her realize that those same skill sets also apply to auteur filmmaking. so why not...     ",
      "the-assistant-2019": "8/10 subtly, quietly devastating. the monstrous burden of knowing that doing the right thing is futile will never be lifted — even if you eventually choose to put it down, its ghost lingers. maybe you can do the right thing later, when you're a little higher up in your career, when you have a little more power. but by then, will it be too late? will you have warped into one of them? this is a horror story.  with almost no...     ",
      "the-wolf-of-wall-street": "9/10 there is such an overabundance of perfect wolf of wall street f-bomb deliveries that everyone gets to have their own unique favorite :) mine personally is margot robbie's \"stop flexing ya muscles, jordan! ya look like a fuckin' imbecile\"     ",
      "the-other-woman-2014": "6/10 clapping my hands and honking like a seal at the thought of john cassavetes living to see his son nick direct this movie, in which jaime lannister violently and publicly shits his pants then says \"i shit my pants\"     ",
      "supernova-2020": "7/10 tender and intimate, if a bit lukewarm. colin firth and stanley tucci knocking it out of the park as usual. their palpable chemistry is bolstered by colin's naturalism and stanley's theatricality — good thing, too, because the scant plot is dependent on the casting of actors up to the task.   the story itself is one that's (tragically) familiar: an older couple's relationship is tested by the onset of dementia. however, it finds room to break new ground by making the...     ",
      "king-kong-2005": "7/10 naomi watts: bitch, it's king kongking kong: yes, i'm king kongadrien brody: this is king kong?jack black: yes, miss king kong!!kyle chandler: and i'm kyle chandler :)     ",
      "mank": " i got shot at on my drive home from watching mank and mank was still the worst part of my night     ",
      "looking-for-alaska": "3/10 i have always wanted to write at length about the specific insidiousness of my nemesis john green's Looking for Alaska. so i'm gonna do it here, on a letterboxd review of a 2019 hulu miniseries adaptation that thankfully no one watched because it came out a decade too late!   for context: when i was a sophomore in high school, i read Looking for Alaska in one breathless night. i finished at 5 in the morning, and, through tears, immediately texted...     ",
      "hiroshima-mon-amour": "9/10 movie is explicitly about the \"horror of forgetting\" which means i'm allowed to earnestly transcribe and post my favorite part of the opening 16-minute mono-prologue in a futile effort to remember it, merci beaucoup!  \"I meet you. I remember you. Who are you? You're destroying me. You're good for me. How could I know this city was tailor-made for love? How could I know you fit my body like a glove? I like you. How unlikely. I like you. How...     ",
      "godzilla-king-of-the-monsters-2019": "5/10 me: i will never watch a MonsterVerse™ godzilla moviekyle chandler in the Godzilla vs. Kong trailer: godzilla is hurting people and we don't know whyme: i will watch every MonsterVerse™ godzilla movie     ",
      "my-favorite-wife": "7/10 every review already says this but bicon cary grant visibly sweating while watching his real-life boyfriend randolph scott do the sickest pool dive?? followed by a scene of cary grant unable to focus at work because he's being tormented by vivid fantasies of randolph scott and his flippy water acrobatics????? WWII should've ended right here     ",
      "mikey-and-nicky": "9/10 made my friends go see this (one of my top 4 favs!!!) with me because it serendipitously happened to be playing the day before my birthday. when it ended one of them hesitantly said \"... do you want my honest opinion\" (i smiled and said no) and another said \"THIS is how you wanted to celebrate your birthday??? i'm UPSET\"   yes! it's MY birthday and I get to pick the depressing cassavetes picture 🥳     ",
      "the-nest-2020": "7/10 carrie coon and jude law. CARRIE COON and jude law. carrie coon and JUDE LAW. CARRIE COON AND JUDE LAW!!!!!!!  so many dramas about upper-class families on the verge of collapse, of frustrated housewives and lying husbands, but what elevates The Nest  above its oft-stagnant sub-genre is that the doomed couple in question is CARRIE COON AND JUDE LAW. it's blonde-on-blonde emotional violence of the highest caliber, fermenting within the stone walls of their frigid manor, the antithesis of homey comfort. carrie coon is on her gena rowlands shit. jude law is on his Closer (2004) shit. i'm on my Don't Let The Academy Ignore Them shit     ",
      "life-2015": "4/10 still making my way through every robert pattinson film. it's getting exhausting. nevertheless, some thoughts:  i like dane dehaan! i do! i really do! but dane dehaan as james dean? giving multiple long, rambling monologues that you barely understand because he mumbles all his lines? taking valuable screen time away from the objectively less interesting photographer character played by robert pattinson? and worst of all ... interacting with eartha kitt but not reenacting the legendary threesome they had with paul...     ",
      "the-lobster": "9/10 my god i'm so lonely     ",
      "wallace-gromit-the-curse-of-the-were-rabbit": "8/10 wallace babe are you okay? you've barely touched your cheese 😳     ",
      "big-trouble-in-little-china": "6/10 hm ... i get that carpenter's intention is to poke fun at stale tropes about east asian mysticism and damsels in distress, but it feels more imitative than subversive. i'm also very very very wary of when a plot revolves around rescuing a woman who spends most of her screen time unconscious (even though Tenet came out 35+ years later i will still call it the Tenet Effect).  \"John Carpenter envisioned the film as an inverse of traditional scenarios in...     ",
      "finding-nemo": "9/10 i miss when pixar movies were 75% singular adventure, 25% sentimental message instead of the other way around     ",
      "the-bad-mothers-handbook": "2/10 DO NOT BE FOOLED BY THE POSTER!!! poster salaciously and falsely implies that robert pattinson is the protagonist and that catherine tate is the bad mother who takes advantage of him ... in reality, this is the premise: what if juno focused entirely on the mother/daughter relationship, what if robert pattinson played paulie bleeker, and what if it was all really really really really really bad? 🤔  THIRST WATCH RANKING:✮ ✮ ✩ ✩ ✩ -- 2/5DO NOT BE...     ",
      "event-horizon": "7/10 asked my roommate what she wanted to watch and she simply said \"space or ghosts.\"   went above and beyond by picking something with space AND ghosts AND sam neill being weird 💯     ",
      "let-them-all-talk": "7/10 lucas hedges active listening skills UNMATCHED     ",
      "black-bear": "8/10 clearly, intensely, MAJORLY influenced by cassavetes, which i had no idea about going in!! the story is split into two distinct parts, and the second half finds aubrey plaza going full Opening Night (plaza has previously talked about her love of both elaine may and cassavetes).  at its core, the film probes artists' relentless quest for authenticity, and posits two conflicting questions: -if someone is manipulated into feeling and behaving in certain ways, are those feelings and behavior truly genuine?...     ",
      "children-of-men": "10/10 predicted brexit     ",
      "twilight-2008": "6/10 read a few chapters of midnight sun for the Into The Twilight podcast before i felt my brain actively melt and had to stop. in chapter 13, however, edward asks bella what her favorite movies are, and her answers made the slog so worth it. here is her baffling little list; please feel free to psychoanalyze her potential letterboxd (hold the misogyny tho):  1. pride and prejudice, but she's careful to specify \"the 6 hour version with colin firth.\" what the...     ",
      "swallow-2019": "7/10 true unhappiness cannot be fully repressed. it physically manifests, no matter how glossy the plasticine smile, how pristine the glass house. sometimes you need tangible proof that your pain isn't just in your head.   a hybrid of domestic horror and psychological drama, as well as an ode to the sacred privacy of bathrooms, Swallow centers on newlywed and newly pregnant housewife Hunter (haley bennett). she lives in an immaculate upstate new york estate with her boring rich husband, where she's...     ",
      "shes-the-man": "6/10 this could've been a true cult classic if like one gay person were involved in production     ",
      "promising-young-woman": "5/10 \"I AM AWAKE IN THE PLACE WHERE WOMEN DIE.\" -- Jenny Holzer  been thinking about what to write about this one for the past couple of weeks. i can see why some hate it and why some love it, and after hours of reflection i've come to the earth-shattering conclusion that... it is just okay!   the title \"promising young woman\" itself is a reference to how the media called rapist brock turner a \"promising young man.\" many know brock turner,...     ",
      "its-a-wonderful-life": "9/10 beautiful film about the true core of morality, the importance of community care, and being so in love that you dance into a swimming pool! hmmm what is there to say about this classic that hasn't been said before ... well, here's something: i wish the title didn't transport me directly into a mid-2000s trailer for an animated movie. been wriggling around the apartment singing \"it's a wonderful life you gotta take it from me it's a wonderful life come on and break it on down\" and my roommates have to spray me with a water bottle     ",
      "cosmopolis": "6/10    a young billionaire with a razor-sharp jawline played by robert pattinson broods in a luxury vehicle as his faithful butler drives him across the crime-stricken city. cronenberg's prophetic interpretation of The Batman tries to say so much but ends up saying almost nothing at all. and honestly? i can relate to that ..   THIRST WATCH RANKING:✮ ✮ ✮ ✮ ½ -- 4.5/5dammit, another ROBsessed essential! he's got slicked back hair and a fitted suit that gets steadily more...     ",
      "how-the-grinch-stole-christmas": " grinch's heart growing three sizes is body horror     ",
      "the-great-gatsby-2013": "6/10 GATSBI XCX: 🎶i only threw this party 4 u, only threw this party 4 u 4 u 4 u — i was hoping you would come through, i was hoping you would come through (it's true, it's true)🎶     ",
      "ratatoing": " lots to love here! :)-the exact same suiting up montage (all in front of a blank white background) shown three times in a 44-minute long movie-everyone is shrill and yelling with voices like nails on chalkboards-\"YES DADDY I LOVE CHEDDAR\"-cat walk hind leg, look like frog-all the lady rats are sexy -- thick thighs, ample tiddies. boy rats? they are shapeless blobs. thought \"there's no way a single woman was involved in this production,\" only to discover afterwards that it is female-directed. suddenly, it's empowering!     ",
      "dr-seuss-the-grinch-musical": " was trying to hate-watch the benedict cumberbatch grinch and somehow stumbled upon something far more sinister     ",
      "the-muppet-christmas-carol": "8/10 people keep accusing me of cheating on roddy the rat from flushed away with rizzo the rat and i want to clear some things up: my newfound love for rizzo is PLATONIC and does NOT dilute my love for roddy. women and rats can just be friends. GROW UP     ",
      "bel-ami": "5/10 this movie's plot is literally just about a guy boning his way around 1890 paris and somehow it's still hard to follow...? at one point uma thurman yells about the scarcity of grain and rob pauses a few moments then says \"THIS IS BORING!\" which sums up the movie pretty well. at least it helped us realize that rob would be a perfect Weird Darcy in a twisted arthouse austen adaptation by, like, claire denis where he eats his own...     ",
      "good-time": "9/10 in that infamous robert pattinson reddit ama, he claims his favorite line he's said on film is, \"don't be confused, it's just gonna make it worse for me.\" didn't notice that line on first watch, but on rewatch its gravity was unmistakable, completely centering and solidifying Connie's egocentric perspective.   Connie Nikas is, to me, a 21st century Nicky Godelin from Elaine May's Mikey & Nicky, especially considering the Safdies have cited that film as a major influence. he's so cool, so...     ",
      "scooby-doo-2-monsters-unleashed": "5/10 i was thinking \"why isn't scrappy in this movie\" and then i remembered that he had been found dead in miami     ",
      "underwater-2020": " first thing tj miller (🤢) says to kristen stewart (😍) after she rescues him is \"you sweet, flat-chested elven creature.\" tapped out at that point to play chess.com on my phone for the remaining 80 minutes     ",
      "the-queens-gambit": "7/10    an unexpectedly edgy, introspective exploration of female desire and obsession wrapped up in the guise of a straight-laced chess drama (once you get past the lifeless-but-necessary first episode). all bisexual girl geniuses know how to do is smoke weed, pwn boys at chess, doink french models, unhealthily cope with childhood trauma, and lie     ",
      "ice-age": " body count in the 2002 animated children's film Ice Age: 23 😰     ",
      "little-ashes": "5/10 the spanish government funded this movie in which robert pattinson as salvador dali (?!) jacks off on the floor while making eye contact with his crush, the poet federico garcía lorca, as lorca is mid-coitus with a woman. why can't U.S. propaganda be more like THIS  THIRST WATCH RANKING:✮ ✮ ✮ ✮ ✩ -- definitely an important watch for the ROBsessed, especially considering it came out the same year as Twilight! skippable for... anyone else, really! :) but for...     ",
      "american-dreamz": "4/10 Bad when watched at age 14 with No understanding of bush era politics, Worse when watched at age 24 with Yes understanding of bush era politics :/ but dennis quaid as bush and willem dafoe as dick cheney?!?! that's Good!!!!!!     ",
      "when-harry-met-sally": "10/10 this is a psychological thriller. no, it's psychological WARFARE     ",
      "the-dictator-2012": "2/10 the live-action king julien movie not as awesome as it sounds :(     ",
      "it-happened-one-night": "8/10 can someone explain in a non-annoying way why in 1934 it cost $2.60 to send a telegram but only $2 for a night in a hotel?     ",
      "bruno": "4/10 if election night doesn't kill me, then this sacha baron cohen thirst-rewatch marathon will 🤒     ",
      "shrek": "8/10 (screened in black & white with french dubbing)  so lucky to catch this ultra rare print of French New Wave Shrek! it's so obvious that the directors intended the film to be shot in 35mm, in B&W, and on location in an actual swamp for added realism. the vastly inferior color version adhered too strictly to traditional form, but the B&W challenges the standard by intentionally confusing and boring its intended audience of children.  meanwhile, the french dialect injects a melancholy sorely...     ",
      "alice-through-the-looking-glass-2016": "4/10 me, stoned off my ass on a tuesday night: i guess i'll just like .,.. fuckign watch this movie featuring borat as a sexy clock & j*hnny d*pp as human jar jar binks. im a goddamn idiot fool and i can't wait to die     ",
      "marebito": "7/10 sometimes you are a little vampire girl having a chill time being naked and chained to a wall in the Mountains of Madness and a random guy picks you up and forces you to live in his apartment and drink his blood out of a baby bottle. we've all been there 🤷🏻‍♀️     ",
      "beast-2017": "8/10 an instant new favorite! so many themes are swirling around here — forgiveness, repression, isolation, regret, primal instinct, mistakes, atonement, self-destruction, cycles of violence and abuse — and they're all different shades of the same color.   the character of moll (jessie buckley 😍) exemplifies our worst instincts: hurtling headfirst towards something you know is gonna hurt your feelings, or pouring all your love into the first thing that looks at you with an intention so inviting, so arresting, that you...     ",
      "borat-subsequent-moviefilm": "6/10 borat has returned just when we needed him most <3   while the original feels like he's using his magnanimous powers for general chaos, subsequent moviefilm finds him using them for good. the idea of borat (6'3\") influencing one of the most important elections in american history is very nice! chenqui to MY favorite feminist superhero!   ps. \"wawaweewa\" count is high — lost track after 6. as it should be :)     ",
      "the-trial-of-the-chicago-7": "4/10 20 minutes in i realized this was a 2+ hour courtroom drama and groaned out loud. why didn't anyone warn me the trial of the chicago 7 was about a trial     ",
      "grimsby": "1/10 the final boss of sacha baron cohen thirst-watching. hp is almost completely drained; the SBC Battalion's shields are gravely weakened. there were moments when we didn't think we'd pull through (elephant sex scene our soldiers refuse to go into detail about). in the end, we managed to emerge alive. but make no mistake: this was no victory.   QUEST COMPLETED+20,000 XP     ",
      "dick-johnson-is-dead": "9/10 the empathetic docu-fantasies of agnès varda live on through kirsten johnson. attempts to answer the immutable question of how we are supposed to shoulder the burden of knowing that the people we love will die, then accepts that there is no answer. or rather, that acceptance is the answer.   there's a memorial bench at the cemetery by my apartment that reads \"LOVE IS LONGER THAN LIFE AND STRONGER THAN DEATH.\" it doesn't get more succinct than that.     ",
      "saint-maud": "7/10 obsession and possession are two sides of the same coin. illness manifests physically and mentally. how much can one suffer without losing their faith, their sanity?   rose glass's debut feature (!) expertly builds suspense and tension — it all leads up to an unforgettably shocking ending that burns itself into your memory, a stigmata for the hippocampus. i got irrationally scared in my bathroom when i returned home from the drive-in, which is an indisputable trademark of high-grade horror!     ",
      "devil": "4/10 reminds me of this guy's short film i had to watch in college that was essentially just a Saw rip-off but instead of the victims being punished for committing borderline-irredeemable crimes the killer kidnaps a guy for stealing a bike and a woman for cheating then writes \"theft\" and \"adultery\" on a chalkboard. so it's like that but also chris messina is there     ",
      "ring-1998": "7/10 🎶 IT'S BEEN one week since the ghost called me 📞👻 crawled out of the well and through the TV 📺👻 🎶     ",
      "come-back-little-sheba": "7/10 watched almost entirely because prior walter from angels in america named his cat little sheba, haha. really more of a 3 than a 3 1/2, but the historical context of it being made in 1952 elevates the thin plot — an older wife with a younger husband! a woman sketching a scantily clad man as he poses for her! they even say the word \"s*x\"!!! i would've fainted in ye ol' picture palace     ",
      "repo-the-genetic-opera": "6/10 made $188,126 on an $8.5 million budget because it spent all its money on casting paris hilton instead of hiring my chemical romance to compose the music. nevertheless i think it is bold + admirable to make a movie that caters exclusively to the marginalized subsect of emo girls who love horror and did theatre in high school. i am that 1%     ",
      "secretary": "8/10 *roman roy voice* ugh! hot. ugh!     ",
      "les-miserables-2012": "9/10 wild how my two favorite movie musicals of the decade (this and mamma mia! here we go again) and my favorite tv show (fleabag) and my favorite star wars (the last jedi) all feature my boy hugh skinner. no one else has the range!!! he IS the Actor of the Decade!!! this is a hugh skinner fan account now, which i'm hoping will distract everyone from the fact that i just admitted that tom hooper's les misérables is my favorite movie musical of the decade     ",
      "sisters": "8/10 unexpected but welcome addition to ACAB canon — cogent narrative choice for the cops to refuse to help the plucky gal reporter because she wrote articles denouncing police brutality. horror films often fall into the trap of relying on police to save the main characters' lives, so it's refreshing to see that subverted in a realistic and meaningful way.   also love how she explicitly called them out for not caring about the case because the violent perpetrator was a white...     ",
      "the-devil-all-the-time": "6/10    major déjà vu to a year ago when i thirst-watched The King, another gritty 2+ hour Netflix drama, for robert pattinson only for him to show up an hour in, do a batshit accent, and leave with 30 minutes left.* starting to worry i've been afflicted by some sort of witch's curse...?  anyway, here's a real thought so i don't get yelled at: this feels like an ineffective mash-up of The Tree of Life, There Will Be Blood, Zodiac, and...     ",
      "galaxy-quest": "8/10 you can tell how passionate the filmmakers are about star trek, and i think that's exactly what propels this into greatness. true satire comes from a place of love! sometimes indulges too hard in the very tropes it's attempting to parody (i.e. sigourney weaver character's costume miraculously being torn in a ~sexy~ way), but then atones by being very funny (i.e. letting her yell \"whoever wrote this episode should DIE!!!!\"). me like to smile and laugh :)  intensely reminded me of...     ",
      "inside-2007": "7/10 watched on a website called \"effedupmovies.com\" :(  and yes, i would concur that the movie is effed up. most effed up part was how whenever mommy was in danger it would cut to her in utero cgi baby — pack it up, RENESMEE!!! haha. but yeah it would be effed up if any of this happened to me :(     ",
      "the-book-of-henry": "2/10 i have exactly 3 positive things to say about this movie that i successfully convinced 5 people to watch with me at 9:22pm on september 11th:  1. it at least attempts to challenge the oft-false notion that our justice system actually serves to protect us 2. naomi watts got paid3. lee pace is 6'5\"     ",
      "im-thinking-of-ending-things": "9/10 while iain reid's novel extracts horror from blood and dread, charlie kaufman's interpretation extracts it from existentialism, from the unavoidability of aging, from the unease of being perceived, from the eeriness permeating the claustrophobic atmosphere. they both tell the same story in completely different ways, which is exactly what a book-to-film adaptation should aim to do.  in the book, there's a fascinating passage about how humans need allegory and metaphor in order to more comprehensively understand the world around us....     ",
      "sweeney-todd-the-demon-barber-of-fleet-street-2007": "8/10 sacha baron cohen immediately following borat with singing italian barber in goth tim burton musical was THE cultural reset of 2007. sorry to daniel plainview, anton chigurh, remy the rat, juno, zodiac's basement scene, and the green dress from atonement     ",
      "funny-ha-ha": "7/10 maybe it's a jump to link virginia woolf and jane austen to a mumblecore where half the dialogue is just various combinations of the words \"like\" and \"good\" and \"i don't know.\" but both authors argued that domestic stories were important to tell despite their perceived frivolity. and, yes, maybe it is frivolous for marnie to worry about her unrequited crush on alex when there are so many people with \"real\" issues. maybe i'd roll my eyes if she complained...     ",
      "the-nowhere-inn": "6/10 the premise of st. vincent and carrie brownstein playing themselves in a docu-fantasy about the disconnect between onstage and offstage personas is heavenly. carrie is trying to make a documentary about st. vincent's life on the road, but st. vincent just wants to play her nintendo switch! to me, that is awesome :)  to carrie, that is boring :( and when she tells st. vincent it's boring, she tries to make herself more interesting, blurring her personas together. lots of...     ",
      "chemical-hearts": "3/10 i laugh laugh laugh at the sad teens and their melodramatic poetry as if the shit i wrote in high school wasn't just as bad if not worse than \"you‘re an extraordinary collection of atoms, Henry Page\"     ",
      "night-on-earth": "8/10 oh to be soft butch taxi driver winona ryder escorting glamorous film executive gena rowlands around LA. oh to be glamorous film executive gena rowlands being escorted around LA by soft butch taxi driver winona ryder.   also, this imdb trivia hurt my feelings: \"This was Gena Rowlands' first film after the death of her husband, John Cassavetes. Several of their mutual friends, including Ben Gazzara and Peter Falk, visited the set to see how she was coping.\" 🥺🥺🥺     ",
      "the-adventures-of-robin-hood": "7/10 shrek vibes as fuck     ",
      "the-island-2005": "4/10    TWO ewan mcgregors?!?! what is this, fargo season 3?!?!?! 😝 haha but seriously folks, fargo season 3 is available to stream on FX on hulu     ",
      "claires-knee": "9/10 the story of an older man lusting after teens is an icky and taboo subject that's almost always mishandled, and, arguably, doesn't need to be told, but rohmer explores it with an unthinkable elegance. his definitive knack for dialogue translates the inexplicable into the explicable, pinning down the intricacies of desire's quicksilver nature: a flame that can be ignited and snuffed in the same heartbeat.   i was especially struck by laura –– she's infinitely more of an interesting, intelligent, complex,...     ",
      "the-muppets": "8/10 pretty disappointed that my favorite muppet rizzo the rat only makes a brief appearance. much like 1917, it seems like anti-rat propaganda. life's a happy song when there's rizzo by your side to sing along!      ",
      "win-a-date-with-tad-hamilton": "4/10 tad edward hamilton... my name is tad edward hamilton ... and there's a million dates i haven't won ... just you wait ... just you wait ....     ",
      "lovely-amazing": "7/10 2001 jake gyllenhaal with dyed black hair and a dopo yumé t-shirt looks like an anime character. i'm giving him asian-passing privilege     ",
      "american-gigolo": "8/10 told friend that richard gere goes full-frontal here and he said \"oh, you see his Gere Shaft?\"   haven't stopped thinking about this     ",
      "drowning-by-numbers": "8/10 first film i've ever seen that plays out like an I Spy game :) numbers 1-100 appear in ascending order, either disguised in the background or the characters' dialogue, which helped to keep my scattered, internet-corroded brain engaged. not that audience engagement is necessarily peter greenaway's prime objective -- the more of his (eerily fascinating) work i watch, the more it becomes evident that he caters pretty exclusively to his own personal fixations, among them mostly being death/decay, loveless marriages, and unorthodox eroticism. we #GreenawayGroupies are having a normal one!!     ",
      "the-notebook": "7/10 fav part is when ryan gosling wakes up after a night of lovemaking on the floor of a plantation (🥴) and tells rachel mcadams he wants \"pancakes, bacon, and chicken.\" just a bonkers breakfast order. pancakes and bacon? ok! pancakes and chicken? sure, i guess! bacon and chicken? gonna have to stop you there     ",
      "pillow-talk": "7/10 not flawless by any means but at the end of the day it needed to be made — otherwise the 100% flawless perfect gorgeous inimitable divine effervescent superlative transcendent Down With Love (2003) wouldn't exist. and neither would i     ",
      "wild-strawberries": "9/10 so many themes packed into just 91 minutes: aging, guilt, regret, death, dreams, subconsciousness, memories, marriage, love, fear ... all standard for bergman's oeuvre but especially realized here. amazing how he crafted such a tender, credible portrait of an elderly man when he himself was just under 40. Wild Strawberries feels like a swan song, somehow sung 60 years before his death.   happy birthday, ingmar 💙     ",
      "wanda": "8/10 there's an acrid authenticity to the character of Wanda: at once submissive, passive, and tenacious — a flickering blue flame, a pilot light ready and aching to burn it all down.  as the first narrative feature ever to be written, directed by and starring the same woman (Barbara Loden), Wanda is undeniably herstoric, without even really trying to be, which is maybe why it succeeds. i know i've talked about this before and often, but contemporary studio feminism is so...     ",
      "after-2019": "4/10 i've said it before and i'll say it again ... women deserve the right to make bad fan-fic movies and get paid for it <3     ",
      "one-sings-the-other-doesnt": "9/10 friendship informs identity which informs friendship. it's cyclical –– gaining a friend feels like gaining a piece of yourself you didn't know you were missing, and losing a friend feels like losing that piece.  over the course of 14 years, close friends Suzanne and Pomme feel separated from themselves when separated from each other. i kept being reminded of this quote from Elaine May's Mikey and Nicky:   \"I think that's the reason we're such good friends. Because we remember each...     ",
      "scoob": "3/10 correctly guessed that a character would dab 😔     ",
      "shallow-grave": "8/10 admire how successful this is at being so many different movies at once:~a paranoid parable about how quickly distrust can unravel the closest-knit friendships   ~a lyrically edited and claustrophobic crime story that knows exactly who/what to focus on in order to stay engaging (the protagonists' turmoil and NOT the detectives' investigation ... who CARES about procedurals! not danny boyle thank GOD)  ~an elusive fantasy about being twenty-something and able to afford living in a huge beautiful apartment in the city with your roommate ewan mcgregor whom you just performed one of the all-time intimate acts with: corpse burial      ",
      "we-are-your-friends": "5/10 magic mike for DJs..... call that magic MIC!!!!!!!!!!!!!!!!!!! 😝😝😝     ",
      "ball-of-fire": "8/10 a republican professor and a bad boy mob boss engaging in fisticuffs for the love of a woman? ok BRIDGET JONES     ",
      "close-encounters-of-the-third-kind": "9/10 had previously only seen the climactic five-tone scene on a sleepover in 4th grade when we were surfing for scary movies. friend said \"BORING!\" and changed the channel. adult me does not think \"BORING!\" she thinks \"BALABAN!\"   here is what she also thinks: WOW!!!!!!!!!!! some of the most beautiful cinematography and visual effects of the sci-fi genre –– vivid bursts of cosmic color instead of sterile chrome. a simultaneously condemning and sympathetic portrait of obsession. the elastic tone effortlessly mutates from...     ",
      "bunny-lake-is-missing": "9/10 historically, so-called \"hysterical\" women have been subjected to institutionalization, lobotomies, and forced sterilization — this subtextual threat looms over our heroine annie lake's head like miasma. horror is derived from the all-too familiar dread of not being believed.  sorta feels like a precursor to Rosemary's Baby (the novel was published just 2 years after this film‘s release), and definitely feels emblematic of the second-wave feminism that arose in the 60s. can't believe i hadn't heard of it until demi suggested we watch it! #BelieveWomen (and #BelieveDemi) canon!     ",
      "normal-people-2020": "7/10 i don't have anything to say because mitski already said it:🎶what do you do with a loving feeling if the loving feeling makes you all alone? what do you do with a loving feeling if they only love you when you're all alone?  holding hands under a tablemeeting up in your bedroom making love to other peopletelling each other \"it's all good!\"   kisses like pink cotton candytalking to everyone but mei'm staying out late just...     ",
      "inception": " finally watched inception the way christopher nolan intended for it to be seen: only the first 10 minutes and on the big screen in fortnite 😌     ",
      "broken-english": "5/10 -i'm at the cassavetes picture-i'm at the parker posey picture-i'm at the combination cassavetes/parker posey picture     ",
      "electric-love": "3/10 one of the storylines is a podcast host invites one of her incel haters on her show and they end up ... falling in love???? wondering if i should try this. sounds healthy and safe     ",
      "babe-pig-in-the-city": " sex worker poodle in G-rated film     ",
      "babe": "7/10 me when babe was trying to be sneaky but got his tiny hoof tangled in the yarn     ",
      "the-devil-and-miss-jones": "7/10 obligatory review so i don't get yelled at for not talking about Movie: cute! ardently pro-labor + unionizing — impressive considering it's a studio film, and how the director and male cast were all conservative (not my girl jean arthur tho 😊).   ok speaking of jean! because she's what i'd actually like to talk about! recently realized i have such a gargantuan crush on her because she looks and speaks so similarly to gillian anderson, noted bisexual and one of...     ",
      "you-cant-take-it-with-you": "8/10 been watching a lot of capra movies recently (for jean arthur specifically) and consistently find myself wishing that the whole runtime was dedicated to the lead characters' respective romances? i know the larger themes of all-american idealism and wholesome human kindness are the ultimate point of his films and a crucial factor as to why they're so revered, but then jimmy stewart will say some shit to jean like, \"You're so beautiful. Like, sometimes you're so beautiful it just gags...     ",
      "mr-smith-goes-to-washington": "8/10 don't mind me — just trying to watch every single movie that the simpsons parodied. will be done in *checks schedule* 96 years     ",
      "my-neighbor-totoro": "9/10 Totoro has leaf on head : )     ",
      "shakedown-2018": "8/10 \"Some places are just hard to find.\"  in the early 2000s, a Black lesbian strip club thrived in an inconspicious LA building. Shakedown was one of the few safe spaces where they could experience total sexual liberation, until LAPD shut it all down in 2004. leila weinraub's intimate documentary demonstrates the inherent intersections between gay + civil rights, pleasure + community, oppression + policing — an essential relic for the past, present, and future.   streaming on criterion channel and at shakedown.film for free     ",
      "artemis-fowl": "2/10 good movie for getting high with your friends and exchanging bewildered looks over facetime  bad movie for hmmmm ... everything else i'd say. was initially worried colin farrell wouldn't be in it that much but wound up relieved he wasn't in it more. if i had watched this as a kid the josh gad unhinged jaw scenes (multiple) would've absolutely come up in therapy years later.   ultimately, this is a wrinkle in time for boys: incomprehensible disney action-sci-fi about a kid saving their hot dad. equality is when boys get to suffer too <3     ",
      "shirley-2020": "8/10 out of all eight 2020 releases i've seen (lol), Shirley is by far my favorite. josephine decker has acheived auteur status — just like in Madeline's Madeline, the camera swirls around her characters, the framing focusing on fragments of their faces, proffering a dreamy drift through the woods of vermont. it blurs the line between muse and friend and lover, and highlights the tendency of artists to take advantage of the people who inspire them most. should a muse be honored?...     ",
      "damsel-2018": "6/10 everyone here thinks they signed on to a do a coen bros x yorgos lanthimos thing and oh baby how i wish they did. yorgos x rob collab when?????????     ",
      "the-death-and-life-of-marsha-p-johnson": " unfortunately watched this without knowing that the director stole the basis for this documentary from transgender activist/filmmaker Tourmaline. instead, check out her and Sasha Wortzel's 15-minute short Happy Birthday, Marsha! (2018), which is (ironically) streaming on prime.   you can also donate to the following organizations dedicated to protecting Black trans lives:- Black Trans Protestors Emergency Fund — organized by the Black Trans Femmes in the Arts Collective, this fund specifically raises and posts bail for Black trans protestors. - Emergency Release Fund —...     ",
      "bob-carol-ted-alice": "8/10 stoned dancing elliot gould is my FRIEND! we hang OUT! we smoke WEED! we repress our longing for each other's WIVES! we have an ORGY with said wives before going to the TONY BENNETT CONCERT! it's NORMAL and COOL to do this ... because we are FRIENDS! 😁     ",
      "austin-powers-in-goldmember": "5/10 we finished our rewatch of the austin powers trilogy. don't have much to say about this one except that jay roach is now tied for my most watched director of 2020 with *checks stats* ah, john cassavetes and steven spielberg     ",
      "austin-powers-the-spy-who-shagged-me": "7/10 ok letterboxd here's the issue i'm having ... so, i rewatched international man of mystery last week and gave it 3 1/2 stars. but upon my rewatch of the spy who shagged me, i've determined it's better than the first because:1. doesn't have to waste time establishing the character of austin powers, thus launching us directly into the goofiness2. the dr. evil x mini-me dynamic <3333. multiple musical numbers ... more non-musicals should try this out ......     ",
      "mr-deeds-goes-to-town": "8/10 many world problems would be solved if we simply transferred Bezos's extreme wealth to fictional 1936 himbo Mr. Deeds. it's really that easy     ",
      "romy-and-micheles-high-school-reunion": "8/10 dream sequence featuring justin theroux as a cowboy predicted mulholland drive     ",
      "only-angels-have-wings": "8/10 cary grant giving off big han solo vibes:  -risk-taking pilot-wears cool jackets-constantly says \"kid\" -emotionally unavailable but tall and devastatingly handsome so girls still like him even though he treats them like shit   he WAS the blueprint!     ",
      "gloria": "8/10 so strange when cassavetes does studio films! the conventional pressures of capitalism clashes with his raw emotional style, creating this dislocated reality that whips from cliched dialogue to a patented genius gena rowlands monologue and back again.   together, the ultimate film power couple unpacks the false myth that being a woman makes one inherently maternal — even when gloria is taking care of the boy she's smoking cigarettes and gangsters in front of him or calling him stupid, lol. though film...     ",
      "the-talk-of-the-town": "7/10 can't believe cary grant's bare arms passed the hays code. obscene     ",
      "indiana-jones-and-the-temple-of-doom": "5/10 the best part of this movie is how indy is just ..... soaked in sweat from beginning to end. the man is constantly drenched no matter what he's wearing or how he's feeling and it's so funny that it almost transcends the movie's extreme racism. almost      ",
      "last-action-hero": " me but instead of bringing an action hero to life it's the kids from cyberchase     ",
      "the-holiday": "6/10    POIFECT for drinks with the girls!!!  biggest cheers:- jack black and kate winslet kiss- jude law says \"i am ... daddy\"- post-breakup cameron diaz solo thrash-dancing to mr. brightside - jack black go \"skroodle-oodle-oo\"- mr napkin-head :)- kate winslet browsing huge shelf of movies and selecting PUNCH DRUNK LOVE- kate winslet later watching HIS GIRL FRIDAY- kathryn hahn 2 minutes of screentime  biggest silences:- jude law and cameron diaz kiss- cameron diaz saying she hasn't cried since she was 15 and her parents calmly and respectfully divorced ......... okaaaaay ........- john krasinski 2 minutes of screentime     ",
      "day-for-night": "8/10 \"I'd dump a guy for a film but never a film for a guy!\"   charming, genuine, and brave enough to tell the three essential truths about filmmaking:- movies are more important than life- everyone in the cast and crew is boning each other- cats cannot act     ",
      "klute": "9/10 LOVED THIS!!! jane fonda's layered performance as bree is magnetic, constantly pushing and pulling; every capricious line delivery is a riveting surprise. she's simultaneously blunt and charming, nervous and brave, cold and warm to the point that the film drags whenever she's not lighting up the screen, the semi-tired mystery elements paling in comparison to the thrill of excavating bree's character.  the portrayal of sex work is also light years ahead of its time, being careful to acknowledge that bree's waffling...     ",
      "welcome-to-marwen": "1/10 gruesomely, irrevocably, unabashedly misogynistic all while simultaneously parading itself as ... dare i say it ... \"\"\"feminist\"\"\"? at one point steve carell yells \"you just don't get it, do you? WOMEN ARE THE SAVIORS OF THE WORLD!!!\" as if he didn't just spend the last hour and 30 minutes literally objectifying his exceedingly kind lady friends that he's lucky enough to be supported by?  the real mark hogancamp's story is genuinely tragic, so it's insane how little sympathy the character...     ",
      "bad-education-2019": "7/10 out of all the movies about being gay and doing crime titled Bad Education, this one's second best!     ",
      "xanadu": "5/10 happy 4/20! this movie isn't real <3     ",
      "the-pillow-book": "8/10 \"I am certain that there are two things in life which are dependable: the delights of the flesh and the delights of literature. I have had the good fortune to enjoy them both equally.\"  what started off as a thirst-watch for ewan mcgregor as a bisexual writer turned into an acute interrogation of our sensual relationship with vocabulary. text written in mandarin, japanese, french, english are given room beneath the frame rather than embossed atop the images, implying an equilibrium...     ",
      "the-keeping-hours": "4/10 lee pace is 6'5\"carrie coon is 5'5\"together they are 11'10\"  this is the only math i know how to do. and i got it wrong the first time     ",
      "flushed-away": "6/10 i have a big crush on the hot rat     ",
      "chicken-run": "8/10 my Chicken Run Story (everyone has one) is that i had disturbingly vivid nightmares about the way the rooster smiles on the poster. even threw a tantrum when my dad tried to get me to watch it. then Flushed Away came out in 2006, which was CGI in the style of claymation, aka the perfect stepping stone for 11-year-old me. i imprinted on the hot rat. from there, i was able to summon up the courage to watch the original...     ",
      "in-the-cut": "7/10 sharp objects minus the munchausen and messina! jane campion explores the dangers that tag along with being a woman laden with desire — dismemberment, decapitation, death. though this story isn't technically true, it mirrors the true crime genre by explicitly showing the aftermath of brutal serial killings, forcing the audience to witness the horrors that men do in fact impart on women's bodies (oh yeah, i read I'll Be Gone In The Dark!).   after watching this and Top of the Lake,...     ",
      "jupiter-ascending": "5/10 channing tatum plays a genetically engineered \"military wolf\" who zooms around in zero gravity roller skates because his wings were cut off (everyone knows wolves have wings). \"bees are genetically designed to recognize royalty\" is something that sean bean, who is genetically spliced with a bee, has to say with a straight face. the main plot point is that a group of 14000-year-old royal alien siblings are attempting to either marry or murder their 25-year-old human mommy. but the nuttiest part is in the first 20 minutes ... when mila kunis tries to sell her eggs to buy a $4000 telescope on ebay     ",
      "burlesque": "4/10 alan cumming is only in this because it's illegal to make a cabaret knock-off without him. you know what fuck it it should be illegal to make movie musicals in general without him     ",
      "clueless": "8/10 \"i'm having a Twin Peaks experience!\" deserves to be on that AFI 100 Years ... 100 Movie Quotes thing that i've never actually read but always see in the imdb trivia sections     ",
      "lemony-snickets-a-series-of-unfortunate-events": "7/10 don't get it twisted — hot dad tag is for 🐍uncle monty🐍 NOT 👁‍🗨count olaf👁‍🗨     ",
      "emma-2020": "7/10 hey boys ever wondered what girls do at sleepovers? 😏 it's standing around a table and cheering as we each take turns gently slicing a mound of flour into the thinnest pieces possible until the coin at the top falls off and we have to suck it up with our dainty lil mouths 😊     ",
      "the-day-after-tomorrow": "6/10 the unforgivable fact that we didn't funnel all of our money into stopping climate change upon the 2004 release of this scientifically inaccurate disaster flick ... daddy quaid TRIED TO WARN US     ",
      "cache": "9/10 my fav haneke yet!!! consistently fascinated by the way he shoots his stories through such a clinical, cold, \"objective\" viewpoint, without sacrificing a dash of humanity — that talent is especially on display here, since the topic of surveillance plays such a key role. how is this movie both so dense and so sparse!?     ",
      "the-birdcage": "8/10 TWO (2) jeb! bush jokes in this gem from 1996 ....... prescient ...... elaine may was and is so ahead of her time     ",
      "the-invisible-man-2020": "6/10 mixed feelings about this one! LOVE the decision to plumb horror from the deadly frustration of not being believed — thing is, other movies have pulled it off with greater precision (Rosemary's Baby, Unsane, even Take Shelter), and i think it's because they're more character focused.   cecilia is in every scene, but it still never feels like we truly know her as a person? that's by no fault of My Favorite Scientologist elisabeth moss, who truly carries this thing — it's majorly script-related. it is in fact possible for horror/thrillers to have well-written scripts! wish blumhouse knew this!   anyway, i wanna rewatch Gone Girl     ",
      "chicken-little-2005": "5/10 #BelieveChickens     ",
      "jane-b-by-agnes-v": "8/10 \"if a painter or filmmaker wants to do my portrait, i don't mind distortion.\"  using fantasy vignettes, expressionism, and endless creativity, agnès varda crafts a dreamy depiction of actress jane birkin that simultaneously explores the passionate relationship between women and their art while pushing the boundaries of what a ~biopic~ can be. i hesitate to even call this a biopic, because it's so non-formulaic and really only centers on jane in her (respective) present. i suppose it's more of a...     ",
      "mr-beans-holiday": "6/10 mr. bean is directly responsible for multiple deaths AND the blowing up of mr. willem dafoe — he has blood on his hands that shall never be cleansed     ",
      "clue": "7/10    kinda twisted how there were three different endings shipped out to theaters. i'd be so pissed if i were one of the 66% who didn't get Ending C, featuring the superlative closing line of \"i'm gonna go home and sleep with MY WIFE\"     ",
      "sonic-the-hedgehog": "4/10 support group for everyone who went in for james marsden and came out #Horny4Eggman :(     ",
      "punch-drunk-love": "7/10 the hushed, conspiratorial way that adam sandler raves about the pudding promotion seeming too good of a deal to be true is the same way i used to talk about moviepass (RIP) </3     ",
      "portrait-of-a-lady-on-fire": "10/10 \"do all lovers feel they're inventing something?\"  the clandestine stealing of forbidden glances. the thankless task of trying to tamp a lover's image into the folds of your brain. the dread of said image's inevitable fading. the smoldering slow-burn of impossible yearning, and the explosive fireworks when it's finally reciprocated. the sizzling sound of a final farewell.  director céline sciamma packs each frame with tangible emotion, and she does it all without a manipulative score. we know exactly what to...     ",
      "the-young-girls-of-rochefort": "9/10    a random axe murderer sub-plot?? in (De)MY(‘s) delightfully color-coordinated rom-com musical??? it's more likely than you think     ",
      "ran": "8/10    learned a lot about proper weapon usage from this one!  guns? for cowards horses? for tramplingfire? for castle-burningswords? for vengeancearrows? for bundling together to teach your chaotic sons a metaphor about unitydaggers? for non-lethally slicing your brother-in-law's neck then licking his blood while demanding he marries you     ",
      "1917": "8/10 anti-rat propaganda :/     ",
      "anastasia-1997": "7/10    i can't believe this movie actually ends with a bat getting laid     ",
      "joker-2019": "4/10    bad because -he never said joker's trick-super-rats mentioned but never expanded on -i know the gf was a fantasy but they still made us watch him kiss her. don't like the implication that joker fucks -posits people with mental illness as unhinged murderers when really we just want to lay in bed amidst our snack food wrappers forever -willfully ignorant + fundamental misunderstanding of revolution/ANTIFA (how are you gonna say your film \"isn't political\" when characters are carrying signs...     ",
      "minnie-and-moskowitz": "8/10 \"You know I think that movies are a conspiracy? I mean it. I mean it. They are actually a conspiracy. Because they set you up. They set you up from the time you're a little kid. They set you up to believe in everything. They set you up to believe in ideals and strength and good guys and romance and, of course, love. Love. So you believe it, right? You go out, you start looking. It doesn't happen, you keep...     ",
      "madagascar-escape-2-africa": "6/10 just moved to LA. this is the first movie my roommate and i chose to christen the apartment. i only feel comfortable living with those who like to move it move it. in this house we hail king julien     ",
      "belladonna-of-sadness": "7/10 this psychedelic animated musical erotica version of Lady Snowblood (also released 1973?!?!?!?) rules HARD once you get past the gratuitous rape scenes. the gorgeous watercolor animation makes the sexual violence a bit easier to tolerate than, say, the thematically-similar live-action Valerie and Her Week of Wonders (1970) ...... still a bit icky for the all-male writers to juxtapose that trauma against a montage of erotic depictions of the ‘70s sexual liberation though, imho, even when it's drawn that beautifully and creatively!! also, not enough revenge ....... >:(  streaming for freeeeee on kanopy (best watched dummmm stoned)     ",
      "arsenic-and-old-lace": "7/10 me in 1944 when i try to distract myself from the horrors of WWII by going to the local Cinema to see the latest Cary Grant Picture and realize it's about how Women Be Poisoning: gee ........... hope this doesn't ..... awaken anything in me ...........     ",
      "john-mulaney-the-sack-lunch-bunch": " parents wanted to watch this for christmas eve but i had to say no because chaotic jake gyllenhaal having a breakdown while singing and gyrating and playing an okja-adjacent character is just a hair too sexy-in-a-weird-way for family time? like, i would've had to somehow repress my eruptive passion for mr. music and his xylophone vest in order to prevent them from (rightfully) worrying about me? i know for a fact that other people had this same problem. please don't lock me up     ",
      "star-wars-the-rise-of-skywalker": "4/10 there's exactly one interesting characterization in this spineless retcon and that's the choice to give poe dameron a canonical fear of bones      ",
      "cats-2019": " unfortunately i did not hate this, and the key to that is to go in expecting plotless nonsense, and also to be pleasantly stoned. you must suspend every iota of disbelief. you must completely submit to the dancing hellcats.   once you do that, you'll be able to recognize this as truly AUDACIOUS filmmaking, one of those miraculous absurdist experimental studio blockbusters that defied all odds and logic to come to fruition. i admire the bold choice to omit any traditional...     ",
      "ad-astra-2019": "8/10 🎶when i wasa young Roymy fathertook me tomoon Applebee'sfor 2 for $20 deals🎶     ",
      "primal-fear": "7/10 chicago (2002) for boys who didn't do theater in high school     ",
      "the-simpsons-movie": "7/10 minus a half star because legendary clown icon sideshow bob doesn't make a single appearance     ",
      "sweet-charity": "8/10 three simple ingredients every movie-musical should have:1. overture2. intermission3. elaborate dance numbers ghost-choreographed by gwen verdon that consist of pure, flashy spectacle; i don't require one iota of plot nor character development, thank you! sometimes cohesive narrative isn't REAL and that is GOOD     ",
      "miss-julie-2014": "7/10 a bit baffled by the negative reviews because unstable rich baroness jessica chastain absolutely dominating her irish valet colin farrell by ordering him to toast her and kiss her shoes is exactly what i am looking for in my motion pictures? i mean, LOOK at the lboxd header!! the power dynamics between the two are deliciously intricate, constantly pushing and pulling and baiting and switching from cat to mouse and back again.   the incomparable liv ullman's script (adapted from august...     ",
      "bram-stokers-dracula": "7/10 robert pattinson could make dracula work but gary oldman couldn't make edward cullen work     ",
      "joy-street": "8/10 isn't it a lovely feeling to see a familiar image and think, \"i've been here in a dream!\"? isn't it comforting to know that others' subconsciouses speak the same language as yours?   this one is a must-watch. every animation by suzan pitt is a must-watch. i just found out that she died this year. did you know that? clearly, i didn't. and it's terrible that i didn't know that. in an ideal world, everyone would know that.  streaming on criterion channel!     ",
      "winters-blood": "7/10 if you, like me, desperately miss that eerie stag-man from hannibal, you'll be pleased to know that he is alive and well and thriving in this taut little 4 minute independent horror short! though that's not a ton of time to establish the diegetic world and characters, filmmaker parker brennon and team make the most out of it using vivid lighting and ominous visual cues: the chime of the grandfather clock, the primal dread of a stag skull, the crimson of holly berries juxtaposed against the icy-blue winter all portend something otherworldly is coming, and there will be blood. WINTER'S BLOOD, THAT IS!!!!!!!!!!!!!!!!!!!  watch here!     ",
      "hour-of-the-wolf": "8/10    having The Lighthouse withdrawals 🥴 needed to see a black & white chiaroscuro chamber horror about a man on a remote island driven to insanity by the weight of his past regrets 🥴     ",
      "much-ado-about-nothing": "7/10 as essential to 10th grade lit class as gattaca is to 7th, 10th, and 12th grade biology     ",
      "the-king-2019": "6/10 robert pattinson not showing up til over an hour in ...... edging     ",
      "love-songs": "7/10 american musicals: 🎶i'm singin' in the rain! 😁☔️ just singin' in the rain 😋☔️ what a glorious feeling 🥰☔️ i'm happy again!🎶french musicals: 🎶we walk under a gray sky 🚬😔 pierced by thousands of needles 🚬😥 it's pouring rain onto the Spirit  🚬🥺 the clouds, too heavy, let themselves go🎶     ",
      "rosemarys-baby": "9/10    john cassavetes PLEASE gaslight me so hard that i can't trust a single facet of my perceived reality. i'm having your demon baby and it's none of your business     ",
      "the-lighthouse-2019": "10/10 filthy and delicious. a swirling maelstrom of horrific rage and loneliness and repression and repulsion and secrets and piss and phalluses and greek tragedy and unrelenting, all-consuming, inescapable horniness.   toppled head over mermaid tail in love with this one in the first few minutes and never once wanted it to end, which is that rare and divine feeling i'm constantly hoping for when the theater lights dim. cannot wait to watch it with subtitles so i can understand a single line of dialogue <3     ",
      "jenny-slate-stage-fright": "8/10 this has the same ending as Love Streams (1984) and personally i think more comedy specials should end by paying homage to the works of john cassavetes     ",
      "submarine": "9/10 \"Dear Jordana,Thank you for letting me explore your perfect body. I could drink your blood. You are the only person that I would allow to be shrunken down to a microscopic size and swim inside me in a tiny submersible machine. We have lost our virginity, but it wasn't like losing anything. You're too good for me. You're too good for anyone. Sincerely, Oliver.\"  in 10th grade i lent this book to my boyfriend at the time, hoping he'd...     ",
      "the-autopsy-of-jane-doe": "5/10    sorry but if she's a vvitch from 1692 then why was her bush perfectly trimmed and waxed     ",
      "claires-camera": "7/10 what a delightful little gem from hong sang-soo! a major theme of this film is the virtue of honesty, and hong ensures that it stays truthful by employing exclusively long, uninterrupted, mostly static takes. this means the actors can't hide behind the movie magic of cuts and editing, and the result is a masterclass in perceptive acting.  in one of the most memorable scenes, jung jin-young asks to sit next to isabelle huppert in a cafe, she accepts, and what...     ",
      "holiday": "8/10 \"i do backflips every single day of my life\" - cary grant in Holiday      ",
      "the-awful-truth": "8/10 irene dunne: *sings*cary grant: *falls down*me: 4 stars     ",
      "as-above-so-below-2014": "7/10    my wacky take on this critically panned found footage horror that i love completely unironically is that it works better as a slow burn romance :) good night (it's 2:42 pm)     ",
      "missing-link-2019": "6/10 saw this in may and forgot to log it til now :/ all i remember is being the only one at the 1pm showing and feeling relieved because it meant i could eat the croissant i snuck in free of judgment. while doing so, i had the thought, \"smuggling bread — call me Naan Solo\" and laughed out loud to myself, which i could do, with reckless abandon, because i was alone!  that's all i can tell ya about this one, so sorry folks. i know how rabidly y'all were craving a 1000 word in-depth analysis of fuckin missing link      ",
      "call-me-by-your-name": "10/10 It's not right but it's now or never And if I wait could I ever forgive myself? On a night when the moon glows yellow in the riptide With the light from the TVs buzzing in the house   ‘Cause I'm gonna cut it where I can And then I'm gonna duck out behind them If I ever had a chance it's now then But I never had the feeling I could offer that to you To offer it to you...     ",
      "juno": "9/10 this soundtrack gives me vivid flashbacks to being a Quirky High School Sophomore sighing romantically and doodling kimya dawson lyrics in her chemistry notebook 🥰 i got a D     ",
      "personal-velocity": "7/10 similar to kelly reichardts's excellent Certain Women in the sense that it consists of 3 vignettes that employ realism to explore the ways in which 3 unrelated women are constrained by societal forces around them.   dissimilar to Certain Women in the sense that this one is messier and varies in tone, undercutting the naturalism of the lead performances with sometimes stereotypical dialogue choices (example: a teen boy unsuccessfully hits on kyra sedgwick, then proclaims to his pals \"she wants me\" 🙄)....     ",
      "the-fury": "7/10 contrary to popular belief, brian de palma's greatest contribution to the art of cinema was not the prom scene from Carrie, but his casting of john cassavetes as an evil fbi agent who wears a singular black glove     ",
      "it-2017": "7/10 jack dylan grazer has the power to save the child comedian industry and the ONLY reason he hasn't yet is because no one wants that     ",
      "the-devils-own": "5/10 harrison ford is fully committed to maintaining a straight face as brad pitt horrifically mangles a northern irish accent for 2 hours and that alone made it worth the watch     ",
      "the-heartbreak-kid-1972": "8/10 \"Certainly I remember Florida. I'll never forget it. But this is Minnesota, and I've got Political Science, and I've gotta go.\"   read quite a few reviews that essentially summed elaine may's sophomore film up as a a fusion of her comedy partner mike nichols's The Graduate and the improvisational style of john cassavetes, which initially made me think \"hmmm ..... love mike and john but .... why are we tying elaine's accomplishments to her male collaborators ...\"   then i watched it and...     ",
      "the-philadelphia-story": "8/10 cary grant perched on the edge of the fountain, greeting everyone with a scathingly simple \"Hello, friends and enemies\" ... ok ME when i log into this app !     ",
      "the-wizard-of-oz-1939": "9/10 my gal pals and i were absolutely hooting and hollering whenever the hot scarecrow came onscreen to do a silly dance and fall down. we decided scarecrow is a lanky, sensitive, DIY boy who stands in front of you at your roommate's friend's house show and at first you're annoyed but then he notices he's blocking your view and he apologizes soooo much, maybe even too much, and after the show you joke around with him and laugh when he trips over his own dirty converse laces, and suddenly it's 2 am and you're heading home and you think you're gonna miss him most of all     ",
      "harold-and-maude": "8/10 nooooo don't kill urself ur so sexy when u feel so unloved by ur mother that u stage elaborate fake suicides as desperate cries for help that she perpetually ignores aha     ",
      "jaws": "8/10 FINALLY i can understand that spongebob episode CLAMS on a deeper level!! and also the lifeguard episode. and also the alaskan bull worm episode. and also every episode     ",
      "badlands": "9/10 \"The film's tag line (\"In 1959 a lot of people were killing time. Kit and Holly were killing people\") inspired the Zodiac Killer, who had been lying low for years, to write a letter to a newspaper denouncing their flippant attitude to violence in society by running such an ad.\"  this man and his many hats made the zodiac killer come out of retirement and we should all be terrified     ",
      "the-souvenir": "8/10 i totally get the criticisms for this, since the whole movie basically hinges on whether or not you believe in the incredulous love that julie has for anthony, but also ... and i wish i had a more articulate way to say this .... sometimes it's just ... like that? sometimes it's just like that. irrational to everyone but you.   joanna hogg based this off of an actual experience that she had at film school, and with this semi-fictionalization she's choosing to retake...     ",
      "the-killing-of-a-chinese-bookie": "7/10 (1978 version)hm! probably one of my least favorites from cassavetes, but the artistry of the intimate camerawork, ben gazzara's subdued performance as club owner cosmo vittelli, and the swirling atmosphere of his beloved burlesque house is undeniable. here, cassavetes explores the frustrating paradox of cosmo's wanting to make meaningful art, as shown by his relentless dedication to the quality of his girls' act rather than their Tiddies, versus his needing to use their Tiddies to draw customers into the...     ",
      "about-time": "7/10 tom hollander: surprise! i'm in this :)me: ah yes, how could i forget about my favorite english character actor. nice to see you again!  richard e. grant: surprise! i'm in this :)me: awww, delightful! great work. loved your 3 line cameo   margot robbie: surprise! i'm in this :)me: FKICNWQNWQDIQJ@J*U92u2903jfieowfnIJIASf923hr9hIDJoawfjeoj ??!?!?!?!?!??!?!?!?@?/1///1//2//1???????????? WHERE DID YOU?????#!??# HOW DID YOU     ",
      "fry-day": "8/10 violent misogynists like ted bundy have conditioned women into rightfully recognizing that trusting charismatic male strangers can be fatal, yet when it comes time to make a choice, we tend to follow them into the murky maw of the woods anyway. what the unsympathetic may view as the naive stupidity of reckless girls is in reality a throbbing need to be seen and heard and felt and understood. even if it kills us.   in just 16 minutes, director laura moss...     ",
      "reservoir-dogs": "9/10    what if we kissed in an abandoned warehouse after our jewelry heist went bust and i tenderly held you in my arms and combed your hair as you slowly bled to death from an agonizing gutshot that was kind of my fault 😳 ⁽ᵃⁿᵈ ʷᵉ ʷᵉʳᵉ ᵇᵒᵗʰ ᵇᵒʸˢ⁾     ",
      "bringing-up-baby": "7/10 one of my favorite things about classic movies is how much comedy is gleaned from people falling down. Cary Grant was willing to pratfall on his face like 12 times a scene and THAT'S why he's an all-time great <3     ",
      "i-shot-andy-warhol": "8/10 \"The female function is to groove, relate, love, be herself, discover, explore, invent, solve problems, crack jokes, make music, all with love.\"  very interesting foil to Once Upon A Time in Hollywood's image of 1969 LA, as valerie solanas' attempted assassination of andy warhol occurred just one year earlier in NYC. both violent events marked the brutal death of the freewheeling 60s, and both were (peculiarly) committed by women.   director mary harron also recently released her latest film Charlie Says,...     ",
      "once-upon-a-time-in-hollywood": "7/10    cliff booth: if i was at the manson murders i would've stopped them. no offense but i'm different     ",
      "inglourious-basterds": "10/10 what's better than this, guys killin nazis     ",
      "crawl-2019": "6/10    i have the same opinion on these alligators as i do the xenomorphs from Alien: they're doing absolutely nothing wrong as long as the protagonist's cute animal companion survives <3     ",
      "girlfriends-1978": "7/10 need more movies about the devastating loneliness + loss of emotional intimacy + perceived abandonment/betrayal of gal pal break-ups because uhhhh they really do be like that :/     ",
      "midsommar": "8/10 my first night at college, a friend and i took our first weed cookie from a girl we'd just met. 2 hours later we locked ourselves in my dorm room, laid on the twin beds, and tried our best not to die. after my friend decided to go back to her own room to sleep (it took her a solid 3 minutes to get the key in the hole), i was alone in the dark and nothing felt real. i...     ",
      "north-by-northwest": "8/10 roger thornhill refusing to pay a $2 DUI ticket but taking the time to tip the waiter $2 before running from the cops is chaotic neutrality at its finest     ",
      "the-color-wheel": "7/10 over the years since his sophomore feature, alex ross perry's spitfire dialogue has only grown more poetic, his claustrophobic close-ups more controlled.   as he juggles the black tones of nihilism with the spice of surrealism, colors blur, lines blur, lines cross. a thick slurry of sludge, sluicing into a 9 minute 40 second quiet implosion of a long take.   reminded me of when my little brother and i were in the backseat of my dad's car on the way to...     ",
      "jigsaw-2017": "4/10 this is the only franchise where bad letterboxd reviews do not deter me in the slightest.   \"it does not matter how low the rating goes as long as the gore pops off\" — ancient jigsaw proverb     ",
      "late-night": "6/10 perfect for when you're visiting your grandparents and you already went out to dinner with them which means now you don't really have anything to do so you and your mom decide to kill time by going to a theater in a mall and seeing a light, innocuous, feel-good, inoffensive-for-an-R-rated studio comedy that has something relevant and earnest to say :) ps. absolutely PISSED at myself for not recognizing my 3rd favorite hugh: dancy     ",
      "phantom-thread": "9/10 phantom thread posits an impressively fresh take on the older, eccentric male genius with a younger female muse trope, but that's to be expected from THE paul thomas anderson. it's a slow-burning fuse with a quietly explosive ending sequence. it's the kinkiest film to not actually feature any sex scenes. it's fifty shades of grey for the arthouse crowd... in a good way.     ",
      "moulin-rouge-2001": "9/10 sometimes i lie awake at night thinking about how if mr. brightside had come out just 2 years earlier it would've fit perfectly for ewan's envious rage scenes. no shade to tango roxanne, you rule, but can you IMAGINE an over dramatic vaudevillian rendition of mr. brightside, ewan just absolutely scream-sobbing about jealousy turning saints into the sea...... i'm building a time & space augmentation device as we speak     ",
      "lick-the-star": "6/10 sofia coppola has always, from the very beginning of her career, understood the sole fundamental truth about women and girls: We Be Poisoning <3     ",
      "the-headless-woman": "8/10 a beautifully composed manifestation of one woman's gnawing guilt and paranoia. director lucrecia martel's recurring visual motif of objects in the foreground \"cutting off\" our antiheroine Vero's head stands out in particular — like the film's purposefully meandering and hazy events, the title is cryptic and ripe for discussion. a possible Medusa allegory? the untamed, almost serpentine hairstyle on the poster suggests so. on the other hand, Vero's bourgeois status in a politically unstable and class-divided Argentina potentially recalls Marie...     ",
      "rocketman-2019": "7/10 rocketman is at its best when embracing its own fantastical ridiculousness, at its worst when mimicking every other music biopic. the saturday night's alright and honky cat song + dance numbers gave me a very specific elated thrill i hadn't felt since mamma mia! here we go again. the smash cut of an asshole manager saying \"you'll never be successful!!\" to a montage of newspaper headlines touting their success gave me a very specific fatigued apathy i hadn't felt since bohemian...     ",
      "snatch": "7/10 the role of mickey o'neil: boozy irish boxer may have been literally written for brad pitt, but it was figuratively, spiritually, and ideologically written for colin farrell     ",
      "john-wick-chapter-2": "8/10 YES i'm officially on the john wick train!!! chapter 2 is unafraid to revel in the silence of its fight scenes, only punctuated by punches and grunts, instead of relying on cloying, fast-paced music to incite excitement. every fight kicked my ass, but the subway sequence in particular jammed a pencil into my aorta, and the mirror room duel yanked it right out. i'm on the ground hemorrhaging blood but i'm completely at peace with dying at the hands of mr. john wick. in fact i'd prefer it     ",
      "unfriended-dark-web": "7/10 y'all are just gonna have to let me give this 3 1/2 stars because found footage horror movies are my lifeblood and render me incapable of critical thinking     ",
      "unfriended": "5/10    what is the truest horror of Unfriended:A. vengeful computer ghost that forces you to commit suicideB. the mental gymnastics that bullies go through to convince themselves they're good peopleC. shitting your pants in public, on camera     ",
      "aquaman-2018": " hey y'all, we have another guest review! this person is a dear friend who recently DM'd me the most beautiful, poignant story about his relationship with this film — i just HAD to share the love!! <3  \"Did I tell you when I saw Aquaman the 2nd time I got so stupid high I couldn't tell what was happening and thought I pissed my pants like 6 times even tho I never did\"     ",
      "orlando": "9/10 delightful similarities between Orlando and The Favourite: - filmed at hatfield house- costumes by sandy powell- handel featured on soundtrack- queen anne's gout is specifically namedropped- \"my life is like a maze that i continually think i've gotten out of only to find another corner right in front of me.\" - abigail dealing with loss of nobility//orlando coping with loss of nobility by frantically running, lost, through a hedge maze - GAY as HELL!!!!!     ",
      "the-fifth-element": "5/10 let's just get this out of the way: i went through this entire movie thinking zorg was billy zane...?!?!?! i was like WHOA crazy how he's doing the same rich villain character from titanic, also released in 1997, except in SPACE. why don't we talk about this more often?   then the credits rolled and it said ZORG — GARY OLDMAN and i answered my own question :/ legitimately a more oscar-worthy transformation than the darkest hour     ",
      "the-private-life-of-a-cat": "8/10 (screened on 16mm at NW Film Center)  sitting in an auditorium half-full of people and watching this documentary featuring close-up shots of a cat giving birth FIVE (5) times was a surreal communal experience. no one really reacted during the first two births because we're Mature Cinephiles, but the energy shifted after the mom cat pulled the third kitten out of her own Hole and licked the placenta off -- there were some \"ugh\"s and \"again?\"s. by the fourth, i...     ",
      "her-smell": "9/10 Opening Night (1977) ... but make it grungier, bloodier, louder, dizzier, nastier, stormier, gayer, and riot grrrlier 😜     ",
      "water-for-elephants": "6/10 can't really think of a real reason to watch this other than the just-crazy-enough-to-work circus love triangle between robert pattinson, reese witherspoon, and christoph waltz. but to be fair that's a DAMN GOOD reason     ",
      "ralph-breaks-the-internet": " i'm sure there's a really heartwarming message about friendship buried somewhere in this feature-length corporate commercial, but my main takeaway is that they made ralph say \"e-boy\" way too many times for comfort     ",
      "high-life-2018": "7/10 an unholy mixture of both nihilism and optimism that only claire denis could pull off. it's a literal dog-eat-dog world out there, and the awful events happening in this film (systemic abuse of prisoners, rape, negative health effects from radiation, deadly experimentation) are happening every day in real life. in one early scene, the ethical implications of sending prisoners on a suicide mission to a black hole are reduced to dispassionate conversations between citizens on Earth, much like our reality....     ",
      "clockwatchers": "7/10    thirst-watching Parker Posey's varied filmography occasionally unearths some hidden gems!! Clockwatchers captures how frustratingly soul-sucking menial office work is, specifically through the lens of women temps. i work at a bookstore for minimum wage and sometimes i feel like a nameless ghost haunting an unmarked grave, cursed to barely exist in purgatory. if i disappeared, who would care?   in one scene, Toni Collette gazes wistfully at a fish tank, identifying with the trapped, aimless goldfish. later, she discovers that Parker...     ",
      "zog": " i can't log fleabag so i googled \"watch zog 2018 free\" and sat through this entire 27-minute dragon animation featuring the voice talent of fleabag and mamma mia! here we go again co-star hugh skinner just to have a viable outlet to say hello i'm watching (and loving) fleabag!!!!!!     ",
      "gloria-bell": "8/10 no cops at pride just julianne moore and her paintball gun     ",
      "women-reply": "7/10 \"being a woman means being unique, desired, attentive, and mysterious, as well as crazy and individual.\"  agnès varda's short documentary attempts to define womanhood by asserting that women are undefinable -- a valiant message undermined by some of that trans-exclusionary rhetoric unfortunately prevalent in second-wave feminism of the 70s :/  streaming with english subtitles on vimeo!     ",
      "unicorn-store": "5/10 this was a cute and harmless way to spend 92 minutes! :)  anyway, i'm glad my favorite tv actor hamish linklater is getting work. that's okay if you don't recognize the name; i've been quietly obsessed with him since 2006 and only learned it a full decade later when he popped up in the big short. i was like \"hey! that's that tv actor i heavily repressed my feelings for when i was a weird middle schooler and still kind...     ",
      "dogtooth": "9/10 what if we kissed 🥵 in the house our parents have isolated us within for our entire lives so they could construct a micro-society with their own completely fabricated cultural norms 😳     ",
      "dumbo-2019": "4/10 completely forgettable aside from the 5 seconds where colin farrell slaps dumbo's ass and says \"come on, Big D!\" — such a clever homage to his directorial debut!     ",
      "the-beach-bum": "7/10 trying to brainstorm a professional and respectful way to say that isla fisher ripping a giant bong on the patio of an oceanfront miami mansion while getting her pussy ate by matthew mcconaughey is, in this reporter's opinion, Important and Awesome. failing spectacularly     ",
      "the-aftermath-2019": "6/10 as it so often goes with keira knightley period pieces that aren't atonement or pride & prejudice, you'll feel the same way about this one as you feel about all the others! just like the aftermath, i'm solidly neutral, but i gotta give it props for combining two of my most cherished tropes into the ULTIMATE:   Angsty Dad chops firewood to Cope +Woman gazes longingly out window at Sexy Guy doing Sexy Yardwork=Woman gazes longingly out window at Sexy Dad chopping firewood to Sexy Cope      ",
      "captain-marvel": " i know nothing about marvel so here is a guest review from my frat kid brother home from college for spring break: \"captain marvel was dope. brie larson was great. um, i dunno! it was good! i don't know what to say. brie larson was really good. uh, yeah. i'd give it 3 1/2 stars and a rotten tomatoes score of 82%. [pause as he as zelda demolishes olimar in smash] i personally just really like brie larson. her name is a...     ",
      "raw-2016": "9/10 Raw emits the same mood as the cow heart dissection in my 12th grade human anatomy class:  staring at the wet mound of pale red flesh soak through the brown paper towel, i thought, \"this is probably the only time you will ever touch a cow heart in your life,\" in blinking neon letters. \"you are not good at math and science. you will never pursue this as a career. this is it.\"  my lab partner was an actual, signed...     ",
      "the-haircut-1982": " johnny cassettetapes dancing in a silly fashion :')     ",
      "shadows-1958": "7/10 breaking in my cassavetes boxset with his directorial debut, SHADOWS, a probe into the complications of interracial relationships in late 50s new york. the erratic jazz score is a definite highlight, brilliantly mirroring the improvisational nature of the dialogue — makes sense that cassavetes and cast came up with the roots for the film in acting workshops, as some scenes do have the exploratory, push-pull dynamic of a drama school exercise. yeah, it's a bit sloppy overall, but when you're helping to pioneer the independent film movement, slack can be cut!     ",
      "the-game": "6/10 this is actually the only way to trick a man into self-reflection     ",
      "the-killers-1964": "7/10 john cassavetes pistol-whipping then throwing ronald reagan out of a moving car :) <3     ",
      "3-women": "9/10 just when you think you're starting to understand these women, they morph into something else entirely. they're dream-like, ethereal, intangible, as if viewed through an opaque silk screen, a forcefield preventing us from fully connecting. meanwhile, the atmosphere is a brilliant, melancholic fog of pastel blues and pinks — a comfortably warm sauna that one enters to bask in, to succumb to, not to overanalyze and stew in. leave it to altman to successfully pull off a cotton candy-colored feature-length homage to persona!     ",
      "incubus-1982": "6/10 pretty decent x files episode starring john cassavetes as a hot small town doctor hunting a rapist demon. you can tell good ol johnny cass rewrote 80% of the screenplay and that's easily the flick's saving grace — not sure why he wrote himself the word \"sperm\" so many times but it's cool     ",
      "love-streams": "9/10 \"This picture, this picture; I don't give a fuck what anybody says. If you don't have time to see it, don't. If you don't like it, don't. If it doesn't give you an answer, fuck you. I didn't make it for you anyway.\" — John Cassavetes on Love Streams  the perfect endcap to Cassavetes' career (Big Trouble doesn't count), and he knew it. you can sense his savoring of life in the bittersweet way he and Gena Rowlands slow dance,...     ",
      "lyle": "6/10 every review already says \"lesbian rosemary's baby\" but there's really no better way to sum it up so  lesbian rosemary's baby     ",
      "an-awfully-big-adventure": "5/10 phoenix buchanan of paddington 2's origin story ...... even though hugh grant has a rom-com rep, his real purpose is to play flamboyant theater antagonists     ",
      "8-women": "8/10 there was absolutely ZERO reason for this french all-woman Clue reboot to be a musical but thank god it was! the  briony from atonement-lookin mf's song-and-dance number Daddy Ain't With It (Papa t'es plus dans le coup) is a BOP ..... isabelle huppert as yet another sexually repressed ice queen but this time she sings about it is GENIUS .... 3/8 of the women (including catherine deneuve) are LESBIANS ...... brilliant, i love it, thank you     ",
      "penguins-of-madagascar-2014": "7/10 yes i'm a huge MCU* fan :)  *Madagascar Cinematic Universe     ",
      "alita-battle-angel": "6/10    the twist that the antagonist was secretly edward norton all along is soooo 1999 🙄     ",
      "moonstruck": "7/10 The Favourite has ruined me. my mom asked me what i watched on valentine's day and i accidentally almost said \"Cuntstruck\" 😔     ",
      "velvet-buzzsaw": "5/10 omg everyone i'm so sorry!!! when i sold my soul to that ancient trickster god in exchange for the actualization of my heart's truest desire (jake gyllenhaal playing a bisexual art critic named \"morf\" in a horror-comedy), i forgot to specify that i also wanted a cohesive plot structure 😔   again, SO SORRY — will definitely not be making the same mistake with this monkey paw i stole from a vengeful witch!     ",
      "below-the-trees": " WOO HOO a suspenseful, witchy horror short! the foggy forest's natural lighting crafts a satisfyingly spooky atmosphere, which is only enhanced by the rhythmic editing and smooth camerawork -- very impressive considering director/writer/editor parker brennon's micro-budget! though the plot is a bit familiar (think Hereditary, Rosemary's Baby), i for one believe that there should be as many movies about witches as possible. witches should have their own sub-genre on streaming platforms ALL YEAR, and NOT JUST DURING HALLOWEEN!!!  support witches and support indie filmmakers -- you can watch this short (which is a prelude to an eventual feature film) here!     ",
      "hanna": "9/10 made my german friend watch this with me just so he could confirm whether or not tom hollander's german accent sounds authentic (GOOD NEWS: IT DOES)     ",
      "stoker": "10/10 \"Goth lives matter!!! GOTH! Emo cuties!!!!!!! - Lil B\" - park chan-wook     ",
      "miss-bala-2019": "3/10 well ....... i liked the scene where they played los ageless by st. vincent! :)     ",
      "maniac-2018": "9/10 i am trying to be more open about my mental health, something i've spent the vast majority of my life feeling a prickly  shame for. i have a panic disorder that makes my physical body think it's GOING TO DIE!!!!! every time i'm even a little nervous, even though my brain rationally knows there's no perceived threat. my throat closes up. i can't breathe. i take a xanax with a trembling hand. i call my mom and she talks me...     ",
      "bohemian-rhapsody": "2/10 let's pretend for a second that this movie wasn't mostly directed by a pedophile (this is the only time i'll ever ask you to forget this critical fact. please remember again when specified. thanks in advance!).   yes, let's look at bohemian rhapsody completely devoid of its controversial cultural context. just for a moment. let's purely analyze it from a technical point of view.   the editing is disorienting (in an amateurish unawareness of physical space way, not a purposefully artistic and...     ",
      "nine-to-five": "10/10 so much of my time and energy is spent feeling hopelessly pissed off, especially in this political climate, and sometimes i need to CHILL! i need to laugh with my gal pals as jane fonda, lily tomlin, and dolly parton smoke a joint onscreen while indulging in their whimsical fantasies about enacting vengeance on their \"sexist egotistical lying hypocritical bigot\" of a boss! the ability to extract the humor out of the absurd shit that plagues society is a vital survival...     ",
      "bubble-boy": " a lot of this movie is just jake gyllenhaal in a bubble suit running while dammit by blink 182 plays. that is not a critique by ANY means     ",
      "support-the-girls": "8/10 |￣￣￣￣￣￣||                      ||       THE        | |     GIRLS      |     |                      ||＿＿＿＿＿__| ( __/) || (•ㅅ•) || / 　 づ        <—— ME     ",
      "under-the-silver-lake": "5/10 every 20 minutes or so something stupid would happen like topher grace going on a We Live In A Society rant and i'd think \"this kinda sucks?\" and then the admittedly sick camerawork would throw in some technical gimmick to trick me into thinking it doesn't suck that badly and then suddenly there'd be another scene of this la la loser protagonist hooking up with some nameless dream girl 70 miles out of his league and again i'd think \"this kinda sucks?\"  this cycle repeated for 2 hours and 19 minutes. it's non-refundable time that i could've instead spent rewatching 94.5% of superior neo-noir LA fantasy Mulholland Drive :(     ",
      "my-teacher-my-obsession": "2/10 from the netflix description: \"When Riley changed schools, she didn't expect the girls to crush on her English teacher dad.\"  really? your dad looks like THIS and you didn't expect a room full of horny pubescents to crush on him? AND he teaches ENGLISH, the objectively sexiest high school subject? this guy isn't even close to my physical type (i am very small and muscles scare me) but if i were back in high school he'd be the only thing getting...     ",
      "byzantium": "8/10 supremely underrated — a must watch for those who also developed a craving for forbidden vampire/human romance after reading/watching the twilight saga at an impressionable age!   the best part, however, is the casting:- saoirse ronan as edward cullen- caleb landry jones as bella swan- nobody as jacob :)     ",
      "the-master-2012": "8/10 lancaster dodd is just tyler durden for people who know how to read     ",
      "surfs-up": "10/10 \"i didn't think it would be bad, but ... i didn't think it would be good\"\"i'll just say i'm pleasantly surprised\" \"two thumbs up\"\"not enough girl penguin surfers. that's my one critique\"\"was there a whole scene implying that the mean penguin fucks his trophies or did i hallucinate that\"- rave testimonials from my friends after i made them watch this with me last night     ",
      "metropolitan": "7/10 a jane austen novel repurposed for new york yuppies (or, Urban Haute Bourgeoisie), right down to the eloquently structured dialogue and the delicious slow-burn romance. no pride & prejudice hand flex, though :/     ",
      "wish-upon": "2/10 any movie that makes me laugh til i cry is culturally valuable     ",
      "airplane": "10/10 y'all remember watching this for the first time as a kid and stifling a meltdown when the bare Tiddies came onscreen     ",
      "daredevil": "2/10 paid $3.99 to rent the 133-minute-long director's cut. don't ever question the lengths i will go to support colin farrell's career.     ",
      "suspiria-2018": "7/10    \"Ah, Lacan!\"  out of all the gruesome, unforgettable images whirling around in my head after seeing Suspiria on halloween, i keep coming back to this offhand comment made by dr. klemperer. it's a bit difficult to tell if his, \"Ah, Lacan!\" is sneering or impressed, if the doctor rejects or regards the controversial french psychologist's work. either way, there is definite validity in applying it to the film, especially since directer luca guadagnino comes from an academic background.  so let's...     ",
      "madagascar": "7/10 if you like to move it move it, comment \"i like to move it move it\" below. otherwise, perish at the hand of king julien     ",
      "first-man": "6/10    TRAGIC: this man had to go all the way to the moon to have a good cry     ",
      "teeth": "7/10 (Don't be scared, I've done this before)  Show me your teethShow me your teethShow me your teeth  Don't want no money, want your money(That shit's ugly)Just want your sex, want your sexTake a bite of my bad girl meat, bad girl meat(Take a bite of me)Show me your teeth (Let me see your mean)  Got no direction, no direction(I need direction)Just got my vamp, got my vampTake a bite of my...     ",
      "possibly-in-michigan": "9/10 up there with asparagus (1979) as one of my personal favorite shorts of all time. though it's coated in the candy-colored commercial gleam of the 80s, possibly in michigan pins down that specific, acidic repulsion that constantly simmers inside survivors. timely then, timely now. watch here!     ",
      "bonnie-and-clyde": "8/10 bonnie & clyde ran so thelma & louise could fly     ",
      "rabid": "6/10 cronenberg, mid-1970s: folks, i got a terrifying movie premise for ya: the human body. but with an extra hole :o executives: ugh fine david but just this once, okay?cronenberg: yes ... \"once\" .........     ",
      "a-mighty-wind": "6/10 christopher guest had the divine opportunity to consistently cast parker posey and then consistently wasted her comedic talent by only giving her approximately 7 minutes of screentime per film. some crimes can never be forgiven     ",
      "ai-artificial-intelligence": "7/10 obsessed with the fact that kubrick primarily wrote the 1st & 3rd act's sentimental parent/son relationship while spielberg added the 2nd act's jude law sex robot storyline and not the other way around. just goes to show ya — don't judge a director by their past filmography's central themes!     ",
      "in-my-skin": "7/10 new french extremity films about unstable women employing grotesque bodily violence and light cannibalism to unearth their most repressed, primal instincts ... yeah that's the very specific shit i like!     ",
      "closer": "8/10 \"lying is the most fun a girl can have without taking her clothes off, but it's better if you do.\" \"you like him coming in your face?\"\"yes.\"\"how does it taste?\"\"it tastes like you but sweeter.\"  pretty wild how panic! at the disco and fall out boy lifted their lines directly from closer (2004). like, out of all the movies in the world why did this one resonate so deeply with pop punk bands? the entire plot is...     ",
      "before-sunset": "10/10    between this, the FRIENDS series finale, and the LOST series premiere, 2004 sure was a big year for missing planes     ",
      "the-punk-singer": "8/10 \"I don't give a shit what people think. I know what's real, I don't care if people don't think feminism is important, because I know it is... And other people can think what they want. My problem is when people get in the way of feminism... because they don't understand it. And if they don't believe in it or they don't want to care about it, that's totally fine! But they should have to stay out of my way.\"     ",
      "alien-resurrection": "6/10 soft butch space pirate winona ryder made this worth it     ",
      "7-days-in-hell": "7/10 watched with my sports-obsessed kid brother and made him sportsplain every joke i didn't get 😊     ",
      "sharp-objects": "9/10 half of my brain: say something, anything remotely interesting about this southern gothic exploration of mental illness, trauma, and nightmarish familial relationships all through an explicitly feminine lens  the other half, destroyed by the internet: Dan Amy your Obbieject s     ",
      "the-pirates-in-an-adventure-with-scientists": "7/10 to all the fools who were surprised that hugh grant had the acting range for paddington 2 ... uh did you not see him play a claymation pirate in 2012?? hugh BEEN grant     ",
      "debs": "6/10 the cheesy romcom version of killing eve we deserve!     ",
      "ricki-and-the-flash": "6/10 written by diablo cody? directed by jonathan demme? punk rock meryl streep performing bad romance by lady gaga and smoking weed with kevin kline? sebastian stan dancing badly? of COURSE i'm gonna have fun!!     ",
      "lady-snowblood": "8/10 \"I've immersed my body in the river of vengeance and thrown away my womanhood many moons ago.\"     ",
      "muriels-wedding": "8/10 \"When I lived in Porpoise Spit, I used to sit in my room for hours and listen to ABBA songs. But since I've met you and moved to Sydney, I haven't listened to one ABBA song. That's because my life is as good as an ABBA song. It's as good as Dancing Queen.\"     ",
      "mamma-mia": "7/10    sam: step-dadbill: biological dad (probably)harry: just happy to be there :)     ",
      "braindead-1992": "8/10 i thought the imdb parents guide was exaggerating when it said \"we can't stress enough just how gory this movie is\" but ..... hoo boy     ",
      "tyrannosaur": "8/10 boning up on olivia colman's filmography before she wins the oscar for The Favourite :)     ",
      "stop-making-sense": "9/10 Big Suit Energy     ",
      "mission-impossible-iii": "7/10 philip seymour hoffman, holding a gun: i have done nothing wrong ever in my entire lifeme: i know this and i love you     ",
      "gosford-park": "7/10 tom hollander stans lemme hear you make some noise (not to be confused with spider-twink)     ",
      "a-goofy-movie": " my friend smoked weed for the first time and requested we watch this     ",
      "oceans-thirteen": "6/10       ",
      "at-any-price": "4/10 this is just high school musical but basketball is modern agriculture and racecar driving is theater and troy is a cheater/murderer and coach bolton is farmer dennis quaid and the only song the cast sings is the entirety of the national anthem. so i guess it's not actually that much like high school musical      ",
      "disobedience-2017": "7/10 jizzing in peaches is so last year — in 2018 we're spitting in each other's mouths like adults     ",
      "revenge-2017": "7/10 REVENGE takes the misogyny associated with rape-revenge exploitation films and flips it on its head, then drags it through a desert full of broken glass. the level of visceral disgust this woman feels with her abusers is strangely cathartic, and the She Did That! moments are even more so. new french extremity is back and better than ever, baby!     ",
      "the-lorax-2012": "3/10 why the FUCK did they make the once-ler that specific kind of lanky-indie-dweeb-hot that only appeals to people who had a panic! at the disco phase in middle school. how can that be profitable for illumination entertainment     ",
      "the-greatest-showman": "3/10 the scene in the beginning where young hugh jackman gets away with stealing bread proves that this is an alternate timeline where jean valjean starts a circus instead of going to prison for 19 years, finding god, and becoming the mayor of a little french town     ",
      "movie-43": " i paid $3.99 to rent this. happy 4/20 everyone     ",
      "im-a-cyborg-but-thats-ok": "9/10 really nice to see a movie where people with mental illness aren't villainized in the slightest! the two leads treat each other with such respect and compassion, and are shown to be not just capable, but deserving of romantic love :') gimme more absurdist arthouse romcoms!!!     ",
      "playing-by-heart": "6/10 when i was created in a madwoman's laboratory 22 years ago, i was endowed with a special gene that forces me to like anything starring angelina jolie as a grungy manic pixie dream girl, gillian anderson as a cynical theater director who accidentally married a gay man, and dennis quaid as an improv actor who seeks solace from a drag queen. it does not matter how thin the plot is or how contrived the script — i was specifically genetically engineered to enjoy this movie and no one can fault me for it     ",
      "isle-of-dogs-2018": "7/10 pretty bold of wes anderson to make a film about how propaganda is bad while simultaneously inserting blatant anti-cat propaganda throughout said film 🤔     ",
      "rope": "8/10 what's up with dudes who went to harvard and accusing their friends of chicken cruelty     ",
      "west-side-story": "8/10 fellas is it gay to have casual dance fights with your bros     ",
      "love-simon": "7/10 things love, simon got correct about gay culture: -iced coffee -musical theater -watching panic! at the disco videos on youtube in middle school  incorrect about gay culture:-simon's ability to drive     ",
      "the-men-who-stare-at-goats": "6/10 george clooney jedisplaining to ewan mcgregor for 93 minutes sounds more fun than it actually is     ",
      "thoroughbreds-2017": "7/10 Trust No Horse Girl     ",
      "revolting-rhymes-2016": "7/10 MAKE THE PRINCESSES EXPLICITLY GAY YOU COWARDS     ",
      "annihilation": "9/10    my only criticism about the ending is that the shimmer is a lesbian icon who did nothing wrong but she still gets destroyed ... ugh hollywood sure loves to bury their gays 🙄     ",
      "suburbicon": "4/10 the 5 minutes of screen time that julianne moore & oscar isaac shared: great! 👍🏽⭐️💯☺️the other 99 minutes: bad! 👎🏽💣❌😴     ",
      "early-man": "6/10 god i lose my shit every time i see an aardman bunny!!!! this studio makes the cutest claymation bunnies and they KNOW it. glad to see a bunny in this flick — aardman's really giving the people what we want (more bunnies)     ",
      "fight-club": "10/10 first watch: fight club is the best movie ever madesecond watch: fight club is a deep commentary on the dangers of consumerismthird watch: fight club is a disgusting cesspool of toxic masculinity and it's not as deep as its fanboys think it isfourth watch: fight club is a critique of toxic masculinity and it's deeper than its fanboys think it isfifth watch: fight club is the best satirical gay romcom ever made     ",
      "high-school-musical-2": " the funniest subplot of this movie is how troy is sooooo jealous that ryan and gabriella are hanging out. troy, my dude. my man.. this is such a non-issue. have you seen his patterned hats? his jazz squares? his twinkish mannerisms? if you had actually been a team player and gone to the staff baseball game, you would've seen him and chad perform I Don't Dance, a song very clearly about grappling and experimenting with sexuality (read the lyrics! study...     ",
      "the-lair-of-the-white-worm": "7/10    finding out that Hugh Grant starred in a Ken Russell-directed ‘80s vampiric psychosexual horror made my day and watching him cut a snake-person in half with a giant sword made my week     ",
      "jennifers-body": "9/10 this is twilight for bi girls     ",
      "the-snowman-2017": "3/10 honestly it's fine until you think about it for more than 2.5 seconds     ",
      "mermaids": "8/10 \"Oh, I'm gonna burn in hell for sure. He's talking about his poor dead mother and I can't stop wishing his hands were unbuttoning my dress.\"     ",
      "sing-2016": "3/10 this is it! the end of culture! culture's over everybody — we lost!     ",
      "black-mirror-hang-the-dj": "7/10 yeah it's pretty good but it's missing a thicc colin farrell, a blind rachel weisz, and an absurdist greek director     ",
      "a-home-at-the-end-of-the-world": "7/10 bisexual colin farrell smoking a joint with robin wright then crying during sex with her     ",
      "marjorie-prime": "7/10 it's nice to see a Hot Dude AI in a movie for a change! the closest thing we have to that in real life is the british male Siri. god i love when he tells me to \"bear right\" on the highway     ",
      "billy-elliot": "8/10 second best in the You're-Giving-Up-Your-Dream-No-Dad-I'm-Giving-Up-Yours film canon. first being high school musical, obviously     ",
      "robots": "6/10 Robots is straight up a sexy political comedy-thriller, that also functions as an explicit commentary on class conflict & capitalism & propaganda & big pharma & MUCH more, disguised as a feel-good animated kids movie     ",
      "the-sprinkler-sprinkled": " comedy peaked in 1895     ",
      "bad-teacher": "6/10 i liked the parts where the teacher was bad     ",
      "funny-face": "6/10 the Look of the Day is audrey hepburn in a black turtleneck interpretive dancing in a parisian beatnik night club     ",
      "certain-women": "8/10 Certain Women earnestly articulates the lonely frustration of being a certain type of woman -- certain as in particular as well as in self-assured. As strong as we appear to be, sometimes we just want men (and Kristen Stewart) to listen to us, to trust us, to believe us.     ",
      "whos-afraid-of-virginia-woolf": "10/10 \"You're all flops. I am the Earth Mother and you are all flops.\"     ",
      "meet-joe-black": "6/10 the only thing stopping this from being my new go-to feel-good movie is that it's 178 minutes long for uhhh no discernible reason     ",
      "donnie-darko": "10/10    yo donnie darko he was just 16 when he found a very strange book to readit was all about a realm unseen(he's gonna save the world cause he's donnie darko)when a bunny named frank showed up to assist donnie darko decided to follow itthere was a great big crash and everything changedhis mental health got all rearrangedwhen he first woke up he realizedthat frank the bunny had saved his lifehe could see...     ",
      "desert-hearts": "7/10 i know it's not productive to draw comparisons between every single LGBT movie but Desert Hearts features the two leads in cowboy outfits riding horses so i'm calling it Lesbian Brokeback Mountain anyway     ",
      "spy-game": "4/10 brad pitt: it's not a fuckin game!robert redford: oh yes it is. that's exactly what it is. and it's no kid's game either. this is a whole other game. and it's serious and it's dangerous and it's not one you wanna lose.me, rocketing up from the couch, knocking shit over, cheering at the top of my lungs: YES! YESSSSSSSS     ",
      "fear-shame": " i'm the new york city hot dog     ",
      "burn-after-reading": "8/10 brad pitt: *does silly dancing*me: put it in my Ass     ",
      "2001-a-space-odyssey": "9/10 we were supposed to get commercial space travel in 2001 & what did we get instead???? purple ketchup and 9/11     ",
      "the-lion-in-your-living-room": " \"cats didn't have a purpose then, they don't have a purpose now, and they'll probably never have a purpose\" - cat scientist in cat documentary     ",
      "oceans-eleven-2001": "8/10 here's a list of food brad pitt eats in The Best Male Fantasy of All Time™ aka Ocean's Eleven (2001). please let me know if i missed anything -- it was very hard to keep track.  -nachos-salad x 2-cotton candy-fruit cup -assorted party snacks x 2-lollipop-shrimp cocktail -ice cream-burger  ps. tag yourself i'm the lollipop     ",
      "x-men-the-last-stand": "4/10    every time an x-man would die i'd just brush it off as Fake News, figuring that they'd come back at the end like jean grey does in x2. what a fool i was.  - RIP cyclops you were wildly disrespected & underdeveloped </3 -RIP jean grey you were also disrespected but at least you had more than 2 scenes </3 -RIP professor x even though you're somehow miraculously back at it in the post-credits <3  -also RIP mcsteamy you're in this for like a second & have only one line in the whole movie lol but you'll be missed </3     ",
      "logorama": "4/10 this felt like it was written by three fight club fanboys who all think they're way deeper than they really are  the fact that david fincher has a voice acting role as the Pringles Logo confirms my suspicions     ",
      "suspiria": "10/10 actors: $2000hair/makeup: $300dubbing: $1050lighting: $12 millionspecial effects: $750  someone who is good at the economy please help me budget this. my family is dying     ",
      "fantastic-beasts-and-where-to-find-them": "4/10    i didn't see the point in any of the scenes without colin farrell so when he downgraded into j*hnny d*pp near the end i ejected the dvd and sent it back to netflix (i still use dvd netflix). i'll never know how this movie ends and i'm 100% fine with that     ",
      "the-umbrellas-of-cherbourg": "7/10 my aunt used to live in cherbourg ...     ",
      "single-white-female": "6/10 would you rather  A. single white female your roommateB. gone girl your husbandC. black swan yourselfD. kill bill     ",
      "fright-night-2011": "8/10 me: who is the genius who put colin farrell, david tennant, imogen poots, dave franco, toni collette, anton yelchin & mclovin all in a comedy-horror movie togethercredits: casting by allison jonesme: THAT'S MY GIRL     ",
      "a-very-potter-sequel-2010": "7/10 it had no business being 3 hours & 33 minutes long but they gave lupin a bigger role than he had in the movies so i can't complain     ",
      "a-very-potter-musical-2009": "8/10 if i went to university of michigan in 2009 and heard that the theater majors were making a full-length harry potter musical i would beat those nerds tf up and then regret it & reform myself after i realized that the show turned out to be a lowkey masterpiece     ",
      "mike-birbiglia-thank-god-for-jokes": " lost me at \"david o russell is one of my favorite directors\"     ",
      "lilo-stitch": "8/10 i think i remember having a weird crush on pleakley as a Youth .. what does that say about me ?     ",
      "in-the-loop": "8/10 \"i haven't got any thoughts. i'm just staring vacantly into space while a distant voice in the back of my head goes 'oh shit!'  like a car alarm in the middle of the night.\"  english character actor tom hollander nailing english ennui as per english usual <3     ",
      "josie-and-the-pussycats": "10/10 ‪Josie & The Pussycats is the Best Movie Ever‬  ‪Join The Army‬     ",
      "top-gun": "6/10 there's no way this is a real movie     ",
      "all-about-eve": "9/10 if you ever wondered what the world of high school theater is like ..... this is it, baby!     ",
      "hugo": "7/10 can everyone just do me a solid & agree with me that sacha baron cohen is actually hot     ",
      "minority-report": "8/10 colin farrell's character introduces himself to tom cruise as \"the twink from the Fed\" #gayrights     ",
      "rise-of-the-guardians": "6/10 my dad saw that i recorded this on the dvr & assumed i wanted to watch it as a family for christmas tonight ... i had to turn him down because every voice actor in this animated children's film is insanely hot and i didn't wanna think impure thoughts about cartoons in front of my parents     ",
      "nocturnal-animals": "6/10    i'm so sorry tom ford but i laughed out loud when jake gyllenhaal accidentally fell on his gun and shot himself HAH I'M LAUGHING JUST THINKING ABOUT IT     ",
      "lost-river": "6/10 need me a freak like ryan gosling     ",
      "funny-games-2007": "8/10    my review was gonna be \"i did not laugh once during these games\" but .. i did laugh a few times because tim roth was typecast again as \"Man Who Gets Hurt Early On in the Movie and Spends the Rest of it Bleeding and Crying\"     ",
      "poltergeist": "8/10 extra half star because if you squint you can pretend that craig t nelson is harrison ford     ",
      "magic-mike-xxl": "8/10 my definition of feminism is hitting the bong while watching magic mike xxl     ",
      "step-up": "5/10 imdb says channing tatum plays the protagonist but i'm pretty sure that's actually eminem?     ",
      "bound": "8/10 \"When executives at some studios read the script, they told the Wachowskis that if they changed the character of Corky to that of a man, they would be interested. The siblings declined, saying 'that movie's been made a million times, so we're really not interested in it.'\"  :)     ",
      "star-wars-episode-iii-revenge-of-the-sith": "6/10 more like obi-wan canboneme     ",
      "star-wars-episode-ii-attack-of-the-clones": "5/10 i'm convinced that anakin subconsciously used the force to make padme slowly fall in love with him because there's simply no way a queen/galactic senator would EVER get with a creepy, whiny child murderer with a mini ponytail     ",
      "existenz": "8/10 \"i have this phobia about having my body... penetrated\" —Jude Law     ",
      "celeste-jesse-forever": "7/10 rashida jones hitting a 3 foot tall bong <3     ",
      "psycho": "8/10 biggest twist of all time is that norman bates is hot     ",
      "the-witch-2015": "8/10 thy lady didst that!     ",
      "popstar-never-stop-never-stopping": "10/10 \"conner. we've talked about this. 30 seconds to mars is the name of a BAND. it's not a FACT\"     ",
      "lifes-a-jungle-africas-most-wanted": "2/10 can't believe that literally only 15 people have watched this movie ive seen it like 7 times it's so ridiculously funny & my fav animated dog movie     ",
      "marina-abramovic-the-artist-is-present": "8/10 i was the guy who didn't recognize james franco     ",
      "the-ring-2002": "8/10 the story of a woman who only has 7 days to analyze the meaning of an avant-garde experimental art film. just take a cinema studies class, girl!     ",
      "cry-baby": "6/10 i played the girl who cried into a jar and then drank the tears     ",
      "phoenix-2014": "8/10 \"When you were sitting in the dark, I thought you'd shot him and needed my help. And honestly, I'd have preferred that.\"     ",
      "the-cook-the-thief-his-wife-her-lover": "7/10 this is the grossest movie i've ever watched and i've seen the human centipede three times     ",
      "the-adventures-of-sharkboy-and-lavagirl": "2/10 my friends and i put this on in the background and accidentally watched the whole thing. we were so high     ",
      "beauty-and-the-beast-1991": "6/10 still don't really get why she ends up with a really big bear and not the sexy candle     "
   }
}