{
   "user": "deathproof",
   "reviews": {
      "jenny-slate-seasoned-professional": " just tried to watch this but i'm too zooted off this edible to concentrate on the jokes so this is me reminding myself to watch this tomorrow. ok love you bye     ",
      "it-follows": "10/10 WHAT AN AESTHETIC     ",
      "the-player": "9/10 my first altman! these cameos went hard as hell     ",
      "smiley-face": "10/10 i'm sober right now and this is still a masterpiece     ",
      "the-zone-of-interest": "9/10 been chewing on this one for a few days now and it honestly kinda fucked me up. just a singular, monumental kind of film. uncompromising in its vision and chilling to the bone. cruelly dangles every threat within earshot, the sounds of screams, trains and gunshots, but usually it's all just out of reach, filling every sparse bit of the screen with dread and crushing despair. incredibly fucking stressful but worth the full impact in the end     ",
      "blow-out": "8/10 an ending so good i had to rewind that fucker and play it again... christ almighty     ",
      "the-holiday": "7/10 funny how my depression has been real quiet since i rewatched this on a flight earlier today     ",
      "a-christmas-story-1983": "10/10 merry christmas! now back to the 24 hour marathon     ",
      "bad-cgi-sharks": " such a good time, it got a laugh out of me every single time it cut to a shark floating in mid air     ",
      "the-favourite": "10/10 CIFF 2018: film #7  \"because i will not lie. that is love\"  this killed me just like everyone knew it would. everything here is near perfect, and the power plays are absolutely ridiculous. the whole audience was laughing wildly during almost every scene. and it's rare for me to thoroughly enjoy all lead characters in a film, but the three actresses really get to stretch their legs in these roles: i've never loved (and hated) emma stone more, and rachel weisz...     ",
      "poor-things-2023": "9/10 a cinematic feast. there are a handful of small lulls in the second act, but as a complete picture it devours. the absurdity and tragedy of living boiled down to a rich concentrate and then spray painted all over the walls. i'm craving that rewatch already  gotta be a career best for emma stone, and i don't say that lightly. her character progression is so intuitive that it's sometimes almost difficult to watch. human nature captured in facial expressions and...     ",
      "worlds-biggest-ghost-hunt-pennhurst-asylum": " opened hulu right when the edible hit and suddenly i'm pressing play on world's biggest ghost hunt: pennhurst asylum 🤦‍♀️     ",
      "thanksgiving-2023": "7/10 during a particularly gruesome scene, someone behind me exclaimed \"that's fucking disgusting\", and the person next to them immediately followed that with \"this is so gross\". suffice it to say i had a fabulous time     ",
      "the-hunger-games-the-ballad-of-songbirds-snakes": "6/10 lucy gray: i don't wanna be in the hunger games :(crypto: I'M SLIM SHADY YES I'M THE REAL SHADY     ",
      "may-december": "8/10 no one is allowed to call any other new release\"camp\" for an entire year. this girl takes the CAKE     ",
      "taylor-swift-the-eras-tour": " it is with a heavy heart that i announce that this was, in fact, quite an enjoyable experience... the things i do for my niece     ",
      "wingwomen": "8/10 like CATNIP to me     ",
      "the-fall-of-the-house-of-usher-2023": "9/10    DRIPPY BIRKIN BAG FULL OF MONKEY BITS     ",
      "scream": "8/10    my niece was so enthralled and unspoiled that at the reveal she said \"oh my god. it's billy\" yeah they gagged her for REAL     ",
      "the-exorcist-believer": "2/10 https://x.com/allreactionvids/status/1370749473824108550?s=46&t=YaNVKvIOYgiQa5pnH7r68A     ",
      "stop-making-sense": " one of the most profound \"oh... i get it\" moments of my life     ",
      "oppenheimer-2023": "8/10 oppy :(     ",
      "pink-flamingos": "8/10 egg paranoia!     ",
      "bottoms": "7/10 YOU GOTTA GET THE BUN 😏     ",
      "talk-to-me-2022": "7/10 had the best montage i've seen in a while     ",
      "perfect-blue": "9/10 stressed me out so bad that i went immediately home and had to take my ativan... it IS that serious     ",
      "passages-2023": "7/10 one of the best love triangle castings in film history     ",
      "paranormal-activity": "6/10 girl i fully would've been sleeping in depends diapers every single night out of fear 😭     ",
      "romy-and-micheles-high-school-reunion": "10/10 funny enough the statistics show that this movie contains at least 13 of the top 100 best film quotes of all time, including but not limited to \"i cut my foot before and my shoe is filling up with blood\" and \"there's a guy in a rowboat going x miles, and the current is going like, you know, some other miles, and how long does it take him to get to town? it's like, who cares? who wants to go to town with a guy who drives a rowboat?\"     ",
      "spider-man-across-the-spider-verse": "9/10 this is what superhero movies should have always been. complete, concentrated imagination     ",
      "no-hard-feelings-2023": "6/10 when it's good, it's really good. but when it's bad... ANYWAYS, hoping this is the start of a jlaw comedy reign, let's keep it going     ",
      "asteroid-city": "8/10 hands down favorite wes since grand budapest. i'm talking like huge smile plastered on my face the whole time + had to call my dad immediately afterwards to make sure he sees it as soon as he possibly can     ",
      "past-lives": "9/10 oh you gotta be kidding me 🥹     ",
      "the-ascent": "9/10 tremendous film, i cried the last 20 minutes because i was so overwhelmed with emotion. also, i did make a video about my trip to the theater to see this alongside come and see 🫣     ",
      "whip-it": "10/10 my girl has to take a break from that talk show to come back and DIRECT. we NEED you, drew. also i have to mention that before this screening i had the most incredible cherry cheesecake and cannot stop thinking about it     ",
      "inception": "10/10 \"the dream has become their reality. who are you to say otherwise?\"  just as i suspected, still a masterpiece 🥵     ",
      "fast-x": "6/10 cannot stop thinking about dame helen mirren's delivery of the stupendous line \"well it ain't no roman holiday\" these movies make me squirm in my theater seat with pure joy and disbelief. holy shit. can't believe we're in the fucking avengers era of the fast series. this gargantuan beast is literally just a bunch of things haphazardly hot glued together, but i had a fuckin' blast. it's not good, but man is it fun     ",
      "birth-2004": "10/10 one of the most miraculous films i've ever seen     ",
      "sick-of-myself": "9/10 a satirical stinger, both hilarious and horrific. narcissism dialed up so high that it teeters into munchausen territory. one surprising addition was the layered criticisms of able bodied people seemingly uplifting people with illness/disability, but only if they're still outwardly conventionally attractive and profitable to them. when that stops being true their social niceties try to mask clear discomfort as they're unsure of what they got themselves into, just as our protagonist, (if you even want to call her that),...     ",
      "oceans-eleven-2001": "8/10 when julia roberts first appears... now THAT'S a movie star     ",
      "beau-is-afraid": "4/10 should've started my sharp objects rewatch instead     ",
      "the-super-mario-bros-movie": "3/10 koopa troopas are so loved (by me)     ",
      "josie-and-the-pussycats": "10/10 Josie and The Pussycats Is The Best Movie Ever     ",
      "80-for-brady": "6/10 lives were changed, hearts were healed     ",
      "girl-interrupted": "10/10 only makes more sense the older i get     ",
      "theater-camp-2023": "8/10 due to my little to no interest in theater i was really surprised at how much i loved this. among other things it feels like glee meets wet hot american summer, but thankfully unlike glee, (a piece of cursed media which remains a black hole of despair), is pleasantly good natured while never sacrificing its biting sense of humor. i truly couldn't stop laughing. entire cast tore up every scene, (ayo!!! PATTI!!!) but molly gordon, that's my GIRL... \"get off the stick... get off the stick...\"     ",
      "infinity-pool": " nasty and erotic, the kind of hazy nightmare that refuses to let you wake up. mia goth is really burning up the screen lately and i can't get enough     ",
      "gummo": " i want a mustache, dammit     ",
      "metropolis": "7/10 they hate to see a devilish girlbossified robot winning     ",
      "broker-2022": "8/10 kore-eda might be one of the only masters of genuine empathy and pure sentiment     ",
      "the-double-life-of-veronique": "8/10    \"i have a strange feeling. i feel like i'm not alone. like i'm not alone in the world.\"  a glorious saturated daydream, but too vague for me to take it all in at once. i have a feeling this will get better the longer it soaks in  \"not long ago, i had a strange sensation. i felt that i was alone.\"     ",
      "2001-a-space-odyssey": "10/10 \"i can feel it. i can feel it. i can feel it\"  maybe the most monumental film in history, and even better on the big screen. and while rewatching it today, i finally realized why it hits me so hard every time: it doesn't feel like fiction to me. i know it is, but it feels tangible, like an eventual future, even in the abstract. there's a thread of truth running through it, sparking a fear and wonder in me that no film has ever matched in the same way, the most colossal and terrifying inevitability of our current existence: we are not alone     ",
      "babylon-2022": "5/10 well, fuck... i guess...  (keeping my many negative thoughts on this motion picture to myself and only mentioning that a few scenes were very fun and li jun li‘s marlene dietrich-esque lesbian serve should have been the focus of the movie, duhhhh. it's my review and i get to say what i WANT!)     ",
      "eyes-wide-shut": "8/10 damn     ",
      "radiohead-in-rainbows-from-the-basement": " literally the greatest band in the world LMAO     ",
      "barry-lyndon": "8/10 and just as marina foretold: the primadonna life the rise and fall     ",
      "m3gan": "8/10 this movie will be the key to world peace     ",
      "the-menu-2022": "7/10 had i taken an edible beforehand i fear this would've been 5 stars     ",
      "glass-onion": "8/10 mona lisa kinda lisa     ",
      "marcel-the-shell-with-shoes-on-2021": "9/10 going to need every single one of you to RUN to the theater to see this when it's playing near you. just the most poignant little film that made me cry so much. i am very happy it exists and will be rewatching it one million more times when i am sad. and that's all i know for sure     ",
      "i-married-a-witch": "8/10 well now i have no choice but to consume veronica lake's entire early filmography 🤨     ",
      "tar-2022": "9/10 exquisite. a fully realized vision from page to screen. to label this film in almost any way is to do a disservice to its complexity, and the complexity of the topics at hand. there is no otherworldly finger wagging at the audience, the kinds of recent movies lacking depth that all but scream at us, \"look here, think this, and feel badly about it\". the art vs the artist conversation has very rarely, if never, been seen through such a...     ",
      "the-banshees-of-inisherin": "7/10 sad     ",
      "monica": "7/10 AFI 2022: film #10  \"what's your name again? please remind me\"  i wish there was a bit more dialogue, maybe along a slightly longer timeline, but it manages to say so much while still keeping an air of mystery that adds an emotional weight to every scene. and such a lovely and tender performance by trace lysette     ",
      "the-eternal-daughter": "8/10 AFI 2022: film #9  \"the longer we're here, the more it comes back\"  nothing in the world more interesting or complex than the relationships we have with our mothers and all the muddled misremembering, overthinking and projecting we'll do regarding them until the day we die. how silly!!!     ",
      "the-five-devils": "8/10 AFI 2022: film #8  \"could you live without her?\"  it's giving mid-budget mid-january indie sci fi thriller, but better and frencher. i approached this viewing from more of a popcorn movie perspective, which allowed me to really enjoy the supernatural layers and not come at it too seriously. also, it contains my favorite sub-genre in all of cinema: surprise lesbians, and one of the best \"random-homophbic-one-liners-from-a-child\" of all time. thank you adele exarchopoulos for this much needed boost of seratonin. mmmmmm     ",
      "godland": "5/10 AFI 2022: film #7  \"you look miserable\"  this was gorgeous, but i am very weary, and can't at the moment tell how much of what i'm feeling was the movie lacking or just my mood. apologies to this priest and his camera backpack     ",
      "joyland-2022": "7/10 AFI 2022: film #5  \"whatever i'm doing, i'm doing for myself\"  an impactful ensemble about autonomy and identity. takes a bold change in direction by the final act that i wasn't anticipating, but the more i sit with it, the more correct it feels. a wonderful and haunting piece of filmmaking     ",
      "de-humani-corporis-fabrica": " AFI 2022: film #4   \"i need a vacation\"  there's some wildly fascinating stuff going on here, but much of it is essentially youtube videos of various surgeries randomly placed around other odd hospital footage. most of the editing choices don't feel purposeful and lack human interest to the point of confusion: i don't mind cold subject matter, but you can only stare at a close up of internal organs so many times in a row before it feels lackluster. but...     ",
      "bruiser-2022": "8/10 AFI 2022: film #3  \"it's not a good way to be\"  a stunning debut that frames greek tragedy using a modern lense. equal parts compelling and visually striking with a tight script and strong performances, especially by trevante rhodes. it appears to have been picked up by hulu so i highly recommend seeking it out when it drops on the platform     ",
      "piaffe": "2/10 AFI 2022: film #2  a very \"not for me\" movie. weird and horny and eccentric but doesn't infuse these elements in cohesively so it falls into incredibly dull territory instead. horse girls make do!     ",
      "the-eight-mountains": "7/10    AFI 2022: film #1  \"it was a beautiful day, wasn't it?\"  a visually mesmerizing look at two paths that cross again and again and how a bond so deep can shape one's past, present and future. some might say it lacks excitement in terms of plot, (and it does run a bit long), but i was content to hang around in the comfortable, lived-in world it created     ",
      "trick-r-treat": "10/10 for me, it isn't christmas/christmas eve without a christmas story, and it isn't halloween without trick r treat     ",
      "house-on-haunted-hill-1999": "5/10 pressing play on a feature starring ali larter and you just know it's about to be a hoot and a half     ",
      "halloweentown": "8/10 wow, i can't believe halloweentown is the best movie ever made     ",
      "decision-to-leave": "9/10 another off-kilter love story from one of the only true visionary filmmakers working today... calmer than the handmaiden, but stings all the same. and tang wei's performance might be the most i've fallen for a femme fatale in... maybe ever     ",
      "halloween-kills": "1/10 above all else this is an inaccurate portrayal of small town illinois as there were no scenes of the townspeople standing on their lawns, gossiping with their neighbors and trying to get a glimpse of michael walking around like he was a twister during a tornado warning     ",
      "event-horizon": "6/10 cenobites in space, I REPEAT, CENOBITES IN SPACE     ",
      "triangle-of-sadness": "8/10    almost ashamed to admit that this evoked what was likely my biggest laugh in a theater this year during a 30 second long shot of someone projectile vomiting. it peaked for me in the second act but has a solid conclusion and a few great editing choices that i'm excited to revisit later. probably too long but i didn't feel the runtime in the slightest. would pair well with lanthimos‘ the lobster     ",
      "bride-of-frankenstein": "8/10 and elsa lanchester, who plays bride, she gave everything     ",
      "smile-2022": "7/10 we are now living in a post it follows world, and i am not immune to the movies it inspires. the thread of trauma throughout this is interesting at first but ends up a bit too heavy handed and clunky for my taste, especially near the end. besides that, (and a few lulls in the plot), it kept my attention and has a few choice sequences of absolute terror. i had fun! and that's most of what i need from a movie like this     ",
      "dont-worry-darling": "2/10 whatever wave of feminism has been taking over the movies lately... can we fast forward to the next one?     ",
      "world-of-tomorrow": "8/10 \"oh, oh god. oh god. oh god. oh my god. holy mother of god. oh oh.. oh... oh god.\"     ",
      "barbarian-2022": "7/10 doesn't quite reach the level that malignant is on, but did more for me than X (and a certain related prequel). personally i cannot get enough of these silly billy nightmare movies     ",
      "blackpink-light-up-the-sky": " living with a blink has done wonders for my brain     ",
      "the-guilty-2021": "4/10 oh i feel soooo bad for anyone who saw this before/instead of the original... and if you haven't seen either of them yet... it's not too late to make the right choice     ",
      "may": "8/10 she did what she needed to do. also: horndog lipstick lesbian anna faris??? like?????????     ",
      "three-colours-blue": "7/10 blue is the saddest color     ",
      "gutted": " tense and contemplative with a beautiful score and impactful performances, this was a joy to watch and assist in the edit. endlessly in awe of jacob and his ability to create things like this from start to finish. for those interested you can check it out on vimeo here     ",
      "bodies-bodies-bodies": "6/10 rachel sennott is our generation's lucille ball     ",
      "the-day-after-tomorrow": "6/10 when disaster movies are comforting somehow     ",
      "nope": "9/10 absolutely TERRIFYING but in the same vein doubles as a much needed outrageous and original summer blockbuster. the kind of horror movie that made me laugh with relief after a jump scare and anxiously grab for more popcorn, which now that i'm actually thinking about it is quite a rare feat nowadays. the perfect storm of jaws and super 8 and probably many other things but completely its own and distinctly made. countless people say this daily now but jordan peele truly is like... unbelievably great at this movie making thing     ",
      "fire-of-love-2022": "7/10 when tilda swinton and john c reilly reunite for this biopic and both earn oscars for kissing near erupting volcanoes     ",
      "mrs-harris-goes-to-paris": "6/10 redownloading duolingo to pick back up on my french lessons with the little green owl as we SPEAK!     ",
      "thor-love-and-thunder": "5/10 almost 30 feature length entries into this franchise and now it feels to me like the human brain can only really take in so many of these generic deep fried mega tentpole adventures before it starts to collapse in on itself and now they don't really look like much of anything anymore and aren't very distinguishable from each other regardless of content. i shouldn't be zoning out every single movie during the most high energy fight scenes. this was fine! but are we done?     ",
      "national-treasure": "8/10 he stole it!     ",
      "elvis-2022": "4/10 the longest movie i have ever seen + WISHES it served charisma uniqueness nerve and talent the way that dewey cox did and i am so serious     ",
      "pretty-woman": "7/10 the way people ran out of the theater for a bathroom break in droves only when julia roberts wasn't on screen for a scene... her power is remarkable     ",
      "the-neon-demon": "10/10 JUST KILL ME GUY     ",
      "cool-blue-car": " patti harrison is the future of comedy     ",
      "serial-mom": "9/10 the kind of movie that makes me feel more complete as a person now that i've finally seen it     ",
      "polyester": "8/10 edith massey‘s line delivery is immaculate and needs to be studied extensively     ",
      "dead-ringers": "7/10 two of them 😔     ",
      "existenz": "6/10 jennifer jason leigh crying a single tear over a nasty cronenberg umbilical cord gamecube is more convincing than some actor's best performances     ",
      "a-history-of-violence": "6/10 nobody told me this was a COMEDY?     ",
      "the-girl-with-the-dragon-tattoo-2011": "10/10 \"but i misjudged just how sick you are\"  i still remember the first time i saw this in theaters, leaning forward from the opening credits, literally on the edge of my seat. it's the grittiest fincher has ever gotten in a certain sense: instead of just focusing on murder, it dives deeper into the wounds left when people are truly cruel to others. it's graphic and painful to watch. and it has a coldness, the frigid scenery sets the tone from...     ",
      "portrait-of-a-lady-on-fire": "10/10 CIFF 2019: film #2  \"he doesn't make the lover's choice, but the poet's\"  my body is still visibly shaken, and i cried the entire duration. i haven't been this moved by a film in years. not only is it exquisitely made, but the emotional toll it took on me is almost damaging. yearning personified: seen through the stokes of a paintbrush, or across the flames of a fire. crushing and beautiful and fleeting. sometimes all that's left is the memory, but the memory stays. that last shot is going to haunt me     ",
      "fairy-dust": " tove lo really is a genius... mozart couldn't do it!     ",
      "watcher": "8/10 maika monroe really is the lowkey scream queen of my dreams... and i am living     ",
      "men-2022": "1/10 the irony that i'm fearful of what men will say to me in the comments section for my review of the movie men (2022)... we have fun     ",
      "chopping-mall": "8/10 thank you... have a nice day     ",
      "the-slumber-party-massacre": "6/10 the girls at this slumber party: let's try not to get murdered me last weekend at my last slumber party after one shot of grey goose: i just don't know what i'm doing with my life 😔 now let's yell about the state of american politics for a while     ",
      "howls-moving-castle": "9/10 i bet on wheezing dogs...     ",
      "raw-2016": "9/10 EXACTLY what the 2017 film scene DESPERATELY needed     ",
      "decalogue-i": "9/10 i feel like pure shit. can't wait to keep watching! 😁     ",
      "death-proof": "10/10 \"fuck that shit! let's kill this bastard.\"  i don't know how or when, but this has become my ultimate comfort movie     ",
      "planet-terror": "10/10    the concept of marley shelton cheating on her husband with FERGIE is still such an achievement in cinema history     ",
      "doctor-strange-in-the-multiverse-of-madness": "4/10 in my theater there was more hype for the nicole kidman amc ad than the actual movie itself... and honestly... deserved     ",
      "the-northman": "4/10 very cool looking! wish i cared ❤️     ",
      "kill-bill-vol-1": "10/10 every single time i watch this i want to buy a pussy wagon keychain so badly but i just can't. i can't do it     ",
      "split-ends-2022": " a beautifully memorable and deftly made short by one of my favorite creative souls that i'm lucky enough to know... now streaming free here for another day through chicago cineyouth, run don't walk!!!     ",
      "the-beaches-of-agnes": "7/10 there's something RIGHT with this beach 🥺     ",
      "final-destination-3": "8/10 the best in the franchise by a mile because it rightfully assumes we already know how this universe works and gets right to the good stuff. such ICONIC death scenes and mary elizabeth slaystead sobs through them all with the unbridled energy of a classic scream queen. and that tanning beds/coffins match cut... girl it really IS that serious     ",
      "sonic-the-hedgehog-2": "3/10 the people behind the scenes deciding on the length of a movie like this clearly haven't spent much time sitting next to a squirming child in a movie theater who can't focus for very long and the wrath they unleash upon you should they run out of tasty snacks     ",
      "everything-everywhere-all-at-once": "9/10 a movie so good that a month after seeing it i saw it again 1,933 miles away just to show it to my dad. worth noting: he laughed so hard at the introduction of the hot dog fingers that i thought he was gonna hurt himself. he also had this to say, offhand: \"that's what movie-making is for... that's what it's all about... something like THAT!\", which kinda sums it up better than i ever could     ",
      "fantastic-beasts-the-crimes-of-grindelwald": "5/10 jk rowling take a break from writing challenge     ",
      "the-lost-city-2022": "5/10 this random patti harrison instagram story is kinda funnier than the entirety of the lost city     ",
      "the-dropout": " amanda seyfriend's EGOT begins with this inspiring step forward     ",
      "the-celebration": "9/10 makes a dinner party on succession look like a game of musical chairs... i gasped like 20 times     ",
      "point-break": "7/10    when keanu identifies the suspects because he recognizes a guy's bare ass from the bank's security footage... yup homoerotisism will always be the backbone of action movies, nothing new nothing changed     ",
      "charli-xcx-alone-together": " most artists couldn't make an album this good with unlimited amounts of time and money and she did it in 5 weeks while stuck in her house during quarantine... no it's true     ",
      "the-bling-ring": "9/10 why do i always have so much fun watching this     ",
      "marie-antoinette-2006": "9/10 kirsten ate this (cake) up and left no crumbs     ",
      "twilight-2008": "8/10 know your herstory     ",
      "belfast": "4/10 gilderoy lockhart‘s career has taken an interesting turn ever since he lost his memory     ",
      "west-side-story-2021": "6/10 this was a movie     ",
      "x-2022": "6/10 \"you know i don't like blondes\" HELP ME 😭     ",
      "the-power-of-the-dog": "8/10 my GOD jane campion really knows what she's doing     ",
      "turning-red": "7/10 pixar's autumn sonata moment. who else cried 😂     ",
      "world-of-tomorrow-episode-two-the-burden-of-other-peoples-thoughts": "10/10 \"what emotion should i be experiencing right now? SHOULD I BE YELLING?\"     ",
      "it-takes-two": "9/10 aintcha never gonna wanna doncha HAFTA go to the bathroom?     ",
      "for-a-good-time-call": "9/10 you know what... i think friendship is the most important thing in the world actually     ",
      "nick-and-norahs-infinite-playlist": "9/10 guys we have GOT to find fluffy     ",
      "but-im-a-cheerleader": "8/10 this masterpiece     ",
      "fresh-2022": "7/10 no less than 2 karen o needle drops in this thing... yup that's tasty indeed     ",
      "juno": "10/10 the chokehold this soundtrack had on me as a tween     ",
      "the-batman": "8/10 left the theater so bummed out that i had to cry along to a cranberries cd on the drive home. so suffice it to say: the emo batman i've always dreamed of     ",
      "blackpink-the-movie": " i may be 5 hard seltzers in but honestly this ate... rosé hive let me FEEL your presence on this letterboxd review     ",
      "muriels-wedding": "8/10 you're TERREBULE muriel     ",
      "broadcast-news": "8/10 holly hunter in this movie is why the awooga cartoon sound effect was invented     ",
      "being-the-ricardos": "4/10 ????     ",
      "marry-me-2022": " to the people who say things like \"rom coms are dead\" or \"they don't make em like this anymore\" MARRY ME IS HERE TO FILL THE VOID. also it feels like most sweet and beautifully corny rom coms aren't appreciated until it's too late so let's skip that part and put on the soundtrack     ",
      "jenny-slate-stage-fright": " \"have you ever seen a woman flirt with 400 people before?\"  jenny slate is #1. naturally the funniest person alive and #2. too good for captain america     ",
      "all-that-heaven-allows": "7/10 me in heaven: what cloud the milfs on 🤔god: GET OUT ‼️     ",
      "am-i-ok": "8/10 SUNDANCE 2022: film #2  cannot remember the last time a movie felt so specifically tailored for me personally to the point that during the scene where dakota kissed a woman it felt like a microchip activated inside my brain. super lowkey and charmingly awkward and probably definitely not for everyone, but again, very very very for Me. also i just wanna put it somewhere so here, take it: fifty shades of gay. ok and i'll stop now     ",
      "after-yang": "9/10 SUNDANCE 2022: film #1  \"there's no something without nothing\"  the kind of tender ode to grief that only comes along once in a while and feels equal parts crushing and reassuring. would pair beautifully with world of tomorrow. i replayed the ending scene and credits 4 times and sobbed. the kogonada is loved party is being held at my apartment tonight, BYOB     ",
      "harry-potter-and-the-philosophers-stone": "10/10 (part of the harry potter weekly double feature)  this really got me. not a lot of people know this about me anymore, but harry potter was probably the biggest pop culture influence on my childhood. 12 whole years of it. it's a common occurrence for someone around my age, but it was such a special, sacred thing to me. after the last movie, i left the theater and knew i had to let it go. i had just turned 17,...     ",
      "the-355": "4/10 this set women's rights back so far that we gotta fight for the right to vote all over again     ",
      "in-the-cut": "8/10 oh there's LAYERS to this...     ",
      "nightmare-alley-2021": "6/10    the shockwaves that rippled through my body when rooney called cate a \"frozen face bitch\" 💀 this is not the carol sequel i asked for!!! ALSO: toni collette milf hall of fame     ",
      "annette": "6/10 this isn't even fiction they just turned on a camera and adam driver started behaving this way     ",
      "spider-man-no-way-home": "5/10    my favorite part was when the whole theater suddenly cried out \"WE WANT KIRSTEN DUNST! WE WANT KIRSTEN DUNST!\" in complete unison     ",
      "dont-look-up-2021": "2/10 as far as mainstream directors go... this guy is kind of a menace to society     ",
      "mean-girls": "10/10 i still remember the specific feeling of being 10 years old and watching this for the first time. i thought \"this is the best movie i've ever seen in my life\" and that's still true     ",
      "together-together": "7/10 lamp 🥺     ",
      "shiva-baby-2020": "9/10 molly gordon... you have my attention     ",
      "ferris-buellers-day-off": "8/10 the art institute of chicago... gotta be in my top 5 places in the world to vibe     ",
      "licorice-pizza": "8/10 thoroughly enjoyed this very entertaining movie for a long stretch of time but weirdly enough there was an elephant in the corner of the room for like every scene. and the whole time i was like huh! there's an elephant in this room! that's kind of weird but everyone seems to be minding their business so i guess the elephant isn't a problem right now. but eventually someone pokes the elephant and made me wonder why the elephant was even...     ",
      "haim-valentine": " and that's how ya FUCKIN do it     ",
      "when-harry-met-sally": "9/10 ME AND WHO     ",
      "the-lost-daughter-2021": "8/10 this kind of tore me up and ate me alive. raw and unflinching character studies on unlikable (or: realistic) women are always such a rare and welcome sub-genre but it's like shooting in the dark to also portray motherhood specifically in such an unapologetically ugly light. good grief     ",
      "memoria-2011": "5/10 AFI 2021: film #10  \"it's like a rumble from the core of the earth\"  finished my fest with something that definitely wasn't for me but i still found interesting things within, even if they were few and far between. i will say that tilda is mesmerizing regardless of what she does on screen so i can't really complain, and i feel like that's a good note to end this on     ",
      "the-tsugua-diaries": "6/10 AFI 2021: film #9  \"it goes back\"  kind of a silly little meta pandemic drama that doesn't fully work but also i was never really bored and the mellow guitar theme song was so nice when it popped up. that's about it!     ",
      "pleasure-2021": "9/10 SUNDANCE 2021: film #32  \"you won't find anyone like me\"  i'm completely floored. i've been terrified of watching this the entire festival, fearing the worst, and while this is an extremely difficult watch in terms of both sex and sexual assault/violence i never once felt that we weren't supposed to have empathy for the protagonist in those situations. sofia kappel (in her first acting role ever) is magnetic and perfectly cast, and behind the camera ninja thyberg masterfully maps out...     ",
      "hit-the-road-2021": "8/10 AFI 2021: film #7  \"off we go\"\"where to?\"\"to hell\"  chaos and comedy intertwine from the jump here but the heart lies with the relatably messy and tender family bond. so unexpectedly good     ",
      "petite-maman": "9/10 AFI 2021: film #6  \"you didn't invent my sadness\"  celine is so incredibly good at naturally fitting emotion into such a neat and minimalist package, and the catharsis in experiencing what she's made is like unwrapping a present from someone who loves you. yes it's super cute and sweet just like i anticipated but really resonated with me in a deeper way. i can already feel my love for this blooming inside my chest     ",
      "red-rocket-2021": "3/10 AFI 2021: film #5  \"the universe is on my side, bro\"  uhhh... no comment (at least not yet)     ",
      "aheds-knee": "6/10 AFI 2021: film #4  \"maybe there'll be a miracle\"feisty and bold filmmaking run throughout this, the anger in the emotional forefront with the camera often free to roam and explore. the aggression and other repeated themes do start to feel a bit repetitive by the last act but i'll definitely be thinking on this one     ",
      "the-worst-person-in-the-world": "6/10 AFI 2021: film #3  \"i always overdo it\"  had high hopes for this and it held up for a while, especially in its humor, but i'm not really sure what i'm supposed to take away from it in the end. the protagonist starts out pretty fully formed but then the writing begins to disintegrate and chip away at her until she's left a manic pixie shell of her former self, but maybe that's what she was all along on paper...     ",
      "lingui-the-sacred-bonds-2021": "7/10 AFI 2021: film #2  \"i don't want to hide anymore\"  what a good way to tell this story, calm and matter-of-fact but always kind. love and loyalty drive the central cast of women and its that which brings them together, and even when the problems at hand are bleak they manage them head on. really liked this     ",
      "what-do-we-see-when-we-look-at-the-sky": "4/10 AFI 2021: film #1  \"that's what it's like when you love - you worry\"  unfolds like an art house fairytale but with a million different kinds of ideas crammed together, some of them sticking and a lot of them falling flat. it was beautifully shot and often charmingly fun, but just far too long in length and narratively not for me. a very interesting open to the fest this year to be sure     ",
      "last-night-in-soho": "3/10 well! ...LMAO     ",
      "spencer-2021": "9/10 oooohhhh how i missed falling in love with movies     ",
      "eternals": "6/10 the amount of times that robb stark and jon snow affectionately said \"cersei\" and it really and truly took me out every single time 😵‍💫     ",
      "disturbing-behavior": "9/10 [stefon from snl voice] this movie has everything: horny teenage robots, an edgy R rating, late 90's fashion, a weird high school janitor that yells a lot, flannel shirts, an unnessesary side plot involving a local asylum, a slightly emo katie holmes,     ",
      "i-still-know-what-you-did-last-summer": "4/10    JACK BLACK???     ",
      "jennifers-body": "9/10 invented feminism     ",
      "carrie-1976": "9/10 \"they better not start anything. they just better not. she did not know if her gift had come from the lord of light or of darkness, and now, finally finding that she did not care which, she was overcome with an almost indescribable relief, as if a huge weight, long carried, had slipped from her shoulders\"     ",
      "angst": "2/10 roomate hated it so much that he said something along the lines of wishing he could go back in time and smash the first movie cameras ever made 💀     ",
      "paris-13th-district": "8/10 CIFF 2021: film #5 (57th chicago international film festival)  \"you got it wrong, camille. so did i. we both got it wrong\"  mon dieu! so pleased to be ending my virtual fest this year with such a dreamy knockout of a film. lush black and white photography intimately captures the complicated bonds the characters share and then scales back to show the city at large. the story takes turns i wasn't expecting and finishes on such a wonderful note, stirring...     ",
      "dune-2021": "8/10 love love love when a blockbuster is almost all methodical worldbuilding instead of pew pew space fighting filler like yes girl give us EVERYTHING     ",
      "broadcast-signal-intrusion": "5/10 CIFF 2021: film #4 (57th chicago international film festival)  \"do you really wanna be the guy to figure out what that means?\"  super enticing noir thriller from the jump but unfortunately loses a ton of steam as the plot gets more complicated. i had fun with this one but in the end i'm not really sure what it left me with     ",
      "great-freedom": "7/10 CIFF 2021: film #3 (57th chicago international film festival)  \"i've been on the run all my life\"  poignant in a way that never feels forced or false, and just vulnerable enough to let tenderness creep its way in. franz rogowski is mesmerizing as a man stuck in time, solidifying him as one of my favorite working actors. i can't remember the last time i saw such a good ending     ",
      "cow-2021": "5/10 CIFF 2021: film #2 (57th chicago international film festival)  \"is she that bad? as in, protective?\"\"she never used to be\"leave it to andrea arnold to use a beautiful cover of skinny love by bon iver to set the scene in a film like this. the overall tone is stark but not necessarily bleak as the cow in question goes along with her daily routines, arnold's camera trailing not far behind. i'm not sure enough here works for me as a whole feature, but i do want to nominate this cow for mother of the year     ",
      "bergman-island-2021": "7/10 CIFF 2021: film #1 (57th chicago international film festival)  \"can i tell you about what i'm writing?\"  beautiful both in its landscapes and layered ambiguity. the setting is perfect for the duel struggling artist story, (one of them struggling more than the other), as the lines between reality and fiction begin to blur. krieps, roth and wasikowska bring balance to the screen and together more than fill the shoes of ingmar himself while cycling around his island and in search of love, inspiration or both     ",
      "the-french-dispatch": "6/10 two things can be true: #1. this is very likely my least favorite wes anderson film so far, and #2. i still had a total blast as usual so i don't mind in the slightest     ",
      "three-colours-red": "8/10    the butterfly effect at it's most simplistically poetic. this whole thing feels a lot like amélie's somber older sister  also leave it to my girl irène to help an old person throw a bottle away fucking finally. AND THEY REALLY WERE ALL ON THE BOAT HUH. FUCK!     ",
      "the-last-duel-2021": "3/10 a grade school me too script that asks the question \"maybe we should... believe women?\" and then pats itself on the back just for asking the question. the irony that i was bored by the first two sections but liked where it was heading, and by the time jodie finally gets to shine the dialogue takes a sharp turn and the whole thing nosedives into the dirt. in the end i'm fine with this existing because it technically is a...     ",
      "lamb-2021": "3/10 this was so rough that i keep opening up this app to start a review and then i lock my phone and laugh     ",
      "titane": "7/10 the most fun i've had in theaters in so fucking long     ",
      "the-miseducation-of-cameron-post": "6/10 i still like this movie quite a lot, but after just finishing the book i definitely know which one i prefer. it was clearly a choice to center the story here completely on the conversion camp plotline, but unfortunately i found it to be the least engaging bigger element of the book. don't be shy, someone adapt it again 🤲     ",
      "free-guy": " definitely didn't skim this just to watch the jodie comer scenes... i would never stoop so low     ",
      "the-eyes-of-tammy-faye-2021": "6/10 i can't believe kacey musgraves wrote the song good wife about tammy faye     ",
      "singin-in-the-rain": "8/10 lina lamont kind of a girlboss?     ",
      "malignant-2021": "6/10 if you get it you get it if you don't you don't if you know you know... and if you don't know then i honestly feel bad for you     ",
      "clockwatchers": "9/10 captures a super specific mundanity and gnawing daily despair that i can't say i've seen portrayed like this in film before while also easily managing to be sharp as hell... life really is like that (working, and female friendships. ouch ouch ouch)     ",
      "the-night-house": "7/10 really love when a horror movie introduces outlandish complex storytelling that actually works in context and also holds back just the right amount to avoid spelling out all of those complexities to the audience... what a sexy fun concept     ",
      "honey-we-shrunk-ourselves": "4/10 the best one in the series yup     ",
      "the-suicide-squad": "6/10 this was fun enough but still feels misguided, like it's trying just as hard as the other one (the first one? i still don't know) to be edgy, but in a completely different and extreme direction. i guess they can't all be birds of prey  now please just give us a break and let margot make her gotham city sirens movie with harley and ivy already 🔪     ",
      "before-i-fall": "6/10 no idea what to think or feel about this but i will say that when the song skeletons by yeah yeah yeahs started playing i DID cry so hey! whatever     ",
      "the-unknown-girl": "8/10 ok i NEED adèle haenel to be my doctor     ",
      "tampopo": "7/10 the avengers of ramen noodles     ",
      "old-2021": "2/10 this felt like when you take an edible and it hits wrong     ",
      "escape-room-tournament-of-champions": "7/10 no it's true! it's true     ",
      "f9": "6/10 it's charlize in a box! it's charlize in a box babe     ",
      "fast-furious-presents-hobbs-shaw": "5/10 i'm sorry but vanessa kirby is just elizabeth debicki's evil twin     ",
      "black-widow-2021": "7/10 or the one where natasha romanoff finally gets to be a real character (also known as oomf in her pinocchio era)  this is about a decade too late but still managed to entertain me nonetheless, and maybe even more now that i have a year of pandemic and much needed distance from the mcu under my belt. i was never bored (which is rare for me with marvel), and while it doesn't feel wholly unique i didn't really mind this...     ",
      "summer-of-soul-or-when-the-revolution-could-not-be-televised": "8/10 absolutely magical     ",
      "the-forever-purge": "3/10 didn't like this movie!     ",
      "the-fate-of-the-furious": "8/10 surprisingly one of my favorites in the franchise, and unsurprisingly it has a lot to do with charlize theron and how much weight she easily brings to her character, instantly solidifying her as the best villain in the series so far. tonally this goes to some dark and overdramatic places but it's also the funniest with a shakespearean plot that kept me more invested than ever before. also i still love it when the cars go fast. no more big thoughts, only fast     ",
      "furious-7": "7/10 pure mayhem. this is the one where they're suddenly obsessed with flying and it's so ridiculous that it actually works. the transition from \"goofballs who drive cars really fast\" to \"world renowned secret agents now somehow\" is finally complete and it made me laugh during every action scene. james wan brings a new stylistic approach that was desperately needed and it really amplifies the tone. not a lot more i can actually compliment but i had a total blast and that's good enough for me, especially after SIX of these things. and the ending was so touching and bittersweet that i cried. that's familia!     ",
      "fast-furious-6": "5/10 to this one i offer a very polite \"no, but thank you!\"     ",
      "fast-five": "8/10 WILDLY entertaining and the first movie in the series to truly stand out. a clean heist film with cars going vroom vroom instead of cop shenanigans and needlessly confusing plots. almost every line from vin made me scream and the rock is SO sweaty and SO angry. it's clear by this point they finally found their footing and started embracing that slick over the top action while also weaving in the most poignant storyline yet, and as a result i...     ",
      "fast-furious": "4/10 too much furious, not enough fast!     ",
      "zoolander": "10/10 this turns 20 later this year, and even with a fair share of outdated jokes it's STILL withstood the test of time like the fucking stonehenge. THEY'RE BREAKDANCE FIGHTING!     ",
      "the-incredibly-true-adventure-of-two-girls-in-love": "7/10 \"well... unshelter me\"  in this moment i can't for the life of me recall a more singularly charming teen rom com, regardless of how low budget and silly it might be. really wish i had discovered this on accident while flipping through channels when i was younger but annoyingly could barely even find it this week when i finally sought it out. this is so so so so so so CUTE     ",
      "margaret": "9/10 a grueling but unexpected look at how trauma can inspire extreme waves of selflessness and selfishness. maybe it's about this, and many other things too, making clear philosophical arguments while also leaving so much room for interpretation that its trajectory is often skating on the edge of aimless discomfort. a coming of age story so crushingly intimate until it pulls back and reveals how insignificant coming of age actually is. often lisa is the focus of a scene but the...     ",
      "the-fast-and-the-furious-tokyo-drift": "4/10 don't know if you guys know this, but this one takes place in tokyo. and they don't just race... they drift     ",
      "2-fast-2-furious": "3/10 devon aoki in this movie... talk about a cultural reset     ",
      "bound": "9/10 a stylish erotic thriller with a killer plot and sensuality that's explosive without feeling exploitative? that's WHAT we've BEEN WAITING for! it's what we wanted all along! and jennifer tilly TOPS??? get outta town!!!     ",
      "the-fast-and-the-furious-2001": "6/10 this is camp. also: what have i gotten myself into     ",
      "the-daytrippers": "9/10 just discovered a moment ago that this was the debut film by the director of superbad. SUPERBAD! but in case that piece of information deters anyone, just know that i thought this was a great great little film and way more substantial than other films i've seen by him so far (yes, superbad included, how i love it so). nothing much to complain about here and a lot to enjoy, but worth noting for me is parker posey who i always...     ",
      "dykes-camera-action": "7/10 as a film itself this might not be as extensive as it could have been, or even emotionally impactful, but i still got plenty out of it regardless. after almost a decade of reading up on and watching lesbian cinema there weren't many surprises for me here but it was so insightful and comforting just to see these women discussing their own films and films they love, films they hate, and just films in general. i could easily watch like...     ",
      "undine-2020": "9/10 NYFF 2020: film #24  \"maybe my heart did skip a beat, but then it started beating again under your hand\"  every christian petzold i've seen has an otherworldly tension, and this is no exception. but this is a love story before anything else, and it shimmers with beauty and tragedy. i've been thinking about transit since the day i saw it and i can feel this already growing on me as well     ",
      "cruella": "6/10 totally unnecessary when i take a step back and remember that it's a fucking live action cruella de vil origin story but it's so much fun that i don't really care. emma stone rules and this is a pride month movie 🏳️‍🌈     ",
      "the-conjuring-the-devil-made-me-do-it": "4/10 the girlbossification of the conjuring series     ",
      "raising-helen": "7/10 my \"post wisdom tooth removal comfort movie marathon\" has taken an interesting turn     ",
      "sugar-spice": "8/10 it takes a galaxy brain to love this one... and luckily i contain multitudes or whatever     ",
      "drop-dead-gorgeous": "10/10 if you're reading this and you haven't yet seen drop dead gorgeous, please watch drop dead gorgeous. please.     ",
      "miss-congeniality": "8/10 no but seriously... all you need is a light jacket     ",
      "mare-of-easttown": " first 6 episodes: this is pretty good i guessfinale, approx. 30 minutes in: when did i start crying     ",
      "a-quiet-place-part-ii": "7/10 loved this sneak peak at the new last of us hbo series     ",
      "a-quiet-place-2018": "9/10 when the credits rolled i almost flat out SCREAMED because i was so full of anxiety and the anxiety stuck around for another 30 minutes anyways. THIS is how you fucking innovate. pay attention: because lately more often than not, horror is being reinvented right in front of our eyes     ",
      "a-woman-under-the-influence": "7/10 this hit too close to home in a way but i think that's where most of my investment in it came from? otherwise it felt unbalanced to me from scene to scene, i either wept or felt nothing at all. but i think that's just my opinion on this kind of a film rather than a testament of its quality. not sure cassavetes is for me lmao but only time will tell. (more thoughts can be found here in this week's random movie monday video)     ",
      "good-bye-lenin": "7/10 (watched and reviewed this as part of random movie monday, which is a new weekly video series thing i am trying out! whee!)     ",
      "oxygen-2021": "7/10 OH that third act reveal... mon dieu! (full review can be found here! merci)     ",
      "spiral-from-the-book-of-saw": "4/10 i mean... it's definitely the best saw movie in over a decade, i can tell you that much... (more thoughts in this video!)     ",
      "those-who-wish-me-dead": "5/10 could have used a lot more angelina and a lot less... everything else (actual review can be seen here)     ",
      "the-woman-in-the-window-2021": "3/10 amy please... is this a test of loyalty? because i don't know how much more i can take 😭 (btw my full review of the film is in this video!)     ",
      "twister": "7/10 thinking about this     ",
      "the-wizard-of-oz-1939": "8/10 the tin man is underrated and i think we should have that conversation     ",
      "scott-pilgrim-vs-the-world": "10/10 brie larson: hello, again, friend of a friend, i knew, you whe-me: https://youtu.be/b_lq5wORkYA     ",
      "through-a-glass-darkly": "8/10 \"reality burst open, and i tumbled out\"  didn't realize how much this affected me until i suddenly broke out in tears. one of the most potent bergmans i've endured yet     ",
      "13-going-on-30": "9/10    the philosophy of this is actually so fascinating and terrifying.... a 13 year old girl is seemingly thrown into a wormhole and when she comes out the other end she is 30 years old in an alternate universe, but she was also living and alive for all those years.... unconscious in her vessel, on bitchy autopilot..... and in the end goes back through the wormhole and ends up back in her original universe as her 13 year old self again,...     ",
      "nobody-2021": "6/10 gotta say that right after this was over i started to forget about it. i was expecting more comedy from the start, but as it reveals itself the comedy comes into play more naturally while the action kicks up, and by the end i had plenty of fun. honestly i was just excited to be back in my favorite seat in my favorite house of my favorite theater again, regardless of the movie     ",
      "gone-girl": "10/10 after re-watching for a 3rd time i can (still) safely say, without a doubt, that gone girl is one of my favorite films of the year, decade, and of all time.     ",
      "amelie": "10/10 shout out to this movie for making me feel like i got sucker punched right in my literal human heart every single time i watch it, but in a very sweet and aesthetically pleasing way with like... upbeat accordions and shit playing in the background     ",
      "nomadland": "9/10 NYFF 2020: film #12  \"you take care of yourself\"  made with care and so much empathy. every frame is bittersweet and full of tenderness, touching on something hidden deep within the human spirit: the desire to keep moving as a way of survival. i have to comment on the score, which is sparse but moved me to tears every time it made an appearance, gently crashing in emotional waves. this is brilliantly directed by chloé zhao and universal in the...     ",
      "quo-vadis-aida": "8/10 astoundingly tense and twice as heartbreaking by the time it ends. sorry to this man (another round) but i really want this to win the oscar     ",
      "news-of-the-world": "6/10 more than anything this reminded me that i still need to finish red dead redemption 2     ",
      "sound-of-metal": "9/10 AFI 2020: film #5  \"today is not a good day\"  one of the most devastating parts of life is not being able to get back to a happiness you once had, especially if it involves people you love. feeling that joy slipping through your fingers, time cannot rewind and only moves forward, and without your consent. relentlessly, painfully. adapt or die. this is a crushing look at that fight against time and change, but it's also hopeful, and eventually peaceful. the sound design was incredible and the hardcoded subtitles were such a smart move. one of the most essential and fitting movies of 2020     ",
      "judas-and-the-black-messiah": "8/10 SUNDANCE 2021: film #25  \"takes a thief to catch a thief\"  SO well made. the performances here are on another level and all merit mentioning but i think my favorite was dominique fishback who brings both vulnerability and strength to the role. my money is on daniel for the oscar     ",
      "the-trial-of-the-chicago-7": "5/10 best picture marathon: film #5  \"i've never been on trial for my thoughts before\"  the biggest piece of oscar bait in the bunch, but i was expecting that all along. it has its moments of triumph when the music swells and i'm momentarily won over, but otherwise this is just too much courtroom and isn't worth the runtime. sorkin scripts are usually overwhelming at times but this one is especially wordy and feels needlessly distracting, like we get it, you're...     ",
      "promising-young-woman": "4/10 the outer layer is a bright candy coated shell, but peeling that back reveals the inside as hollow. i don't have negative feelings about the ending (or the film as a whole) the way some do, actually i enjoyed it until it was almost over. but then the bad taste it left behind immediately started creeping in. as a complete picture it just feels like a bunch of gotcha moments that lack a certain kind of empathy for the subject...     ",
      "mank": "6/10 .....jeepers  (actual review to be written upon rewatch)     ",
      "minari": "9/10 \"i'll take care of us\"  the 2020 film version of the 🥺 emoji. this is so special     ",
      "the-father-2020": "7/10 AFI 2020: film #11  \"what about me? who exactly am i?\"  feels like still alice infused with charlie kaufman, where time is skipped and looped and often a terrifyingly immersive look into the protagonist's psyche. definitely more creative than the oscar bait i was expecting, but still performance driven and quite heartbreaking     ",
      "the-united-states-vs-billie-holiday": "3/10 completely disjointed, starting with the script and only getting worse from there. the only highlight is andra day who manages to shine like a beacon of light through this murky mess of a film. i thought people were exaggerating, but no, this is rough     ",
      "my-octopus-teacher": "6/10 loved the part where the octopus taught him E = mc2     ",
      "feeling-through": " super heartwarming stuff, and very deservingly snagged an oscar nom. if you have 20 minutes to spare consider checking it out!     ",
      "girltrash-all-night-long": "4/10 rip to sappho, she would have loved girltrash: all night long     ",
      "ma-raineys-black-bottom": "6/10 theater to film adaptations have never really been for me but what i know for sure is that viola and chadwick are absolutely sensational here, truly two of the best performances of the year that i'd be so excited to see honored at the oscars     ",
      "another-round": "7/10 FINALLY they made a feature length film starring mads mikkelsen based on glee season 2 episode 14 \"blame it on the alcohol\"     ",
      "hillbilly-elegy": "1/10 this has to be a joke     ",
      "drive-2011": "10/10 he drive so good     ",
      "score-a-film-music-documentary": "9/10 cinematically speaking, this isn't as well put together as it could have been, but the subject matter here is so fascinating that i could care less. the bits of insight into the scoring of movies like the social network, american beauty and inception were particularly gratifying. and the whole john williams portion is magical. it takes so many different elements to make a film, i would eventually love to see a documentary about every branch and process     ",
      "bridesmaids": "10/10 STOVE, what a kinda name is that. ARE YOU AN APPLIANCE?     ",
      "legally-blonde": "10/10 friend: so what do you wanna watc-me, remote in hand: 👀friend: wait...television, full volume: SUN'S UP     ",
      "zack-snyders-justice-league": "8/10 the interesting thing about snyder is that he always swings big: whether it results in a colossal whiff or a home run just depends on the particular project, amount of creative control, and audience reception. but he always puts his unique style into it, and for that reason i've really grown fond of his stuff. his involvement in the dceu has kept me interested, and i still have fun with both their best content or biggest flops. too often nowadays...     ",
      "justice-league": "6/10 78.media.tumblr.com/47d31699cc1cb72a4f6aeae8411bb6a6/tumblr_inline_oiphe28J8n1rsve3t_400.gif     ",
      "birds-of-prey-and-the-fantabulous-emancipation-of-one-harley-quinn": "10/10 WE WON     ",
      "suicide-squad-2016": "5/10 i wish harley quinn was real so she could bash my brains in with that baseball bat     ",
      "dead-pigs": "8/10 layered, surprising and funny as hell. cathy yan is the real deal     ",
      "superbad": "9/10 that's the coolest fucking story i've ever heard in my entire life! that's insane! is it... can i hear it again? do you have time?     ",
      "synecdoche-new-york": "10/10 when you watch something that's so insane and fucks you up so badly that you don't know what you're feeling but you cry for the entire last 10 minutes anyways and then it takes another 5 minutes to compose yourself enough to even log the fucking movie on letterboxd     ",
      "wandavision": " ?     ",
      "intolerable-cruelty": "6/10 oh to be rich and fall in love. oh to have just one of those two things without also having the other     ",
      "euphoria-fck-anyone-whos-not-a-sea-blob": " the double life of veronique theme song needle drop??? i feel so alive     ",
      "i-care-a-lot": "8/10 alluringly vile. reminds me so much of bad education in all the best and most interesting ways     ",
      "game-night": "7/10 the delivery of \"OH NO HE DIED\"... maybe rachel's oscar nomination got lost in the mail     ",
      "grosse-pointe-blank": "7/10 a rom-com for dads     ",
      "about-time": "7/10 the existential crisis this is currently putting me through 😭     ",
      "barb-star-go-to-vista-del-mar": "8/10 and i mean this in the most positive and affectionate way possible: what. the fuck     ",
      "framing-britney-spears": " \"leave britney alone\" might be the three smartest words in the english language     ",
      "la-la-land": "10/10 this single handedly reinvented musicals, singing, dancing, cinematography, comedy, seasons of the year, the piano, every color on the entire color spectrum, romance, jazz and pure joy  also: 1. in the middle of the ending the projector messed up and so they played it back and i got to cry over that spectacular ending twice in a row, and 2. i met damien chazelle!     ",
      "malcolm-marie": "5/10 comes off as something intriguing but soon enough the script makes it crystal clear that it's written by a nepotism baby with a god complex, and that element alone completely took me out way too often. zendaya and john sold the SHIT out of this, but with sam at the helm i wasn't looking to buy what it was selling in the first place     ",
      "enola-holmes": "4/10 i think i am a... what do they call it? um... a flat? i think they call it a flat earther! anyway.... yeah. 🎶 are we riding... say you'll never ever leave from beside me 🎶      ",
      "the-world-to-come": "6/10 SUNDANCE 2021: film #33  \"there is something going on between us that i cannot unravel\"  oh lord. this is poetic in a way but also reads like a horror movie. the chemistry between katherine and vanessa is real but it rarely gets a chance to shine, most of the narrative focuses on how sad and mundane daily life is and what a bummer it is that their lame husbands drag them down. it is what it is but just doesn't...     ",
      "misha-and-the-wolves": "6/10 SUNDANCE 2021: film #31  \"what else might not be true?\"  giving this a modest 3 stars, because while i was fully engaged the whole time i doubt i'll ever return to it again. not as shocking as other twisty docs i've seen but an intriguing story for sure, i recommend it if you know nothing about the story and love this kind of documentary style     ",
      "jockey-2021": "4/10 SUNDANCE 2021: film #30\"i feel like i robbed myself of something wonderful\"   very much a Horse movie but through an indie lens, and if i cared more about that specific combination of things i probably would have really liked it. some gorgeous shots of the sunset and a few thrilling races, but besides that... eh. i'm good     ",
      "hive-2021": "5/10 SUNDANCE 2021: film #29  \"you made a mistake\"  intimate and compact. the performances are grounded and the score is wonderful, but it doesn't go much beyond that for me     ",
      "the-blazing-world-2021": "2/10 SUNDANCE 2021: film #28  \"the only way out is in\"  coraline for girls with trust funds. thinks it's suspiria but feels more like the rugrats all grown up version of that mary kate and ashley movie double double toil and trouble. glossy and ambitious as hell but often can't find any clarity because of it, and the aesthetics are rad but they don't amount to anything at all underneath surface level. also it took about fifteen minutes for me to decide that this girl looks exactly like 50% kate mara and 50% alison lohman     ",
      "were-all-going-to-the-worlds-fair": " SUNDANCE 2021: film #27  \"i don't know what to expect\"  not my vibe at all unfortunately. i like the bones of this but not how it constructs itself, and i found it harder to pay attention the longer it went on. i really admire a lot of what's going on but couldn't grasp onto anything tangible     ",
      "try-harder-2021": "7/10 SUNDANCE 2021: film #26  \"there's no formula for success anymore\"  a breezy and delightful watch, this was especially fascinating to me because i was homeschooled for high school and missed out on the typical stress of college applications. and the last scene is so joyful, it has to be one of my favorite endings of the festival     ",
      "life-in-a-day-2020-2021": "6/10 SUNDANCE 2021: film #24  \"isn't that enough?\"  wanted to check this out for the editing and that didn't disappoint. for something like this it's all about the art of the edit, because good montage editing can convey love, hate, joy, despair and humanity itself, tying themes together to spark emotion. and those sequences did often give me goosebumps, but otherwise i wasn't as invested in this or moved by it like some will be. i would love to edit something as ambitious as this one day     ",
      "wild-indian": "7/10 SUNDANCE 2021: film #23  \"i want him to be normal. and good\"carefully deals with abuse and regret with empathy. it's a bleak watch but made with confidence, i wish the last act was as strong as the build up but it was still rewarding. i can feel this one haunting me already     ",
      "prime-time-2021": "8/10 SUNDANCE 2021: film #22  \"let's offer entertainment to people! the viewers are waiting!\"  oh yeah, i dug this. i love love love films that make smart use of confined spaces and keep developing the plot in interesting ways, and this did just that. it's not as exciting as you might think but that works for me, instead delving a bit into individuality vs commercialism but usually keeping a more intimate closer eye on the present moment. it just earns a 4 because bartosz is so fucking good     ",
      "violation-2020": "7/10 SUNDANCE 2021: film #21  \"it's empowering knowing you don't need anyone to look after you\"  visceral and methodical and very lars von trier, this packs a punch like i haven't seen in a while. it kind of drags a bit when dialogue is concerned and overstays its welcome, but the gruesome and almost unwatchable gore demanded my full attention. i think the biggest reason this works for me is the realism in actually seeking revenge and the fear (or reality) of not even reaching catharsis afterwards. it also served as a nice reminder that i really need to rewatch revenge (2017)     ",
      "prisoners-of-the-ghostland": "6/10 SUNDANCE 2021: film #20  \"i got one day to tear this shit apart!\"  20 films into the fest and my brain feels like jelly. this was cool as hell in overall concept but doesn't seem to do enough with it. missed opportunities aside, the action was a blast when it came around, most of all the ending. unhinged nicolas and sofia though... i didn't need much more from this to begin with     ",
      "land-2021": "5/10 SUNDANCE 2021: film #19  \"thank you. thank you\"  we've seen this story many times, and yet this still often manages to be a calm exercise in patience, and sometimes momentarily even reaches tranquility. robin is about as good a director here as she is an actor (i'll let you decide if that's a good thing or a bad thing), but even her skills can't fully save this from the mundanity of it all. the bond her character makes with a...     ",
      "mayday-2021": "6/10 SUNDANCE 2021: film #18  \"it wasn't a very good story. so i'm giving you a new one\"  this was so frustrating for me. a girlboss daydream in the vein of sucker punch and alice in wonderland, but not as wild as the former and not as dreamy as the latter. the first act was really alluring, the vaguely simplistic world building and lack of explanation works in its favor, but eventually that becomes its downfall. so basically: it totally lacks...     ",
      "marvelous-and-the-black-hole": "7/10 SUNDANCE 2021: film #17  \"sammy... try again\"  a much needed respite from the more intense kind of films i've been marathoning. light and familiar but full of optimistic wisdom, none of the concepts are quite new but feel fresh and deliver on charm. this gave me exactly what i hoped it would     ",
      "mass-2021": "8/10 SUNDANCE 2021: film #16  \"you say you wanna heal, we all do... is this how?\"  completely performance driven in the best sense. i was never too overwhelmed with emotion but there's so much potency in the script that it still shines through, especially because of ann and martha. grief is never easy to translate into something tangible or understandable, but this does an incredible job of bringing it to life in a way that shows empathy and perspective to everyone involved. a heavy experience for sure     ",
      "coming-home-in-the-dark": "7/10 SUNDANCE 2021: film #15  \"just a happy coincidence\"  damn... this was brutal: super well executed but hard to stomach, and so effective that if i close my eyes i can almost hear the audience exhaling in unison when it cuts to black     ",
      "the-cursed-2021": "6/10 SUNDANCE 2021: film #14  \"you and your people are being hunted\"  i was pretty into this for what it was. somewhat gritty with a clear story and the effects are very decent (one scene in particular had an alien moment and it was sick), but (you know i always have to hit you with the but), it was about 30 minutes too long and the third act started to lose me. i think my dad would get a kick out of this though and i would still prefer it over goofy mainstream movies in the same sub-genre     ",
      "in-the-earth": "2/10 SUNDANCE 2021: film #13  \"everything seems to keep us here\"  oh this did absolutely noooooooothing for me. the plot was impossible to get into or follow along with and the stakes never felt very high. it had some occasional cool shit going on but i still didn't care that much, and all the scenes in between were just dull. think annihilation, but make it pointless. bummer     ",
      "how-it-ends-2021": "4/10 SUNDANCE 2021: film #12  \"the only assignment is death!\"  this is like... not good. i needed something to watch while i ate the food i had delivered (it was chick fil a :/) and it was perfect for that but not actually a good movie otherwise. it operates more like a social experiment thinly disguised as a movie, a bunch of weird comedy bits drenched in some casual existential dread but that's definitely the point so it's chill. WOW it's...     ",
      "passing-2021": "7/10 SUNDANCE 2021: film #11  \"things aren't always what they seem\"  i was totally convinced that i loved this until it ended and i actually started weighing it properly. it begins so strong but as it becomes more introspective the narrative in turn got a bit lost. that's not a bad thing, there are a lot of things worked into the script that work really well as separate pieces and conversations until they start to dissolve together (for better or for...     ",
      "human-factors-2021": "6/10 SUNDANCE 2021: film #10  \"we were just unlucky this time\"  less of a thriller and more of a drama about family dynamics with an occasional thrilling edge to it. moments of tension would grab my attention and reminded me a bit of force majeure, but then the tone would dip back down and i'd lose interest for a while. still pretty solid, just not exactly what i was expecting     ",
      "street-gang-how-we-got-to-sesame-street": "7/10 SUNDANCE 2021: film #9  \"we're trying to sell the alphabet to preschool children\"  i laughed, i cried, i learned, and what more could i possibly want from a documentary about puppets?     ",
      "flee-2021": "8/10 SUNDANCE 2021: film #8  \"i have no one. i'm all alone\"  devastatingly tender and completely singular, this was clearly made with a lot of care and it shows. the animation is beautiful but it never overpowers the story, instead the two intertwine and flow together to create a moving final product. i really recommend this one, i almost missed it myself     ",
      "knocking-2021": "7/10 SUNDANCE 2021: film #7  \"someone needs help. i think someone needs our help\"  knocking (ha ha) off half a star for giving in a bit too much to the mental illness trope, but otherwise i was totally captivated by this. it's a tight story that reminded me a bit of the guilty (it's 2am so i can't pinpoint why, just the intensity i guess?), the camerawork is fresh and it plays up the psychological horror until it spills over into despair. but that works, and the ending does too. this was a nice surprise (especially because it was my FIFTH movie of the day. whew)     ",
      "on-the-count-of-three": "8/10 SUNDANCE 2021: film #6  \"stop standing in your own fucking way\"  i'm giving out a lotta 4 star ratings recently but in my defense i'm just following my heart. honestly this was an impressive directorial debut: it's sharp and to the point, tackles a lot of difficult subjects that are usually hard to translate on screen and the humor still almost always lands (at least for me). that being said, it sometimes stalls out and even veers off course, but...     ",
      "john-and-the-hole": "7/10 SUNDANCE 2021: film #5  \"this is your life. you get to make your own decisions now\"holy shit. this was like home alone reimagined by yorgos lanthimos with some haneke thrown in, and believe it or not i drafted that sentence before the q&a moderator said almost exactly that. it's minimal and maybe even pretentious in a way that some people will despise, but (at least initially) i really fucking dug that. this one is going to spark a lot of fun conversations     ",
      "i-was-a-simple-man": "5/10 SUNDANCE 2021: film #4  \"dying isn't simple, is it?\"  it might just be my mood but this was too vaguely  cerebral for me to align with its rhythm and ended up feeling a too long as a result. i really appreciate what i saw in this: it's gorgeously shot with some wonderfully tender moments throughout, but besides that i never really felt connected to it. (and yes, constance wu is amazing as per usual, this being the most thoughtful performance i've seen from her yet)     ",
      "homeroom": "6/10 SUNDANCE 2021: film #3  \"at this moment i really don't know what's going to happen. there's no way you can cope, you just go on with it\"  a film that rests solely on the shoulders of a group of high school seniors, and they carry it with bold perseverance. the school year begins with high energy and ambition, then slowly morphs into an intimate look at some of the most challenging months in recent years. because of the shift it...     ",
      "censor-2021": "5/10 SUNDANCE 2021: film #2  \"you'd be surprised what the human brain can edit out when it can't handle the truth\"  i had enough fun with this but it's already losing steam the more i think about it. feels like the kind of midnight movie i'd see with friends and when exiting the theater we'd glance at each other as if to say \"was that worth it? at this hour?\" but none of us want to admit that it wasn't. it's...     ",
      "coda-2021": "8/10 SUNDANCE 2021: film #1  \"i'm happy that you know who you are\"  what a nice way to start this festival: i can't imagine a more pleasantly accessible way to frame a film like this. it keeps a down to earth handle on the complex subject matter with respect and self awareness while also maintaining a light touch when it comes to the genre it occupies. it's not perfect but was surprisingly comfortable, very warm and funny and enjoyable to watch....     ",
      "50-first-dates": "9/10 excited to announce the long awaited addition of 50 first dates into the rom-com hall of fame... everyone clap     ",
      "host-2020": "8/10 \"nothing is gonna happen\"  so fucking glad i didn't watch this over zoom. much more effective than the first unfriended movie even though the budget is likely much smaller. timely and terrifying     ",
      "cruel-intentions": "9/10 \"everybody does it, it's just that nobody talks about it\"  the perfect teen melodrama, and one of the best movie soundtracks of the 90's. now THAT was a classic     ",
      "dead-poets-society": "8/10 hmm... i feel very... what's the word... crushed 🥺     ",
      "clueless": "10/10 she's got a point, she's an icon, she's a legend and she IS the moment. now come on now     ",
      "thelma-louise": "9/10 this was a little TOO good... how did they do that     ",
      "some-kind-of-heaven": "7/10 both comforting and unsettling in equal measure, and gorgeously shot so those feelings were amplified even more. i didn't know much about this strange florida community until checking this out and it packs a lot of interesting information in while thankfully staying super personable instead of overwhelming and cold. the last act slowed down a bit too much for me, but the ending definitely made up for it     ",
      "holiday": "8/10 me and my ladies back in the day strolling to the cinema to see the new katharine hepburn picture: let's go lesbians let's go     ",
      "pretend-its-a-city": " oh to be funny and grumpy for a living     ",
      "whiplash-2014": "9/10 my heart was in my throat the entire movie... until the final act when it fell out of my ass     ",
      "the-social-network": "10/10 if i had a dollar for every time i've affectionately thought about this movie in the last year alone, i could buy mount auburn street take the phoenix club and turn it into my ping pong room     ",
      "soul-2020": "7/10 at one point the electronic score kicked in again and i jokingly said \"ok! this sounds like the girl with the dragon tattoo\" BUT IT ACTUALLY WAS TRENT AND ATTICUS? I WAS JUST KIDDING 😭     ",
      "youve-got-mail": "7/10 well damn! i wish i had mail 😭     ",
      "sleepless-in-seattle": "8/10 being awake all night long in the winter while wearing sweatshirts and sweatpants and big cozy socks to do absolutely nothing but YEARN? this GETS me     ",
      "the-lord-of-the-rings-the-return-of-the-king": "10/10 [fleabag voice] this is a love story     ",
      "the-lord-of-the-rings-the-two-towers": "9/10    when the fucking ents take an entire day to have one short conversation with each other but the SECOND treebeard sees what nonsense saruman has done he just SHOUTS and those ents ZOOPED into isengard SO FAST and just start BUSTING SKULLS..... and the fact that saruman thought he was hot shit and then his entire scheme was destroyed by some SUPER OLD PISSED OFF TREES... ICONIC     ",
      "the-lord-of-the-rings-the-fellowship-of-the-ring": "9/10 what's better than this, guys bein dudes     ",
      "wild-strawberries": "8/10 i thought this was going to be a bit more cheerful (wishful thinking, in my defense i was trying to sell it to my dad) but should have known better because this was almost all melancholy. that really sums up the year though, doesn't it     ",
      "multiple-maniacs": "7/10 ...WELL!     ",
      "house": "9/10 i might be kinda drunk right now but honestly i think that only made this better     ",
      "wonder-woman-1984": "4/10 ...at least the posters are nice     ",
      "the-family-stone": "7/10 rachel mcadams is so cute and mean while she wears a dinosaur jr shirt and carries an npr tote... merry christmas to ME!     ",
      "home-alone-2-lost-in-new-york": "8/10 2 Home 2 Alone: He's Even More Aloner This Time     ",
      "happiest-season": "9/10 this was one of the most joyous experiences i've had all year and no i'm not joking in the slightest     ",
      "black-christmas": "8/10 now how am i supposed to go to sleep after THIS 😭     ",
      "home-alone": "9/10 a small child and a duo of criminals attempt to brutally murder each other. hilarity ensues     ",
      "one-night-in-miami": "7/10 \"this is one strange fuckin' night\"  took me a little while to fully jump on board with its style of storytelling, but the group dynamics really pulled me in. especially impressive is each duo and how they interact when isolated from the rest. having an awards season convention without these brilliant performances just isn't feasible     ",
      "freaky": "6/10 unfortunately i'll now be thinking about the \"clam jam\" line for as long as i live, thanks!     ",
      "the-queens-gambit": " anya taylor-joy single-handedly making chess cool and sexy... everyone say thank you     ",
      "saint-maud": "9/10 \"nothing worthwhile comes easily\"  my jaw dropped at least a dozen times. ALL HAIL     ",
      "black-bear": "7/10 \"i've been lying since the second i got here\"  i'm so fascinated with this, but right now that fascination is all i know for sure. this is layered in such a particular way that makes me feel in this moment like i'm missing something that'll click into place naturally with time. i'm hoping that's the case, because the potential is all there, i just have to think on it. and honestly, it's good i need time to process because i...     ",
      "palm-springs-2020": "7/10 time loop excellence. this would pair really well with happy death day     ",
      "ordinary-love": "7/10 \"but we're all just really... just on our own\"  uncommonly lovely, which is even more impressive considering the subject matter is so bleak. this was genuine from the first moment to the last, and i felt it in every moment in between     ",
      "shithouse": "6/10 when the sad boy said \"and i really think you're the best actor of all time\" to dylan gelula... he was so right     ",
      "sorry-we-missed-you": "8/10 \"maybe your best isn't good enough, is it?\"  absolutely crushing and achingly real. there are moments of true tenderness here surrounded by a lot of daily sorrow, but the balance is still just right. i would definitely call this a must see of the year, but have a box of tissues on hand just in case     ",
      "booksmart": "9/10 billie lourd showing up every 10 minutes to spout some absolute nonsense... i don't know a better comedic performance. i don't KNOW a better comedic performance     ",
      "the-high-note": "6/10 dakota johnson, just in case you're reading this, please know that i would give it all up for you. i would buy so many limes just to make you happy     ",
      "ammonite": "4/10 i've spent many hours of my life seeking out stories like this. not all of them are (or have to be) love stories, but even when love isn't the main focus there's still one element that every good film needs: chemistry. and ammonite has none. that isn't the only thing lacking here, but it's the most glaring reason why this never clicked for me. i sometimes give the benefit of the doubt to some of the worst films i've seen...     ",
      "ever-after-1998": "9/10 i cried during the entire second half of this... while playing uno with my family     ",
      "rising-phoenix": "8/10 the paralympics kind of ate up the olympics... i'm sold     ",
      "run-2020": "8/10 in today's world this feels like a familiar story, echoing both fiction like sharp objects and real stories like gypsy rose blanchard, but that familiarity doesn't make it any less potent here. i was skeptical, not wanting to indulge this worn out plot that seemingly exists only to mystify and thrill able bodied audiences. but i'm excited to say that's not exactly what i found in this case  my first discovery here was that newcomer kiera allen acts circles around...     ",
      "black-mirror-shut-up-and-dance": " oh NO.....     ",
      "charlies-angels-full-throttle": "10/10 this is the greatest movie ever made and i would die for it     ",
      "charlies-angels": "9/10 it seems a little bit iconic to me     ",
      "apollo-13": "7/10 in space no one can hear you pee     ",
      "poltergeist": "7/10    ya sonofabitch ya MOVED the cemetery but ya left the bodies DIDN'T cha! ya sonofabitch ya left the bodies and ya only moved the headstooooooones! YA ONLY MOVED THE HEADSTOOOOOONES!!! WHYYYYYYY?! WHYYYYYYYYYYYY?!?     ",
      "dont-breathe-2016": "10/10 I REALLY DIDN'T BREATHE ONCE THE ENTIRE TIME     ",
      "insidious": "9/10 i love to revisit this movie, it's still a modern horror masterpiece in my eyes     ",
      "the-cabin-in-the-woods": "8/10 the evil is defeated 🤲🐸     ",
      "over-the-garden-wall-2014": "9/10 SO WE CAME HERE TO BURGLE YOUR TURTS     ",
      "totally-under-control": "7/10 no like... i really wanna burst into tears LMAOOOOO     ",
      "circle-2015": "8/10 unfortunately perfect election season viewing     ",
      "i-know-what-you-did-last-summer": "7/10 we already committed murder we might as well rob his ass!     ",
      "hocus-pocus": "8/10 TIS FIRM     ",
      "sleepaway-camp": "6/10 angela is like that's me 🙋🏻‍♀️ i don't have shit to say to anyone lol     ",
      "debs": "10/10 i owe it to my community to give this the rating it deserves     ",
      "imagine-me-you": "8/10 stumbling upon this for the first time as a teenager was like oh? and then revisiting it a few years later was like ...OH     ",
      "lost-and-delirious": "4/10 i just know piper perabo did imagine me & you as a way of apologizing for this painful shakespearean shit 😭     ",
      "the-hole-2001": "7/10 yes it's true, i have a new submission to the She Did That hall of fame     ",
      "wildland": "8/10 AFI 2020: film #16  \"but for some people things go wrong before they even begin\"  finished the fest with less films than planned but glad to be ending on this, bleak as it is. a subtle examination of complex family dynamics, the loyalty we're born with even when it's not familiar, even when it's wrong. i was always invested in it here, the push and pull of the family business intertwined with their personal lives and driving their every move,...     ",
      "borat-subsequent-moviefilm": "5/10 when laura dern facetimes into the academy awards livestream on april 25th, removing her mask to tenderly announce \"and the oscar goes to... jeanise jones in borat 2\"     ",
      "film:603121": "7/10 AFI 2020: film #15  \"this? is for me\"  makes quick work of the breezy runtime it has to offer, our protagonist growing more with every passing minute. a lot of this is captivating (the dancing!!!) but the dynamics between the girls is most intriguing to me, a tightrope of generosity, selfishness and sometimes even borderline cruelty. it's a harsh world and they can only be so kind, even if they want to, even if they sometimes try. by the final shot it feels right, however melancholy it may be, reminding me that not all coming of age stories have a storybook ending     ",
      "apples": "7/10 AFI 2020: film #14  \"a lot of people have forgotten\"  i thought i was ready for whatever this threw at me, but somehow wasn't expecting a subtle character study. it feels like a yorgos, but with a much lighter touch, more reminiscent of alps than anything else. i was fully engaged with it all, but it still didn't give me enough, ending as simply as it began. i dig this concept more than i love the outcome  (i do have...     ",
      "fireball-visitors-from-darker-worlds": "6/10 AFI 2020: film #13  \"so, yeah. we're all stardust\"  thought provoking and miraculous, though a little too slow for my taste in docs. one of the biggest takeaways is learning just how much werner herzog loves the movie deep impact     ",
      "out-of-the-blue": "6/10 AFI 2020: film #12  \"it's my life, i can do what i want with it\"  throwing in a restored revival to spice up the fest. linda manz was incredible here, her performance both fearless and poignant. i just wish it had been centered fully on her instead of her parents, but her scenes alone and in the city are magical. i can't stop thinking about the final line of dialogue     ",
      "wolfwalkers": "8/10 AFI 2020: film #10  \"there's two of us now\"  absolutely delightful. some of the plot points can easily be guessed just like most family films, but the animation is gorgeous and the loving warmth radiates off every frame like the sun     ",
      "sleep-2020": "5/10 CIFF 2020: film #2  \"you know when you wake up and your dream is still there?\"  i was very on board with this for about the first half, and then it kinda stalls out. with more clarity i might have liked it a lot more, but i get what it was going for     ",
      "the-columnist": "8/10 CIFF 2020: film #1  \"you know what? it isn't hard to be kind\"  oh this was FUN and probably the best portrayal of social media paranoia (and anger) that i've seen. i feel like i say this a lot now but i'm gonna say it again, this would have been a blast with a festival audience     ",
      "shadow-in-the-cloud": "1/10 AFI 2020: film #9  \"you have no idea how far i'll go\"  yeah just kidding i can't actually review this hfkshfksh     ",
      "there-is-no-evil": "8/10 AFI 2020: film #8  \"your power is in saying no\"  had to wait for the right mood to attempt this, and that decision really paid off. every one of the four short stories here are told slowly, but fiercely. after the first reveal (a particularly brutal - but brilliant - choice of editing) i was hanging on every word. each tale has stronger storytelling than most feature films i encounter, and the themes that weave them together are chilling and universal     ",
      "jumbo-2020": "7/10 AFI 2020: film #7  \"he just makes me happy. that's all\"  a film about the brunette from portrait falling in love with a fun fair ride is the first of the fest to make me cry. beautifully shot and convincingly emotional, sometimes this runs a little off the rails but i stayed with it. and viewing it as a metaphor for homosexuality makes it even better     ",
      "pink-skies-ahead": "3/10 AFI 2020: film #6  \"oh my god, i haven't seen you since 12th grade, how are you?\"\"well i'm in this panic disorder group so... not good\"  it brings me no joy to write these words, but this was distractingly bad. every other line of dialogue is jarring and out of place as it lunges awkwardly back and forth from a slapstick comedy to a melodramatic personal piece. the lead character is a mix between lady bird and enid from...     ",
      "76-days": "7/10 AFI 2020: film #4  \"let's not panic, ok?\"  perhaps too potent a viewing in 2020, but expertly made and often so emotional. the bare essence of this is people taking care of people, and that sole theme makes this feel almost comforting despite all the trauma     ",
      "the-intruder-2020": "5/10 AFI 2020: film #3  \"there's room for both of us\"  this would be at its most effective during some kind of midnight festival screening, but without that fun boost of energy it falls flat. i appreciate the artful horror ingenuity but... this just didn't work for me by the end     ",
      "whirlybird": "8/10 AFI 2020: film #2  \"people are voyeurs. they are fascinated with violence\"  both a large scale whirlwind action piece about breaking news coverage in LA, and an intimate look at family, identity and even abuse. this finds an interesting balance between the worlds and blends them together seamlessly, but the outcome might be a little darker than i anticipated     ",
      "nine-days": "5/10 AFI 2020: film #1  \"don't be sorry. you're good\"  cerebral in a way that doesn't always land but still manages to feel authentic. the premise is overlong for how simplistic it really is, and unfortunately didn't do anything for me emotionally (which is a lot of what it hinges on)     ",
      "black-mirror-san-junipero": " i was just about to start bly manor but then decided to exercise some self care instead ❤️     ",
      "the-haunting-2018": " my very scientific ranking of the siblings:  1. theo: such a baddie with her little gloves. yes queen. ★★★★★ stars2. nell: has done nothing wrong ever in her life. ★★★★½ stars3. luke: baby. the glasses! ★★★★ stars4. shirley: i wouldn't take the blood money either girl. ★★★★ stars 5. steve: crain. ★ star     ",
      "stick-it": "9/10 holds the bronze 🥉 metal in my Movies That Made Me Gay list     ",
      "world-of-tomorrow-episode-three-the-absent-destinations-of-david-prime": "10/10 \"i confess that i sometimes look forward to drowning together when i turn out the light\"     ",
      "bring-it-on": "10/10 i'm sexy 😘 i'm cute 😌 i'm popular to boot 👢 i'm bitchin' 😝 great hair 💁‍♀️ the boys all love to stare 👁 i'm wanted ❤️ i'm hot 🔥 i'm everything you're not ✋ i'm pretty 👄 i'm cool ❄️ i dominate the school 📚 who am i? 👀  just guess 🤔 guys wanna touch my chest 😋 i'm rockin' 🎸 i smile 😁 and many think i'm vile 🤬 i'm flyin' ✈️ i jump 🙆‍♀️ you can look...     ",
      "a-walk-to-remember": "7/10    and once again i am channeling the energy i had at 9 years old when i would finish rewatching this and immediately pop the cd soundtrack in my boombox to lay down and sob into my ugly green bedroom carpet about mandy moore's fake leukemia     ",
      "the-faculty": "8/10 starting to realize that my favorite genre might actually be shitty 90's teen movies... and i'm not hiding it anymore!     ",
      "dark-places-2015": "2/10 do you ever click play on something and think \"it can't be THAT bad\" well actually yes it can 😭     ",
      "french-exit-2020": "8/10 NYFF 2020: film #23  \"but why would you want it cold?\"\"that's the mystery\"  charming in a way that (thankfully) strays away from being repetitive for the most part, with a wry script that's often as touching as it is funny. an odd cast of characters slowly joins the mother and son duo until their small parisian apartment becames chaotic in the calmest sense, supernatural elements occasionally entering the picture matter-of-facty as if to break the fourth wall and say...     ",
      "jigsaw-2017": "5/10 GARBAGE, but MY garbage     ",
      "saw-3d": "5/10 overall this movie is absolutely horrible and definitely the worst one of the series, but at the same time i still have no fucking idea what to rate it because the ending is fucking LEGENDARY AND I LOVE THIS NASTY FRANCHISE SO MUCH THAT I ORIGINALLY SAW THIS AT MIDNIGHT WHEN I WAS 16 AND EVEN GOT A FREE SAW T SHIRT SO GOODBYE     ",
      "saw-vi": "9/10 👌👀👌👀👌👀👌👀👌👀 good saw go౦ԁ sAw👌 thats ✔ some good👌👌saw right👌👌th 👌 ere👌👌👌 right✔there ✔✔if i do ƽaү so my selｆ 💯 i say so 💯 thats what im talking about right there right there (chorus: ʳᶦᵍʰᵗ ᵗʰᵉʳᵉ) mMMMMᎷМ💯 👌👌 👌НO0ОଠＯOOＯOОଠଠOoooᵒᵒᵒᵒᵒᵒᵒᵒᵒ👌 👌👌 👌 💯 👌 👀 👀 👀 👌👌Good saw     ",
      "saw-v": "9/10 I SURE DO LOVE ME SOME SAW     ",
      "saw-iv": "6/10 me rewatching some of the saw movies: why do i love these so much again?me rewatching the saw movie endings: OH RIGHT     ",
      "saw-iii": "7/10 AMANDA DIDN'T DESERVE THAT     ",
      "saw-ii": "9/10 PLAY IT AGAIN ZEPP     ",
      "saw": "10/10 every time hello zepp starts playing a part of my soul leaves my body and floats above me for a few minutes in suspended silence until the credits start rolling     ",
      "the-texas-chain-saw-massacre": "8/10 VROOM VROOM bitches know they can't catch me     ",
      "hostel": "4/10 definitely i thought it was fun i liked the beat     ",
      "i-carry-you-with-me": "8/10 NYFF 2020: film #22  \"i miss you. i miss you a lot\"  there's a kind of genre twist in here that i won't spoil just in case (because truth be told i didn't know about it myself) and it made the experience all the more affecting. many shots are intimately close and intertwine the past with the present and fiction with reality. i really loved this     ",
      "the-woman-who-ran": "7/10 NYFF 2020: film #21  \"did you like the film?\"\"yes, it was peaceful\"  in this film there's a slow zoom in on a cat yawning and it's one of the best shots i've seen all year. a while back during my first hong sang-soo, i remember eating a bunch of yogurt covered pretzels (i think they were?) and then immediately dozed off in the theater. this is only my second, but his style (or lack thereof) could be growing on me. or it could be too soon to tell, please check back later     ",
      "beginning-2020": "6/10 NYFF 2020: film #20  \"it's as if i were waiting for something to start, or to end\"  this is the kind of film that would have made me sigh in a normal festival atmosphere when it ended, leaving the theater and having not much to say about it while my friends and i grab a bite to eat and get ready for our next movie. deftly made to be sure, but so heavy in a way that doesn't feel fully worth it as well. i'll have to think on this one     ",
      "slow-machine": "8/10 NYFF 2020: film #19  \"you're going to be just fine\"  new york mumblecore excellence. this is a little bit alex ross perry with really sharp dialogue all around, holding everything together like glue (as well as a movie like this can). worth noting is an especially great cameo from chloë sevigny in one single scene where she delivers a pretty brilliant monologue in a film filled with pretty brilliant monologues. avoid this if it doesn't seem like your thing, but otherwise i'd recommend checking it out for sure     ",
      "the-plastic-house": " NYFF 2020: film #17  life is but a set of experiences, even the ones we make up in our own heads, like stories we tell ourselves. this was abstract and gorgeous in its mundane detail, every shot of a leaf swaying in the wind or sound of rain on a sheet of plastic dug at something deep within me, memories i have buried. a little too vast for me to grasp fully (hence my lack of rating, for now at least) but i really did feel this (and it is something to be felt)     ",
      "kajillionaire": "8/10 HAROLD.... WE GOT EM     ",
      "on-the-rocks-2020": "5/10 NYFF 2020: film #13  \"it must be very nice to be you\"  i got really annoying mild indigestion after watching this, and honestly i kind of blame sofia coppola. i don't want to say this is her worst film, but to say otherwise would be lying, so this is her worst film. when i imagine the target audience for this i see an upper class woman browsing films to rent on the couch at 9pm, remote in one hand and...     ",
      "days-2020": "6/10 NYFF 2020: film #11  \"the film is intentionally unsubtitled\"  contemplative and slow, this feels like the kind of movie that requires patience and just the right mood. i wasn't quite in the mindset for it today, but wonder how it would have affected me in a theater atmosphere instead watching from home     ",
      "the-human-voice-2020": " NYFF 2020: film #10  \"but admit, at one time we dreamed the same\"  oh to be the airpods in tilda swinton's ears. this was gorgeous, a bite-sized look at heartbreak and the confusion, sadness and anger that comes with it. and that DOG!     ",
      "columbus-2017": "10/10 \"thanks. for everything\" \"thank you. for being here\"  the most profound new discovery i've experienced all year. i've been in such a bad place lately that i almost forgot what falling in love with a film felt like. i'm at peace, for a moment at least. and that's enough     ",
      "this-is-paris": "7/10 it's incredible to discover that the original influencer became so as a way to escape and mask her trauma, trauma that has never left her. and the way she feels responsible for inadvertently creating this culture we're all so familiar with now, for creating a \"monster\", hardly unable to separate herself from her persona... wow     ",
      "time-2020": "9/10 NYFF 2020: film #9  \"desperate people do desperate things. it's as simple as that\"  not only one of the most moving documentaries i've ever seen, but certainly one of the most moving films i've ever seen. overwhelming doesn't even cut it     ",
      "her-socialist-smile": "5/10 NYFF 2020: film #8  \"can you see the splendor of the sunset? can you look up at the stars without emotion? i have never been able to see these wonderful fires in the sky, except through my imagination\"  heavily centered on helen's political leanings but completely unique in approach. i enjoyed this for quite a while until the charm eventually wore off     ",
      "mlk-fbi": "7/10 NYFF 2020: film #7  \"we have to use every resource at our disposal to destroy him\"  both riveting and unsettling, this doc is well crafted and provides a much needed glimpse at the inner workings of the FBI in the 60's as well as a personal look at MLK himself. i don't have a second sentence to follow that up with because it pretty much sums it up, but yeah, this was good     ",
      "the-calming": "8/10 NYFF 2020: film #6  \"facing the universe makes you feel so very small\"  there's something sadly romantic about spending time alone. many of us do it every day, quietly shuffling around in an art museum, or falling asleep on a train. we learn at the beginning of the film that our protagonist just went through a breakup, but it isn't spoken about again. instead we silently experience her world along with her, whether it be gazing at a treeline from...     ",
      "malmkrog": "4/10 NYFF 2020: film #5  \"if you know the answer, why ask the question?\"  i really tried. this is wildly uninteresting, all philosophical filler with nothing tangible to grab onto. there's a glimpse of possibility just after the mid point that held my attention, but was immediately discarded in place of more cold conversations that seem to run in circles. at least it looks nice!     ",
      "the-monopoly-of-violence": "6/10 NYFF 2020: film #3  \"only the state has the right to be violent. when we respond to that violence, we go to jail. we risk losing our children, we risk our jobs, our lifestyle, even if our lifestyle isn't great\"  as timely as ever. real footage of police brutality paints a horrifying picture as interviews weave in and out, the speakers commenting the the clips and sometimes even arguing opposing sides with each other. i'm not that well versed with the specifics of french politics, but it's chilling to see the similarities between france and what's been going on in america, especially this year. anyways... ACAB     ",
      "the-devil-all-the-time": "6/10 a star-studded cast that includes spider-man, batman and pennywise the dancing clown but the best performers were eliza \"the tooth fairy\" scanlen and riley \"ten minutes of screen time\" keough. i'm not surprised!     ",
      "film:649955": "6/10 NYFF 2020: film #2  \"some time you can tell me the ending\"  with a brisk 70 minute run time and an interesting setup, i was enjoying this for quite a while. unfortunately when the narrative shifts i lost most of that investment i'd built up, but this is still a fun exercise in unique meta layering and acting techniques. the autumn sonata line reading was a definite highlight     ",
      "smooth-talk": "8/10 NYFF 2020: film #1  \"don't you know i wanna be your friend?\"  kicking off my virtual fest with this newly restored print, and it was not at all what i expected. successfully lulling me into believing i was watching the normal teen fare, the final act sent me into a total panic. not sure how comfortable i feel with some of the implications at play, but i can't deny the effectiveness of the fear that creeps its way in. by the third act this morphs into a flat out horror film. and it's no surprise that laura dern has always been that good     ",
      "stoker": "10/10 this is My Movie™     ",
      "unpregnant": "7/10 \"we're gay and pregnant!\"  far from perfect but haley lu could sell me on anything (inserting a reminder here that i saw five feet apart in THEATERS) also this earns bonus points for a certain side plot that i had NO idea was in here... and with a maggie rogers song playing in the background? talk about knowing your audience     ",
      "blind-chance": "6/10 a lot of the smaller nuances in plot went over my head because of the specific politics at play here. by the third act i was finally getting invested but it felt a little too late in the game for the ending to really stick. still a solid warm up for when i eventually attempt dekalog... i'm petrified     ",
      "tenet": " \"don't try to understand it\"  very few filmmakers in the world have as much creative control as christopher nolan does on this scale, and when this ended that became abundantly clear. the reason being because this final edit is so incoherent that not only does it take research afterwards to fully figure out, but the sound mixing drowns out most of the dialogue completely. not that the dialogue is very helpful to begin with, it only added to the confusion...     ",
      "bacurau": "8/10 the less you know the better. i feel like i've already said too much even by saying nothing at all     ",
      "summerland-2020": "8/10 this was exactly what i thought it would be, but made me feel much more. why does gemma always clown me like this     ",
      "yes-god-yes-2019": "7/10    the wise hero of this movie being a lesbian at a gay bar who rides a motorcycle and tells the protagonist to go to a college on the coast... sounds about right     ",
      "im-thinking-of-ending-things": "6/10 watching this and tenet in the same day has my brain crying out for a lobotomy     ",
      "lady-vengeance": "9/10 so he saved the best in this trilogy for last huh     ",
      "the-dark-knight-rises": "10/10 a ridiculous mess, but one that i will always love     ",
      "matthias-maxime": "8/10 easily my favorite xavier since mommy, which is wild to me because usually i'm more drawn in by his stylish theatrics and music choices instead of the quiet. this is stripped back and it really works, less of a love story and more of a story about two people that happen to be in love   (ok i tried to resist but i can't exit the review without mentioning the work bitch needle drop. WOW)     ",
      "oldboy": "7/10 well 😬     ",
      "love-simon": "8/10    i'm still in a state of slight anxiety. the crushing weight on my chest is getting heavier. i almost came out to a couple of my friends tonight, but didn't go through with it. and i almost did it because of this movie  that is so fucking corny, give me a second to apologize for making you read that. i'm so sorry  ok, we're back. this movie is so..... much. and in the most unsuspecting way imaginable. and i honestly...     ",
      "chemical-hearts": "3/10 y'all ever heard take care by beach house?     ",
      "the-dark-knight": "10/10 marvel could never     ",
      "batman-returns": "8/10 LIFE'S A BITCH, NOW SO AM I     ",
      "spree-2020": "7/10 grand theft influencer     ",
      "free-solo": "8/10 imagine climbing rocks for fun? could never be me! but this was actually so exciting... they got me     ",
      "sympathy-for-mr-vengeance": "9/10 tarantino you're bones     ",
      "her-smell": "9/10 AFI 2018: film #12  \"sometimes i don't even know myself\"  the first of the fest to really make me cry, this is electric until it isn't. a dizzying ride until it takes time to catch it's breath, but the two very different vibes combined make it truly great     ",
      "vox-lux": "9/10 AFI 2018: film #3  \"this is your show\"  completely striking, i held my breath the entire time. there are sequences here that STUN, either in a positive or negative way, depending on the person watching. it often drips with sickly humor and the way the camera moves and the way scenes cut from one to the next are almost too slick to be believed. and while the appeal for most is natalie portman, raffey cassidy is alarmingly good and gives one...     ",
      "she-dies-tomorrow": "7/10 \"i love trees. i'm gonna miss them\"  most of the time when i feel an anxiety attack coming on it was actually triggered by the random thought that crossed my mind just before it started: \"what if i had an anxiety attack right now?\" this is kind of like that for 90 minutes. don't expect much explanation but instead try to tune in with the melancholy vibes, which shouldn't be much of a challenge during times like this. i feel...     ",
      "all-cheerleaders-die": "10/10 REAL CINEMA     ",
      "black-is-king": " i BELIEVE in beyoncé supremacy     ",
      "geralds-game": "6/10 ????? not that ending 😭     ",
      "buried": "4/10 if he had watched kill bill volume 2 this movie would only be 5 minutes long     ",
      "spy-kids-3-d-game-over": "6/10 rewatched (and in 3D!!!) for the first time in over a decade, and it's so clear why this was one of my favorite movies as a kid. i'm a firm believer that real-d 3D is currently an overused gimmick that audiences quickly got sick of after movies like avatar utilized it with purpose. for me it adds nothing of value to films that clearly only slap it on because ticket prices are higher in 3D. but this 3D trend that...     ",
      "saint-frances": "8/10 \"my guitar class is a patriarchy\"  super cute and touches casually on various important topics in just the right way, amplifying it beyond the realm of just \"super cute\" into \"actually really good\" territory as well. also it's really interesting how they managed to somehow find the cutest kid in the world     ",
      "judy-punch": "6/10 \"he won't be winnin' anymore\"  what i would give for mia wasikowska to be in a movie as good as stoker again     ",
      "bad-education-2019": "8/10 \"it's only a puff piece if you let it be a puff piece\"  thoroughbreds is still one of my favorite movies of the 2010's so i'm elated that this delivered     ",
      "the-other-lamb": "8/10 \"his attention is like the sun. it's bright and glorious at first. but then it just... burns\"  doubt creeps in slowly and hypnotically and it was super effective for me. definitely my favorite visuals of the year so far, unsettlingly gorgeous     ",
      "villains-2019": "6/10 to maika monroe only, everyone else look away: hi 😘     ",
      "the-old-guard-2020": "5/10    the absolute shock i experienced half way through this when michael suddenly paused it and shouted that the villain was dudley dursley     ",
      "freak-city": "6/10 not ideal representation (and definitely feels like the tv movie that it is) but i remember feeling like i'd struck gold while channel surfing in the middle of the night as a little disabled kid and seeing it for the first time. and it's fitting that this came out the same year as girl interrupted because i've always associated them in my mind. it's on youtube for anyone interested     ",
      "first-cow": "8/10 \"i've got you\"  never thought i would be close to tears while listening to a cow being milked, but here we are. the american dream really is an endless circle     ",
      "night-moves-2013": "7/10 \"you said no one would get hurt\"  as far as the premise and pacing goes, this is easily one of the most accessible additions to reichardt‘s filmography. and still, i don't think i'd recommend it over most of her other films. her narratives thrive best with more wide open space to keep things as atmospheric as possible. this is sparsely thrilling and and will probably grow on me with time, but i feel like i'll be returning more often to the others     ",
      "hamilton-2020": "2/10 probably the most painful experience of my life which also includes over a dozen broken bones, 5 major surgeries and once even a nonstop flight seated next to a crying baby     ",
      "river-of-grass": "6/10 \"too much daydreaming left me blue\"  feels a little like kelly reichardt‘s pulp fiction moment for better or worse, but i'm glad her films only grew softer and more thoughtful later on. she truly is a quintessential american director     ",
      "the-big-lebowski": "8/10 yeah... well... you know... that's just like uh... your opinion man     ",
      "the-blair-witch-project": "8/10    every time i rewatch this i always think... oh damn... it's not as scary as i remember... BUT THEN THEY FIND THE HOUSE.....     ",
      "crip-camp-a-disability-revolution": "9/10 \"we, as disabled persons, are here today to ensure for the class of disabled americans, the ordinary daily life that non-disabled americans too often take for granted: the right to ride a bus or a train, the right to any job for which we are qualified, the right to enter any theater, restaurant, or public accommodation. the passage of this monumental legislation will make it clear that our government will no longer allow the largest minority group in the united...     ",
      "buffaloed": "8/10 \"fine. i hate that word, fine is like mediocrity's dumb cousin\"  a strange mix of election and the wolf of wall street, and a much better time than the big short. zoey deutch really has the ability to turn every good movie great, and hearing a needle drop of vivaldi's four seasons summer presto kind of made me bump up my rating. why lie?     ",
      "beetlejuice": "10/10 THIS IS MY ART AND IT IS DANGEROUS     ",
      "et-the-extra-terrestrial": "8/10 that terrestrial sure was... extra     ",
      "jaws": "7/10 you know you that bitch when you cause all this conversation     ",
      "the-watermelon-woman": "7/10 \"it means hope, it means inspiration, it means possibility. it means history\"  i could watch hours more of this. insightful and delightful     ",
      "shirley-2020": "8/10 \"you could run, run fast away from me but you don't. why don't you? why do you stay?\"  sometimes the strange bonds we find ourselves ensnared in can free us, change us. this might be less about the bond itself and more about the abstract changing, but it's fascinating either way. the porch swing scene might be the best of the year so far. i know what i'm about     ",
      "parasite-2019": "9/10 \"this is so metaphorical\"  oh holy fuck. go in cold, you'll thank me later     ",
      "13th": "9/10 ava duvernay really should already have an oscar by now     ",
      "sarah-silverman-a-speck-of-dust": " made the enormous mistake of watching this on a train and i had to choke on my laughter the entire time     ",
      "hannah-gadsby-douglas": " did some research and found that nothing is funnier than hannah gadsby going off about art history. you're just gonna have to trust me on this one because i ran the facts and figures     ",
      "vita-virginia": "7/10 \"you have as much of me as i have to give\"  hypnotic, but still too inaccessible. still, i can't fault it much because it's so uniquely well made compared to most films in this sub genre. the score especially breathes life into every scene, and elizabeth and gemma bring some of their best performances to the table. this is either going to grow on me exponentially, or it'll sour and drift away. only time will tell     ",
      "orlando": "7/10 the absolute flex of writing this classic because of a love affair with vita sackville-west... exactly virginia     ",
      "the-passion-of-anna": "8/10 i don't know how exactly to talk about this one but girl i am living. liv ullmann is kind of the greatest actor of all time     ",
      "national-treasure-book-of-secrets": "8/10 i've been trying to finish this rewatch for over a week now which really sums up how my quarantine is going. also, these two movies were cinematic nirvana when i saw them in theaters as a kid and that feeling never went away. who wants to go treasure hunting with me when this is all over?     ",
      "nimic": " i BELIEVE in mimic supremacy     ",
      "shame": "7/10 \"and the whole time i knew that there was something i should remember, something someone had said. only it escaped me\"     ",
      "hour-of-the-wolf": "7/10 my man ingmar said do you mind if i go a lil wild and symbolic with this one? and i said by all means ingmar you do what you need to do     ",
      "the-room-1972": " go chantal akerman that's chantal akerman y'all     ",
      "cleo-from-5-to-7": "7/10 \"i think my fear is gone. i think i'm happy\"  now i'm left longing for something i can't quite put my finger on. if i'm currently opening a new tab just to look at paris on google maps... mind your business     ",
      "the-piano-teacher": "8/10 \"can you imagine? being that evil?\"  i could write any number of things about this film, but right now... this is all i'm thinking about     ",
      "the-assistant-2019": "8/10 \"listen, honestly... what do you want from me?\"  so potent and unsettling. paints an increasingly anxious picture with so little detail provided     ",
      "wounds": "2/10 me when i decided to watch this, in the words of the prophet fiona apple Herself: i'm gonna make a mistake, i'm gonna do it on purpose     ",
      "a-secret-love": "8/10 \"i don't know what happened... but... that was it\"  yeah i'm full on sobbing... this shit is breathtaking bro 🥺     ",
      "the-half-of-it": "6/10 she's a cute girl. also: himbo rights     ",
      "diabolique-1955": "7/10 that moment when you, a queen, come across another queen, and discuss how best to maximize your joint slay     ",
      "you-were-never-really-here": "9/10 lynne ramsay is a god. and that's all i have to say about that     ",
      "we-need-to-talk-about-kevin": "8/10 do we really need to talk about him though? do we really?     ",
      "morvern-callar": "8/10 this is definitely a new favorite. no one else is doing it like lynne ramsay     ",
      "suspiria-2018": "7/10 \"you've all waited long enough\"  after considering it for most of today, i've realized this is already growing on me. i was pretty unaffected at first, only really reacting to the most grotesque scenes (a positive reaction of course). it feels way too long and some of it feels unnecessary, but it held my attention throughout even though i was exhausted all day today  the last 30 minutes make it worthwhile for me. some good blood and gore can win...     ",
      "out-of-print-2014": "7/10 this made me miss LA so bad 🥺 not to sound like an absolute circus clown but if society ever goes back to some sort of normalcy after all of this virus shit, i'm packing my bags and GOING ☝️     ",
      "never-rarely-sometimes-always": "8/10 \"what's wrong?\"\"girl problems\"  so special. it's sparse in just the way it needs to be, the silence carrying us along with it. quiet despair is just the routine for so many, and this shows it with so much empathy that it made my heart ache. ugh     ",
      "playtime": "6/10 ok?     ",
      "captain-marvel": "10/10 I'M JUST A GIRLI'M JUST A GIRL IN THE WORLD     ",
      "there-will-be-blood": "8/10 there was blood     ",
      "gangs-of-new-york-2002": "7/10 when i was little, my mom probably watched this half a hundred times. i'll never get the war music out of my head for as long as i live     ",
      "vivarium": "5/10 a really really long episode of the twilight zone. also, if i ever in my life decide to live in the suburbs, please remind me of this movie and then slap me across the face. thanks     ",
      "the-platform": "8/10 location: underneath jeff bezos' house     ",
      "the-princess-diaries": "8/10 \"YOU LOOK RIDICULOUS, YOU SHOULD SUE\"     ",
      "cries-and-whispers": "8/10 \"come what may, this is happiness\"  grief is so potent. it brings people together with a purpose, some more selflessly than others. and it rips them apart, exposing the truth, however ugly, however foul. bergman always makes me sob     ",
      "old-joy": "9/10 oh... i FELT that 😔     ",
      "the-twilight-saga-breaking-dawn-part-2": "2/10 this was horrible. i did NOT love it! i still cried tho! 😛     ",
      "the-twilight-saga-breaking-dawn-part-1": "5/10 this was horrible. i loved it!     ",
      "the-twilight-saga-eclipse": "3/10 i can't believe when stephanie was writing the twilight trilogy she stopped at the beginning of the third book and said \"WAIT! I NEED TO SQUEEZE IN MORE LOVE TRIANGLE!\" thus eclipse was born. these are all facts. she told me herself     ",
      "the-twilight-saga-new-moon": "5/10 team edward: i am looking away........ 😐team jacob: i am looking directly at it 😌team girls with depression: i live here 😛     ",
      "meeks-cutoff": "8/10 a tranquil nightmare. maybe men have been making westerns wrong this whole time 🤨     ",
      "high-school-musical": "5/10 can you believe it's been 10 years since high school musical changed the world forever     ",
      "cheaper-by-the-dozen-2003": "7/10    ʏᴏᴜ SOAKED ʜɪs UNDERWEAR ɪɴ MEAT... THAT ɪs sᴏ WRONG... FUNNY! BUT ᴡʀᴏɴɢ...     ",
      "hackers": "9/10 HACK THE PLANET!!!     ",
      "a-bigger-splash-2015": "7/10 yes this was a thirst watch. what am i gonna do? deny it?     ",
      "rihie-rih": "5/10 a 10 second clip of the mcdonalds inside richie's house has stayed buried in the subconscious of millions of us to this day. it doesn't get more timeless than that     ",
      "swallow-2019": "8/10 [swirling wine in a glass and tasting it] mmm.... marble.... with a hint of thumbtack     ",
      "ghost-world": "10/10 \"i don't know i just..... like don knotts\"     ",
      "little-children": "9/10 i put the new phoebe bridgers song on repeat the second this ended which really sums it up     ",
      "contagion": "8/10 i guess it really DO be like that sometimes 😳🥵     ",
      "emma-2020": "5/10 no i wasn't thinking about clueless the entire run time, how dare you slander my name with such a heinous accusation     ",
      "rififi": "7/10 this movie was really good but i have to talk about the old guy during the discussion in the theater afterwords who didn't understand how foreign language films and subtitles worked and it had to be EXPLAINED to him. he was like \"did they remake it for american audiences? but how are we understanding what they're saying? it's not in english?\"     ",
      "cinema-paradiso": "8/10 \"whatever you end up doing, love it\"  a movie about movies making me cry at 5:30 in the morning... silly behavior! but this is who i am     ",
      "yours-mine-ours": "6/10 why isn't this in the criterion collection     ",
      "little-miss-sunshine": "10/10 \"everybody just pretend to be normal\"  one of my all time favorites, and it never gets old. this is one of the examples i always reference when asked about my favorite dialogue in film     ",
      "the-fighter-2010": "8/10 i hate how good this was     ",
      "fighting-with-my-family": "6/10 goth florence pugh 😍🤲     ",
      "the-lodge-2019": "10/10 \"you have nothing to be scared about\"  paralyzing and agonizing. i've been considering my rating all day, but i just realized there wasn't a single second of this that i wasn't completely at its mercy, staring helplessly at the theater exit sign and wishing i didn't have to endure what came next. i haven't felt this truly, achingly scared in a long time. what a glorious nightmare     ",
      "the-invisible-man-2020": "7/10 lizzie moss: the invisible man:lizzie moss: tom i know it's you. you're never getting the scientology throne back so you can stop asking     ",
      "moonrise-kingdom": "10/10 the best wes     ",
      "pride-prejudice": "8/10 i guess the straights have rights after all     ",
      "punch-drunk-love": "9/10 yes GOD... ok paul does have the range     ",
      "moneyball": "6/10 the way that sorkin is kind of a one hit wonder... ouch     ",
      "jeanne-dielman-23-quai-du-commerce-1080-bruxelles": "10/10 HELP     ",
      "the-ladies-man-1961": "7/10 my dad's very specific kind of humor suddenly makes much more sense     ",
      "sonic-the-hedgehog": "5/10 he went so fast and that's all that matters     ",
      "before-sunrise": "8/10 \"i guess this is it, no?\"\"yeah... um, i really..... i mean, you know...\"\"yeah, i know. me too\"  ...oh?     ",
      "big-fat-liar": "7/10 they told me to pick up a little blue car THEY DIDN'T SAY ANYTHING ABOUT A LITTLE BLUE MAN     ",
      "the-irishman-2019": "7/10 \"would you like to be a part of this history?\"  i sometimes had no idea what was going on from scene to scene, but in scope i was always on board. it's a lot to digest but i can't say i didn't kind of love that about it     ",
      "1917": "7/10 best picture showcase: film #8  \"you got somewhere you need to be?\"  at another time and in another mood i might have really taken to this, but it felt more like watching a video game walkthrough than a movie. deakins killed it and some moments were breathtaking, but without the visuals here i would have been way too sick of the war movie element to care. ahh well     ",
      "once-upon-a-time-in-hollywood": "2/10    i haven't felt this disappointed in a long time. i figured going into it that this would end up being my least favorite tortellini, but i had no idea  anyone could have directed this. it feels completely inorganic when related to him, except that it's clearly playing out a nostalgic hollywood fantasy, feet and all. and even if he tried a new route by throwing out his old signature styles, whatever replaced it here is completely unoriginal. a lifeless corpse...     ",
      "jojo-rabbit": "7/10 CIFF 2019: film #4  \"she doesn't want to talk to me\"\"well... you are a nazi\"  very worthwhile, but the tonal shifts are somehow too sharp and also too mild simultaneously. this feels like it was missing an element or two. but it's a difficult topic to spin into a comedy and also show immense and genuine empathy for, and taika did it much better than most could have     ",
      "brief-encounter": "8/10 \"i'll forgive you if you'll forgive me\"  love really is so universal, isn't it?     ",
      "maiden-2018": "7/10 women be sailing 🥺     ",
      "shadow-of-a-doubt": "7/10 the stoker vibes.... yes yes yes     ",
      "marriage-story-2019": "9/10 CIFF 2019: film #8  \"i'm sorry\"\"me too\"  an absolute stunner. every line was written with care to seamlessly blend comedy and tragedy together. it sometimes comes off as almost too polished (that SCORE!) but grounds itself once again in the realism of how fast things can go from bad to worse. adam driver is particularly good, but my favorite performance has to be laura dern, getting to stretch her legs here with material much better than what big little...     ",
      "little-women-2019": "6/10 \"there are some natures too noble to curb and too lofty to bend\"  i'm on the outside looking in. i felt so much while watching this, crying a lot and smiling even more. not bold enough to wow, but comfortable enough to settle into. i liked that. but just as i felt with lady bird, that feeling disappeared into the fog when it ended, shattering the daydream and leaving me all but comforted by the experience. while viewing i saw...     ",
      "joker-2019": "3/10 \"i don't believe in anything\"  surface level fare for audiences that crave some shock value but aren't willing to go looking for something better, or deeper. i didn't feel much of anything the entire duration, indifference turning to eventual boredom. the last act definitely gave me something more to work with, but by that point i'd already lost all interest and just wanted to get out of there. joaquin is always good at playing unhinged, sure, but i'd pass on...     ",
      "ford-v-ferrari": "6/10 best picture showcase: film #1  \"the only question that matters: who are you?\"   men be driving cars super fast. and that's all i have to say about that     ",
      "us-2019": "9/10 \"what do you want?\"  its been over an hour and i can't think of anything else except whatever this was. simplistically sinister, maybe more comparable to something like the shining instead of get out. i first thought i was somewhat unaffected, but now my mind is clouded with a mild thudding anxiety that won't go away. this is ridiculously fine tuned to creep under your skin without you noticing. i have to go to sleep now but i doubt i'll have much success. wish me luck     ",
      "the-turning-2020": "2/10 SO many bad things i could say about this, so let me focus on the positive: it features a soccer mommy song. thank you     ",
      "hail-satan": "8/10 \"if you're godless, free thinking, and a rebel, then you are a satanist in the eyes of many in our community and society, and certainly by people in your government. whether you like it or not\"  completely captivated and fascinated by this, and it made me laugh harder and more genuinely than most anything i've seen all year. y'all mind if i start hailing satan?     ",
      "goldman-v-silverman": " i hate tourist spots because adam sandler could be painted gold for a short film right in front of you while you're walking around looking for the american eagle and you'd never know     ",
      "uncut-gems": "9/10 \"that's all the gem. that's all the gem\"  i'm so full of adrenaline that i don't know what to do with it all. this was like a slow acting virus that crept up on me, i didn't realize what it was doing until it was too late. the last act has to be one of the best of the year. fuck. i need to collect myself     ",
      "underwater-2020": "5/10 if i was underwater i would simply swim to the surface     ",
      "knives-out-2019": "9/10    CIFF 2019: film #6  \"everyone can lie. well... almost everyone\"  wildly entertaining and seriously hilarious. the best popcorn movie of the year, but also packs a series of punches that make it truly impressive. i had way too much fun to find any real issues with this     ",
      "wild-rose-2018": "7/10 the kacey cameo made me SCREAM     ",
      "american-honey": "10/10 WE DON'T DESERVE MOVIES THIS GOOD     ",
      "climax-2018": "8/10    \"go dance and have fun, you earned it\"these anti drug psas are getting scarier every year. also, leave it to sofia boutella's character to end up alive and well and in bed with a woman at the end while a bunch of other characters are lying dead on the floor. finally some justice for what happened to her in atomic blonde     ",
      "clemency": "7/10 \"you can't save the world\"  very sparse at times to a fault, but otherwise so compelling. this one will haunt me     ",
      "give-me-liberty-2019": "6/10 \"i depend on you\"  way too scattered for me to fully love, but still kind-hearted at the core. i would have preferred more of a look at the bond between the two leads, but i also see the appeal of involving so many kinds of characters. lauren spencer is maybe my favorite breakout performance of the year now, and ending a movie with bon iver gets me every time     ",
      "luce": "8/10 \"it's not that simple\"\"nothing ever is\"  handled with delicate complexity that left me questioning every word and every glance. not much is answered, but it doesn't matter anyways. what's more important is the perception of identity and what it means to be good or bad. and how there's barely an in between. this was sensational     ",
      "bombshell-2019": "3/10 so many issues with this that i don't know where to start, so i won't start at all. goodnight     ",
      "cats-2019": "1/10 i'm gonna be really honest with you guys... this was the most fun i've ever had in my entire life     ",
      "black-christmas-2019": "4/10 i literally don't know what to make of this but even with that it'll still probably be my favorite thing i see this weekend     ",
      "dark-waters-2019": "7/10 this was so good except for the guy next to us literally sucking on his candies so loud and humming and coughing. please go back home and watch bonanza or something sir     ",
      "the-perfection": "4/10 the handmaiden's dumbass american cousin     ",
      "anima-2019": " let's go radiohead hive let's go     ",
      "mistress-america": "7/10 \"you are much more of an asshole than you initially appear\"     ",
      "gifted-2017": "7/10 jenny slate saw miss honey in matilda 1996 and said \"yeah you right! lemme try\" and she succeeded. also this was a lot darker than i thought it would be, the kindergarten teacher WHO? also math is really hard. sorry for this review     ",
      "a-beautiful-day-in-the-neighborhood": "6/10 a strange mix of such profound truth and mundane mediocrity. the central plot could have been about any person and any family, but that kind of feels like the point, because mr rogers cared so much about anyone and everyone. but that doesn't make it any less dull. moments here will stick with me, but otherwise it lost me     ",
      "frozen-2": "5/10 anna and elsa said girls with clinical depression get behind me     ",
      "meet-me-in-st-louis": "6/10 judy garland herself said \"make the yuletide gay\" so we have no choice but to do just that     ",
      "queen-of-hearts-2019": "8/10 \"sometimes what happens and what must never happen are the same thing\"  twisted and heavy. there are moments here that had me arguing with my tv, and some moments that i considered shutting the damn thing off. but to make a film that is simultaneously so pretty and so ugly... sheer brilliance     ",
      "the-fall-2019": " damn ma is it that serious 😭     ",
      "harry-potter-and-the-prisoner-of-azkaban": "10/10 (part of the harry potter weekly double feature)the first film in the series to pop up when you search \"harry potter\" on letterboxd, and for good reason. when i first saw this in the theater as a kid i was unsure of all the changes it made from the first two movies, but it's only grown on me over the years. alfonso cuarón brings more to the table here than any other director in the series, the close-ups, bold...     ",
      "blue-crush": "6/10 oh to be a surfer girl in the early 2000's     ",
      "catch-that-kid": "5/10 the new charlie's angels wants what this has     ",
      "with-every-heartbeat": "10/10 blue is the warmest WHAT? imagine me and WHO? THIS is a masterpiece... when will you all realize     ",
      "waves-2019": "2/10 absolutely fucking not     ",
      "and-then-we-danced": "8/10 AFI 2019: film #7  \"you can take it. i don't need it anymore\"  this was so graceful and full of life, radiating a contagious energy that hooked me immediately. one of the cinematic highlights of the year for so many reasons and such a good close to this fest for me     ",
      "corpus-christi-2019": "7/10 AFI 2019: film #6  \"help me become humble\"  as bleak as it is uplifting, the plot was pleasantly complex and had a lot of depth. i have a feeling that i'll be thinking on this one for a while     ",
      "charlies-angels-2019": " uh     ",
      "days-of-heaven": "7/10 you ever fuck around and shoot a whole film only during the magic hour?     ",
      "i-was-at-home-but": "2/10 AFI 2019: film #5  \"i'm scared of vanishing\"  wished i was doing anything else but sitting in that theater. sorry to this film     ",
      "romantic-comedy-2019": "6/10 AFI 2019: film #4  \"we all want to be loved\"  a fun and insightful watch but full of points i've thought of myself or heard many times before. it did remind me how much i love the sweetest thing, though     ",
      "anne-at-13000-ft": "8/10 AFI 2019: film #3  \"what is wrong with you?\"  unsettlingly familiar and handled carefully, this was enthralling for me. people who won't relate to it might not find as much worth here, but the stunning lead performance front and center demands attention nonetheless     ",
      "the-truth-2019": "6/10 AFI 2019: film #2  \"you can't trust memory\"  this specific kind of french movie is never really for me, but i did enjoy this the entire run time     ",
      "videodrome": "7/10 quick question: what was this about     ",
      "doctor-sleep": "7/10 danny:rose: in case you haven't noticed? i'm weird. i'm a weirdo. i don't FIT in. and i don't... WANNA fit in. have you ever seen me without this stupid hat on? THAT'S WEIRD     ",
      "the-good-liar": "5/10 [tyra banks voice] gone girl, but for the elderly     ",
      "autumn-sonata": "9/10 \"a mother and a daughter. what a terrible combination of feelings and confusion and destruction\"  gut-wrenching. amplified the deep pain of my mommy issues tenfold. i will say that i wish the helena character and storyline had been given a little more attention and care, but i don't really feel like getting into that right now. otherwise, this is singularly brilliant     ",
      "donnie-darko": "10/10 i just missed it but happy anniversary to when donnie saved us all     ",
      "zombieland-double-tap": "6/10 zoey deutch said y'all mind if i uhhh save the movie     ",
      "zombieland": "8/10 this is what emma won the oscar for     ",
      "the-vast-of-night": "6/10 CIFF 2019: film #7  \"this is good radio\"  eerie and alluring, the dialogue is fast paced and energetic until it flows into lengthy tracking shots that really work for the mood. i do feel the need to deduct half a star for the overlong monologues, i originally thought it served the film but they feel too self indulgent for no reason. but this is still so cool and worth checking out, i was on board the whole time     ",
      "the-lighthouse-2019": "5/10 \"the light belongs to me\"  i was so ready to get into this but eventually i asked myself... what was the reason? confusing with no purpose and not even shocking enough to keep me involved. it's atmospheric and bold and has incredible depth in the eyes of some, but apparently not for me. i did however enjoy the style enough to appreciate how well it was made     ",
      "stalker": "8/10 \"this is the most important moment in your life\"  much too much to unpack after a long day like today, but i'll definitely be ruminating over this for a while. the 35mm was absolutely stellar though     ",
      "halloween-ii-1981": "6/10 michael myers:everyone else: twitter.com/letterboxdlucy/status/1185812099546669056?s=21     ",
      "a-nightmare-on-elm-street-2010": "1/10 rooney sweetie i am so sorry     ",
      "pain-and-glory": "7/10 \"love isn't enough\"  much more enthralling than i anticipated. it lags a little sometimes, but still solid all the way through     ",
      "varda-by-agnes": "7/10 CIFF 2019: film #3  \"nothing is lost, everything transforms\"  so magical, everything she has to say is so vital and told with so much warmth. i'll surely love this even more when i watch more of her filmography     ",
      "babyteeth": "5/10 CIFF 2019: film #1  \"this body, it's too much\"  too all over the place tor me to take in all at once. very realistic in that sense, but it feels like too much and can't decide which story it wants to tell most. eliza is magnetic, but otherwise this never quite hit the mark for me     ",
      "alien": "10/10 imagine a version of this where everything is exactly the same, except \"the sound of silence\" plays every time the alien appears     ",
      "pauline-2009": " ending of the decade i think     ",
      "frances-ha": "9/10 lucy dacus was right when she tweeted \"friendship 🤝 is sacred 🙏 the highest ⬆️ form of love 💞\"     ",
      "looper": "8/10 \"so i changed it\"  like watching it for the first time. thrilling in that sense, but also this still loses me some moments and takes a few minutes to grow on me again. but that ending is a new classic     ",
      "thelma-2017": "10/10 AFI 2017: film #2  in my heart this very much feels like the best movie i've seen so far this year. it had so many concepts that i thought would overwhelm or disappoint me, but instead i was so completely immersed that by the end i was shaking slightly from the aftermath. there's a lot to unpack here and a lot i could say, but if i get into it more it'll be after i see it again (which should hopefully be this week)     ",
      "evil-dead-ii": "6/10 sam raimi was off the shits with this one     ",
      "the-evil-dead": "8/10 gore? heard of it     ",
      "best-in-show": "9/10 \"no, that's a bear... in a bee costume\"     ",
      "the-secret-garden-1993": "9/10 \"i'm going out in my chair. if the fresh air agrees with me... i may go out every day\" me when i leave my house     ",
      "ad-astra-2019": "5/10 i hate to say it i hope i don't sound ridiculous i don't know who this man is... i mean he could be walking down the street i wouldn't... i wouldn't know a thing... sorry to this man     ",
      "hustlers-2019": "9/10 \"we were fucking hurricanes, weren't we\"  not a joke in the slightest: this is one of the best films of the year. a movie with a premise like this could have been made in a million horrible ways, but this is a perfect example of how good something can be when treated just right. it's engaging from the first scene until the cut to black. everyone is a star player, j-lo is ridiculously great and even cardi b and miss...     ",
      "it-chapter-two": "7/10 \"if you believe it does\"  a lot like the first one in tone to a fault, the patterns growing a little old. it feels less impactful this time around. but still so well made and genuinely scary (also, i cried) so i can't be too critical     ",
      "your-girlfriend": " some really quietly affecting work from my dear friend jacob. this one is introspective and soft, and definitely his most mature short film yet. a muted look at the way people drift in and out of our lives, and how sometimes they're called back to our minds even if we haven't thought about them for a while. and i was lucky to be an advising editor and help out with the poster as well, it brings me immense joy and pride to see jacob's work come to life every time. you can watch the short film here     ",
      "mad-max-fury-road": "9/10 SO FUCKING GOOD     ",
      "the-goldfinch": "2/10 \"ha! harry potter\"  this is some of the worst film editing i have ever seen in a movie this mainstream, and the plot was absolutely incoherent (as was the dialogue). i was trying to buy what it was selling, but everything feels off. to all you fans of the book... i am so sorry they did you this wrong. the plus side is we finally have something to double feature with the book of henry. please go see hustlers     ",
      "the-death-life-of-john-f-donovan": "6/10 \"it was the only connection i had with the life i dreamed of\"  ...they had us in the first half, i'm not gonna lie. this was so close to being... something. but by the second hour it lost ground fast, unraveling somewhere between kit's inability to act and the muddled plotlines... oh well. but i'll always stand by xavier and his ambitious music and editing choices. my kryptonite every time     ",
      "lawrence-of-arabia": "4/10 in the time it took me to watch this, i could have rewatched charlie's angels: full throttle twice. priorities     ",
      "the-farewell-2019": "9/10 \"isn't it wrong to lie?\"  family is so simplistically complex: grief, joy and despair are often all mixed together. this was so rhythmically calming, and i can't remember the last time i've heard an audience burst into laughter and then stop on a dime to reflect. this is skillfully made and every performance deserves recognition, but as i wrap up my review i'm gonna leave you with three words: awkwafina academy award     ",
      "good-boys-2019": "4/10 i know brie larson didn't roll jack up into a rug and break him out of room so he could say bad words and google porn. i guess he's growing up 🥺     ",
      "the-kitchen-2019": "2/10 so lifeless i dipped out half way through. lizzie moss we gonna get you that razzie     ",
      "what-we-do-in-the-shadows": "9/10 \"we're vampires, we don't put down towels.\"     ",
      "scary-stories-to-tell-in-the-dark-2019": "5/10 felt like a tv movie for tweens until the Scary Stories themselves unfolded and then my mind was boggled at how the hell this managed a pg-13 rating. if you showed me one of those scenes out of context and said it was from a new french extremity movie, i would believe you     ",
      "transit-2018": "8/10 \"who is the first to forget: he who is left, or she who left him?\"  inconspicuously captivating. the last half hour was so calmly stressful that i could feel my own heartbeat. i need to rewatch phoenix     ",
      "it-2017": "8/10 \"time to float\"  JUST earns 4 stars, because what it gets right, it REALLY gets right. does for horror what super 8 did for sci fi. i'm still trying to figure out exactly where i stand, and it might be too early to tell, but this feels like something special (or even just on the brink of it)  you should probably catch this in theaters (if you can handle it)     ",
      "titanic-1997": "10/10 this morning right before i woke up, i had a dream right at the edge of consciousness. all it involved was me remembering and thinking about the movie titanic and saying to myself \"mom and i haven't watched this in a while. we should rewatch it together soon.\" it wasn't until i woke up that i realized that my mom passed away 2 years ago.  titanic is, by far, the most nostalgic movie for me. it's 100% pure concentrated nostalgia....     ",
      "teen-spirit-2018": "9/10 \"a lot of people like to sing. you can sing\"  was fully anticipating feeling mildly apathetic about this, but then they opened the movie with genesis by grimes and i was a fool by tegan and sara. back to back. this COMPLETELY won me over, from the saturated colors to the killer soundtrack. the right balance of hazy neon and introspective moments of quiet. i could feel the flaws under the surface, a little clumsy here and there, and cliche...     ",
      "my-days-of-mercy": "4/10 this wasn't great but also i didn't expect it to be. sometimes i just gotta watch one good movie kiss and i'll be alright     ",
      "the-art-of-self-defense-2019": "4/10 bro, it's not gay if it's karate     ",
      "the-last-black-man-in-san-francisco": "9/10 \"you don't get to hate it unless you love it\"  stylistically new but also so familiar, like a long forgotten classic lost in the pages of history. every shot is a breath of fresh air, it almost feels like the first real film i've seen all year. i'm stunned     ",
      "crawl-2019": "7/10 effy stonem swimming away from alligators during a hurricane did more for me than midsommar... life is full of surprises, truly     ",
      "sky-high-2005": "8/10 the mcu couldn't do it     ",
      "the-sisterhood-of-the-traveling-pants": "9/10 just know that every morning i open my eyes and ask myself, WWTFTSOTTPD: what would tibby from the sisterhood of the traveling pants do     ",
      "midsommar": "6/10 this isn't even a horror movie, straight couples just be like that     ",
      "spider-man-far-from-home": "6/10 peter parker every 10 minutes: i am but a young boyme, nodding: he's baby!     ",
      "spider-man-homecoming": "7/10 zendaya barely had any screen time but every moment she did have was worth it's weight in gold. that is the most pressing piece of information about this movie that i have to share, goodnight     ",
      "school-of-rock": "10/10 the only movie worthy of 5 stars?     ",
      "avengers-endgame": "8/10 an adrenaline rush and exactly as gaudy as you might think, but also completely unique tonally in its approach. this feels like a special moment in film history at the very tippy top of the cinematic universe era that can't possibly last for as long as people expect. in the scope of things, film is still in its infancy as an art form, and to see a spectacle like this that has so many moving parts is kind of remarkable,...     ",
      "the-secret-life-of-pets-2": "4/10 me: aladdin or secret life of pets 2?my 5 year old niece: let's validate jenny slate's career me, getting tickets: today we validate jenny slate's career     ",
      "childs-play-2019": "4/10 at one point i said \"chucky rights!\" out loud and no i don't wanna talk about it     ",
      "aniara-2018": "7/10 high life meets snowpiercer meets synecdoche new york. none of that means anything but the most important thing about me seeing this was that today was my birthday and when i asked my friends if we could drive an hour away to see it they were more than happy to endure the existential swedish space sadness for me. skål!     ",
      "ma-2019": "2/10 i should have made her drink alone     ",
      "long-shot-2019": "7/10 seth rogen: huhuhuhhuhcharlize theron: i am secretary of stateme: this is delightful?     ",
      "tell-it-to-the-bees": "3/10 too many cgi bees, not enough making out. and why did this feel like a poorly written horror movie? what year is it? how could anna paquin betray me like this?     ",
      "the-exorcist": "8/10 \"what an excellent day for an exorcism\"  this is such a good example of genuinely great film editing? also the slow burn is so mesmerizing... most other possession movies made afterwards have no nuance compared to this     ",
      "fight-club": "9/10 \"it doesn't have your name. who are you?\"  somehow one of the most grossly overrated cult films for almost two decades now, and it's still endlessly enjoyable to me anyways. but in special cases, maybe we shouldn't lump potentially entertaining media with the insufferable fan base that's attached to it like a parasite, and instead try to enjoy it for what it is, if possible. there's nothing else about the movie itself i can say here that some guy (even more obnoxious than me) hasn't said already at some point in time, so why even bother     ",
      "lilya-4-ever": "6/10 movies like these are so sensitivity specific to each viewer based on their reaction. how much senseless suffering can someone watch? does it have meaning or strike a chord, or just leave them wondering why the suffering was happening in the first place? in this case it feels genuine until it just becomes too tiring to endure, and for what? suffering just for the sake of it. in this case i think i'll pass, which is a shame because i was on board for quite a while     ",
      "high-life-2018": "8/10 melancholy with dread filling up every corner, but i can't say i wasn't transfixed. and the simple concentrated concept of being lost and horny in space... her MIND     ",
      "dumbo-2019": " i wasn't really paying attention to this BUT dare i say that hollywood is currently stuck in such a constant loop of churning out remakes that they hardly mean anything anymore... what artistic or fresh qualities do these actually bring to the table? we all know that they're mostly aimed to get money out of people in exchange for some stale nostalgia... enough is enough     ",
      "pet-sematary-2019": "2/10 uh     ",
      "shazam": "3/10 wants so badly to be deadpool lite, ends up looking more like the book of henry of superhero movies. i said what i said     ",
      "to-kill-a-mockingbird": "8/10 scout's ham costume.... that's fashion baby     ",
      "gloria-bell": "7/10 \"well, when the world blows up, i hope i go down dancing\"  sebastián lelio is so especially good at these slice of life pieces, this is so melancholy that it almost feels like a documentary     ",
      "five-feet-apart": "3/10 haley lu went from columbus and support the girls to THIS? but honestly i'm not even mad at her, get that paycheck girl     ",
      "fyre-2019": "6/10 rich people are truly dumb as fuck     ",
      "night-of-the-demon": "5/10 that demon lowkey looked like a muppet but back in the day i bet audiences soiled their trousers over it... film and what shocks us about film really has come so far in so short a time, it's quite remarkable     ",
      "gone-with-the-wind": "7/10 here's my review: not gay enough     ",
      "the-guilty-2018": "9/10 \"someone needs us\"  phenomenal, the intensity was so well maintained that it only felt minutes long. the script is solid as a rock and the plot twists were so alarming that i could feel my own heartbeat thudding wildly in my chest. i would definitely definitely check this out, especially since the runtime is a perfect 85 minutes long     ",
      "they-shall-not-grow-old": "5/10 an incomplete list of titles that elderly people have called this movie while buying tickets for it at the theater where i work:  -they shall Not-they won't die in vain-they shall not Die-they shall not Live-they will... not...... grow-they shall  not... oh, you know-[slaps down cash] THE WORLD WAR ONE     ",
      "greta-2018": "7/10 [olivia colman voice] oooo it's genuinely quite stressful     ",
      "a-star-is-born-2018": "7/10 \"is that me?\" \"that's you\"  more than anything, this film signifies the start of awards season for me. the massive hype around it, outcries that claim it's a masterpiece. a part of me wishes i had a similar emotional reaction to it, but i didn't feel too much of anything for the duration. the first half does give off an exciting aura (the concert scenes are captivating), but while we follow the passage of time in the film, i lost...     ",
      "black-panther": "8/10 the best valentine's day gift i've ever received     ",
      "vice-2018": "2/10 best picture showcase: film #6  \"so, we gonna do this thing or what?\"  i can totally understand how some might like adam mckay's style, but i doubt i could like it any less. there are some interesting moments mixed in, glimmers of captivating editing choices and some cool shots, but are surrounded by too many stupid and aimless decisions: various kinds of fonts used on the pop up texts and way too many shifts in tone, songs that end seconds...     ",
      "green-book": "2/10 best picture showcase: film #5 (kinda sorta)  \"you're a prick, you know that?\"the best picture nominee equivalent of watery, room temperature oatmeal. this was so incredibly dull that it baffles me how far something like this can get when such unique, bold and innovative movies have come out in the same year. there have even been much better safe and easily accessible comfort movies this year as well, but somehow this is one of 2018's so called highlights? have...     ",
      "isnt-it-romantic-2019": "3/10 this could not decide what it wanted to be: it had a horrible script to begin with and then tried to ride the line between parody and full on actual rom com, but sadly in this case those two genres might as well be oil and water. foolishness!     ",
      "happy-death-day-2u": "7/10 every other movie about time loops and parallel universes wish they could have what this has... this series makes me so HAPPY, no pun intended     ",
      "side-by-side-2012": "9/10 i really need a sequel where they dive into the cell phone filmmaking trend so i can see christopher nolan's head spin off his neck and bounce onto the ground with a thud while soderbergh candidly records it all with an iphone 8     ",
      "happy-death-day": "8/10 this was so much fun, my depression has VANISHED     ",
      "at-eternitys-gate": "4/10 \"painted reality is it's own reality\"  i can appreciate what this is going for, but i don't vibe with it at all. if i was to compare them, loving vincent was a lot more for me, but i can say that willem dafoe was born to play van gogh. he didn't let us down     ",
      "can-you-ever-forgive-me": "8/10 \"i don't think you're a very nice person, lee\"  been hearing nothing but praise about this for months, and yet was still reluctant simply because the trailers for it painted it as so dull and different than what it actually is. this was so thoughtful and sharp, melissa mccarthy and richard e grant have immense chemistry and make it such an enjoyable watch. the best picture and best director snubs are very obvious here, but it seems a little too ahead of it's time for all that anyway  \"i would agree with you\"     ",
      "roma-2018": "10/10 CIFF 2018: film #3  \"it sounds like this. and smells the same\"  completely breathtaking from the first frame to the last. the little in between moments of every day life make this what it is. a film almost full of those moments, and i could watch hours more of them. rain as seen through a window, water dripping into the kitchen sink, and waves thunderously crashing on the beach. a whole film drenched in perpetual wonder, even in it's darkest...     ",
      "bohemian-rhapsody": "2/10 best picture showcase: film #3  \"don't you see what you could be?\"  the only allure here for me is that queen's music is pretty good, and it also acts as the glue that haphazardly holds it all together. the first time i saw it i was charmed by the musical scenes (and also had no idea about the numerous controversies the film has surrounding it like a wasp hive), but over time i realized this has almost nothing else of...     ",
      "blackkklansman": "8/10 best picture showcase: film #2  \"america would never elect somebody like david duke president of the united states of america\"  still really impactful, but cares more about getting it's overall messages across than it cares about the plot and some of the characters. not to say that's a bad thing, i still think it works just fine in this circumstance: compared to a lot of movies that came out this year, this is an uncompromising vision. and the way it dissects the grotesque birth of a nation is something to behold     ",
      "daddy-day-care": "6/10 where was elle fanning's oscar nom for this     ",
      "the-lego-movie-2-the-second-part": "9/10 there's something so cathartic about the lego style and sounds and these movies are so hilariously well written that i almost feel like a kid again. this is the most joyous movie experience i've had in months  a few various thoughts:1. during one scene i was legitimately thinking, \"does this sad monologue in the lego movie 2: the second part Actually have me drawing comparisons to the hopeless feeling of america under the trump administration? never imagined i would...     ",
      "gold-diggers-of-1933": "7/10 all the women and jokes about depression... we have to stan     ",
      "thoroughbreds-2017": "10/10 AFI 2017: film #3  would you believe me if i told you that this was the funniest fucking movie i've seen all year? i'm in awe. definitely the most sickeningly fun time i've had in a theater in such a while. and honestly? it has the potential to be a cult classic. i absolutely adored this. heathers would be proud     ",
      "cold-war-2018": "8/10 CIFF 2018: film #4  \"i've been waiting for you\"  a far more engrossing love story than i was expecting. the kind of sickening love between two people who often can't stand to be together, but  can't bare to live apart. there's no real happy, no real answer to their problem. the fleeting excitement of reuniting time after time is the height of their long shared journey, and the rest is as much a mystery to us as it is to...     ",
      "interstellar": "10/10 this is definitely one of my favorite films ever, and who knows, in time it might even become my absolute favorite     ",
      "mary-poppins-returns": "3/10 mary poppins floated down with her umbrella at stonewall and said \"here's a brick. have fun\"     ",
      "glass-2019": "6/10 this was... Interesting but also when sarah paulson was reading papers about osteogenesis imperfecta i shouted \"Represent!\" and when mr glass explained what it was i dabbed so. yeah     ",
      "on-the-basis-of-sex": "5/10 AFI 2018: film #1  \"the law is wrong\"  i'm growing tired of the same cookie cutter way of making biopics. this isn't really a bad movie, but the second half lags a lot and it feels really simplistic in a dull way. given a choice, i'd choose the rbg documentary that came out earlier this year  edit: they say the phrase \"on the basis of sex\" at LEAST 7 times. i counted. it was a lot     ",
      "escape-room-2019": "3/10 me in the escape room: deborah ann woll i'm gonna get you outta here     ",
      "if-beale-street-could-talk": "8/10 \"you ready for this?\"  so immaculate that it's almost untouchable in a way, like looking at artwork through glass. it's still a sight to behold, but feels slightly inaccessible somehow. the story and how it's presented and mixed up is my biggest issue here, but it's overall packaged so carefully and beautifully that i find i didn't mind much at all in the end  and nicholas britell really did it again: this is easily the best score of the year. my goosebumps were continuous     ",
      "cactus-flower": "7/10 ingrid bergman comedy queen! can't wait to see how hilarious autumn sonata is     ",
      "mary-queen-of-scots-2018": "2/10 a nightmare, literally a nightmare     ",
      "annihilation": "9/10 long story short the last 20 minutes made my body spontaneously combust and i had to under the skin it out of that movie theater so fast that i left a burning path on the carpet behind me     ",
      "winter-brothers": "7/10 \"one little drink won't kill you\"  it probably sounds like a cliche but this is so different and effective that it's startling: expertly shot, but the soundscape is equally as impressive. the whole thing is so strangely intriguing     ",
      "the-ballad-of-buster-scruggs": "4/10 the ballad of buster scruggs: ★★★½near algodones: ★★★meal ticket: ★all gold canyon: ★½the gal who got rattled: ★★★the mortal remains: ★½overall: no noise     ",
      "galveston": "6/10 \"i'm dyin\"\"aren't we all?\"  i never quite got into it, but i could feel the intent. while a little too bare in plot, one masterful long take reminded me that mélanie laurent is not to be overlooked. if only she could make something as good as respire again...     ",
      "bird-box": "6/10 Boy and Girl the whole movie: mommy?sandra bullock: do i LOOK-     ",
      "national-lampoons-christmas-vacation": "8/10 \"SHE WRAPPED UP HER DAMN CAT\"     ",
      "krampus": "7/10 michael dougherty is now the KING of holiday horror movies and that is a fact     ",
      "a-charlie-brown-christmas": " THAT'S IT!     ",
      "the-house-that-jack-built-2018": "2/10 no     ",
      "i-think-were-alone-now-2018": "8/10 \"there's no before. there's only from now on\"  the plot and characterizations could he stronger, but otherwise this proved to hold it's own in an era already too full of post-apocalyptic stories. understated and so beautifully shot: every lens flare here is a wonder. it might not be bold enough for some, but i feel like this deserves more love     ",
      "shirkers": "7/10 \"he was gone, and so was shirkers\"  incredibly alarming how all it takes is one person to change history and erase what could have been such a meaningful and monumental piece of art. in the universe parallel to ours, shirkers rocked the world     ",
      "private-life-2018": "8/10 \"actually, we wanted to ask you about your eggs\"\"scrambled is good, but however you guys do them is fine with me\"  has to be one of my absolute favorite screenplays of the year, this was so surprisingly satisfying. kathryn hahn finally FINALLY gets the role she always deserved, and it was so well directed and pieced together. i can almost hear greta gerwig laughing while watching this in her manhattan loft     ",
      "lizzie-2018": "5/10 and you thought u-hauling was bad     ",
      "the-wife-2017": "7/10 \"without this woman, i am nothing\"  completely performance driven but in a way that works for me. i thought people might be overhyping her here, but glenn close really nails every single scene. by the final act i was so fully enthralled that i was on the brink of tears. she single handedly did THAT     ",
      "colette-2018": "7/10 keira knightley sweeping across the room to an ornate writing desk and sitting, dipping her pen in ink and hovering it over a blank sheet paper to write 𝓜𝓮𝓷 𝓪𝓲𝓷'𝓽 𝓼𝓱𝓲𝓽 𝓪𝓷𝓭 𝓲'𝓶 𝓰𝓪𝔂 𝓪𝓼 𝓱𝓮𝓵𝓵. 𝓑𝓾𝔂 𝓶𝔂 𝓫𝓸𝓸𝓴𝓼     ",
      "the-santa-clause": "4/10 when my 4 year old niece just said \"i did like it but it wasn't very good\" she really deconstructed film criticism in one fell swoop     ",
      "hearts-beat-loud": "7/10 \"this is a mood piece, it just has to have... a feeling. this has feeling\"  not perfect, but so warm. an extra half star for mitski's music helping two women fall in love..... feels right     ",
      "golden-exits": "4/10 \"desire. that's a novel concept\"  5 minutes in and i could already tell i wouldn't like this but the scene where lily rabe wears a flannel shirt really made it all feel worthwhile somehow. i've said this before and i'll say it again: she should be in everything. lily rabe i would give it all up for you     ",
      "blindspotting": "8/10 \"i am both pictures. see both pictures!\"  unbelievably well made: hilarious and meaningful with an honest beating heart at the core. an absolute must see of the year     ",
      "duck-butter": "9/10 \"we can do it. we can fucking skip time\"  i started to get scared when the reviews for this began to trickle in, but i have to admit that i was completely captivated by it, and not in a sense that i think it's profound or that i'm seeing something that people are missing, but the fucking honestly of it... not everyone is gonna enjoy that or be entertained by that, but it's fascinating to me here: time compacted, emotions...     ",
      "widows-2018": "8/10 \"we're on our own\"  such a slow burn but well worth putting in the time. when the big plan actually kicks into action i was on the edge of my seat. the plot is sometimes a little too thin, but all the leads here are top notch: viola always performs, and cynthia and michelle bring real weight and significance to their roles while elizabeth debicki steals every scene she's in  and it's subtly very gorgeous too: there are some really...     ",
      "breaking-the-waves": "6/10 \"are you sure that's what you want?\"  emily watson gives a stellar and unique performance, but otherwise this only just held my attention. recently my fascination with how lars lays out his morbid stories keep me invested in them, but here that seems to fall short. there's always a generous amount of anguish, but it felt less affecting and the ending less meaningful here. almost pointless. he's a mess and a hot pile of garbage as a person anyways, but...     ",
      "a-goofy-movie": "7/10 when alana haim said \"let me tell you something... it chokes me up to even talk about it. this movie changed my life\" some points were made     ",
      "madelines-madeline": "6/10 do theater kids deserve rights? be honest     ",
      "disobedience-2017": " you guys are gonna HATE me for this one but i thought about it all day and... i'm not rating this yet. my first viewing wasn't ideal because of my mood (in between two back to back concerts) and other factors... when i rewatch it alone in my bedroom at 3 in the morning with tears streaming down my face is when i'll have peace & clarity about it     ",
      "the-girl-in-the-spiders-web": "6/10 \"every day you chose not to save me\"  a bold statement: i think this has worth. i'm just as surprised as you might be, but when the initial annoyance wore off, i found myself caught up in what it has to offer. the david fincher version is one of my all time favorite films, so naturally it was really hard to adjust to this at first, but then i realized something: i can separate the two and see this for...     ",
      "the-kindergarten-teacher-2018": "9/10 \"maybe if we try, we can see something new\"  ridiculously fascinating. there are so many layers to this that suggest questions no one can answer: how far is someone willing to go to protect and inspire the innocence of an objective artistic prodigy? is it from a completely selfish point of view, or a selfless one? the line between socially acceptable and downright scary is thin here, but it rides that line effortlessly. this turns from captivating to uncomfortable so fast that it becomes terrifying, but i couldn't look away. maggie gyllenhaal is spellbinding     ",
      "skate-kitchen": "9/10 \"i don't feel it anymore\"  if it wasn't for the jaden smith subplot, this would be an easy 5 stars for me. that arc unfortunately breaks away too much from the natural energy the first act has going for it, but i'll chalk it up to a poor choice in writing in an attempt to find conflict. this thing is still pure magic regardless. i've always been a skater girl deep down in my heart     ",
      "professor-marston-and-the-wonder-women": "8/10 would you believe me if i told you that one of the most genuine love stories of the year is between the two women in the polyamorous bdsm relationship that inspired wonder woman?     ",
      "burning-2018": "3/10    \"sometimes you can't see things that are too close to you\"  this didn't do it for me at all. i can see the potential appeal, but it couldn't appeal to me less. the ambiguity serves no purpose and has not much endgame, and it feels too long regardless. the movie (and the protagonist) don't seem to really care about her, or what happened to her, but only how HE feels about it. and it feels lazy and pointless     ",
      "non-fiction": "2/10 AFI 2018: film #20  \"i know, you wrote a book about it\"  [me trying to fall asleep while the characters constantly discuss their various affairs and if the internet is evil or not] no noise     ",
      "fugue-2018": "7/10 AFI 2018: film #18  \"it's hard to watch what became of you\"  we almost saw something else today at the fest but i'm really glad we chose this instead. definitely more structured than the lure, and even if the latter is really fun, it can be a little all over the place. this is more grounded in comparison but so rich in emotion that it held my attention the whole time. a hidden gem for sure     ",
      "rafiki-2018": "8/10 AFI 2018: film #17  \"something real\"  super cute and the aesthetic really worked, it was vibrant and easy to get into with more serious storylines mixed in really organically. i think some people might be expecting too much from it, but for a sweet and simplistic movie this was really enjoyable     ",
      "destroyer-2018": "5/10 AFI 2018: film #16  \"you can be better than me\"  this ain't it. the story felt really inaccessible and the stakes were too low to keep the tension. when it kicks up a few times i'm almost fooled, but loses me again soon afterwards. nicole builds a great character, but as the movie's beating heart, she just barely keeps this thing alive. i might like it a little more when i'm in a different mood, but i highly doubt i'll rewatch this any time soon     ",
      "hotel-by-the-river": "4/10 AFI 2018: film #15  \"but still, life goes on\"  full disclosure: i did fall asleep, but i was exhausted today in more ways than one. this was charming and kind of funny until i lost track. but something tells me that even if i didn't fall asleep, my rating would be about the same     ",
      "under-the-silver-lake": "4/10 AFI 2018: film #13  \"we crave mystery ‘cause there's none left\"  completely muddled. too many little offshoot mysteries going on that never get resolved properly or even brought up again, with ambiguous metaphors attached for no good reason. andrew's character is not enjoyable or funny to me, he's boring and obnoxious and lazy. the puzzles he spends his time with carry no real weight and do nothing for me. i don't hate his character, i could just care less  but...     ",
      "in-fabric": "3/10 AFI 2018: film #11  \"don't tell me you're scared of a dress\"  a feature length explicit goosebumps book adaptation, but to say that would be insulting to goosebumps     ",
      "happy-as-lazzaro": "5/10 AFI 2018: film #10  \"he'll follow us, you'll see\"  such a cute character, but otherwise, it wasn't for me. too much and too little going on simultaneously     ",
      "sunset-2018": "10/10 AFI 2018: film #9  \"it's starting all over again\"  my heart is still pounding. a riveting mystery where everyone we encounter is a suspect. the lead digs for the truth and we fall further into confusion and madness, the world flying past as it burns around her. there's a lot here that i'll have to think about, but i absolutely loved this     ",
      "shoplifters": "9/10 AFI 2018: film #8  \"but sometimes it's better to choose your own family\"  familiar and warm. the last act raises the stakes, but it's the family dynamic that shines     ",
      "the-chambermaid": "8/10 AFI 2018: film #6  \"my name is eve\"  says so much about a character without the character herself saying much at all. a little long, but still made with such care     ",
      "knife-heart": "6/10 AFI 2018: film #5  \"yesterday we came, tomorrow we die\"  part gritty realism, part dreamy fantasy, but all together really really gay. the mystery is more interesting than i thought it would be, and there are some beautifully nasty moments that stand out. overall an interesting way to spend an afternoon     ",
      "piercing": "6/10 AFI 2018: film #4  \"what's the nastiest thing you've ever done?\"  a good time, but didn't do enough to satisfy me. my hope was this would go in a more gory direction, but it takes a different route instead. not bad, just different     ",
      "ash-is-purest-white": "7/10 AFI 2018: film #2  \"but what about me?\"  one of the most interesting protagonists of the year, this was such a nice surprise but the final act kind of slowed down too much for me. i would compare it to the before trilogy in a more compacted sense, but in this case i was rooting for the female lead instead of their romance     ",
      "the-parent-trap-1998": "9/10 these asshole parents really snapped and looked right at their newborn babies and said \"OK THAT'S IT! you take a twin and i take a twin and we NEVER SPEAK AGAIN.... our daughters will just have to live without their twin sister AND one of their parents and shall not even know of their existence.... it's a very rational plan and not evil in the slightest\" the double lindsay lohans probably had the FATTEST therapy bills because of them     ",
      "spirited-away": "10/10 maybe definitely the best animated film of all time     ",
      "mid90s": "4/10 \"you're just a little fucking kid\"  i've been avoiding reviewing this for days. don't get me wrong, at first i was enjoying this on the surface, but underneath, i found it dry and lifeless. the only source of true energy is what the kids bring to the table and the natural chemistry they bounce around during a scene. otherwise, it fell completely flat. the throwback style of the grainy and colorless variety gets old fast. the plot is non-existent and...     ",
      "green-room": "9/10 i think i have internal bleeding because this movie just beat me up with a bass guitar     ",
      "the-witch-2015": "6/10 not very scary but i have an urge to use \"thee\" and \"thine\" in normal conversations now     ",
      "halloween-2018": "3/10 \"happy halloween, michael\"the thing about the original that's drawn people in for 40 years is how well it's crafted: the music, the specific angles and the way the camera swings around. the tension and the mystery of it. but like so many before and after it, this one genuinely great movie fell victim to franchising, which always waters the original down if the rest are compared to it  but honestly? my biggest issue here is my complete lack of interest...     ",
      "feast-2005": "8/10 \"choke on it\"  good to know this is still a monster masterpiece     ",
      "boy-erased": "3/10 CIFF 2018: film #6  \"whatever happens next, it is still your choice\"  this felt like a horror movie. at first told with some interesting and even entertaining editing and music choices that keeps the pace flowing nicely, eventually that gimmick drops off and we're left staring right at the dark subject matter. and there's no looking away  this is the kind of movie i struggle with rating, because i can tell it was made with good intentions and everyone involved...     ",
      "censored-2018": "9/10 CIFF 2018: film #5  \"to what end? to what purpose does this serve?\"  pieced together so well and told with so much truth, this was a really affecting experience. starts as a look at censorship and develops into something much deeper and maybe even more sinister: a look at the films themselves in the first 70 or so years of cinema, and the toxic patterns that repeat over and over in such a male dominated industry. so riveting i wish i could watch it again right now and show it to everyone i know     ",
      "wildlife-2018": "8/10 CIFF 2018: film #2  \"what kind of man leaves his wife and child in such a lonely place?\"  at some point while growing up, everyone eventually realizes that their parents are not just their parents. they're people with their own demons and problems that just happened to have a kid, or a few. and some even discover, to their horror, how messy their parents can be, or have been all along  the messy decline in this happens a little suddenly,...     ",
      "jumpman": "7/10 CIFF 2018: film #1  \"you are my superhero\"  it's really scary how many people you might encounter in your life that will only show you interest or affection if you have value to them. this was simplistic and straightforward in a way, but every scene demanded my attention and there's some masterful slow motion sequences throughout. no shot was wasted here. and he sure did jump 😔👏     ",
      "bad-times-at-the-el-royale": "8/10 \"which side are you on?\"  lots of people have already compared the style of this to tarantino, so i won't, but this is my subtle way of doing it anyway. this was way too enjoyable, but mostly because of how slick it's pieced together. extremely well crafted, especially for how it comes off when you catch the trailer before another movie or just a promotional image of shirtless chris hemsworth. someone remind me later to rewatch the cabin in the woods before october is over     ",
      "a-nightmare-on-elm-street": "9/10 \"what the hell are dreams anyway?\"  i really don't care how corny this actually is, the concept alone terrifies me. so much so that i've actively feared watching it for years. it wasn't all that scary to actually watch now, but instead thankfully rode the perfect line between spooky and campy. i unapologetically loved this, and the startling dream concepts within the movie are so original and horrific and sometimes hilarious that i was completely drawn in from start to finish. and a highlight of the screening: the whole audience broke into hysterical laughter when nancy pulled the coffee maker out from under her bed     ",
      "halloween-1978": "8/10 \"i'll kill you if this is a joke\"  so much fun and genuinely had my heart racing, i'm so glad i got to see this in a theater full of people laughing and clapping     ",
      "the-killing-of-a-sacred-deer": "9/10 i really landed in LAX and we went DIRECTLY to the theater to see this. i didn't come to los angeles to have fun i came to win     ",
      "first-man": "7/10 \"it'll be an adventure\"  in all honesty? i was way too tired to experience this fully. and a little too predictable for me at times, but i figured it would be. the style isn't what i thought it would be though: a little gravity, a little arrival, even a hint of the tree of life. and the score is SO fresh. give me time, i'm definitely planning to rewatch it when i can     ",
      "the-lobster": "9/10 just 👏 fuck 👏 me 👏 up 👏     ",
      "dogtooth": "6/10    COME ON BRUCE! GET THE FUCK OUTTA THE TRUNK!!!     ",
      "the-thing": "8/10 \"you gotta be fucking kidding\"  the gnarliest practical special effects i've seen since alien. i'll gladly take any amount of blood and gore on film any day of the week, but some of this shit made me gasp. SICK     ",
      "hell-fest": "5/10 this is exactly why i don't fuck with haunted houses, mazes or hayrides. horror movies are fun, but paying to have someone chase you around with a chainsaw is just clownery     ",
      "venom-2018": "3/10 would you believe that this is the first feature film with a script completely auto generated by a robot? it's not true, but it would make sense     ",
      "possession": "8/10 \"yet i can't exist by myself because i'm afraid of myself, because i'm the maker of my own evil\"  SHE?     ",
      "evil-dead": "8/10 \"feast on this, motherfucker\"  some of the best gore i've ever seen. i can't possibly hate a movie where it rains blood     ",
      "i-tonya": "8/10 AFI 2017: film #11  so horrific in scope and subject matter that it almost makes me feel guilty for enjoying it so much (even when the darkest elements are often portrayed comedically) but overall has so much chaotic life bursting forth that i couldn't help but love it     ",
      "tangled-2010": "6/10 i wanted to see totoro in the theater today but this was playing too and my niece wanted to see it more. lms if u cried 😔     ",
      "assassination-nation": "5/10 i kind of... hated this, but i can't say i didn't have a little fun with it. hari nef is such a goddess and a natural talent     ",
      "the-nun-2018": "2/10 i make it a rule never to walk out of movies, but i was literally falling asleep because of how tired and bored i was... taissa farmiga forgive me     ",
      "hold-the-dark": "7/10 \"now you understand about the sky, don't you\"  at first i was sure this was going to lack the tense bite of his past two films, going into more ambiguously atmospheric terrain, but eventually this rears it's ugly head and bites back like i was hoping it would. this is definitely jeremy saulnier: still focusing on the violent decisions of people and the absolute chaos that crackles in the air in the aftermath. the slow burn of reality and how...     ",
      "a-simple-favor": "7/10 not the best mystery i've seen today, but the biggest thing i took away from this is something i already knew going in: that blake lively is super hot     ",
      "harry-potter-and-the-deathly-hallows-part-2": "7/10 (part of the harry potter weekly double feature)  on one hand, i have so many fucking issues with the changes made when adapting the whole battle of hogwarts. but on the other hand! i cry like a baby ANYWAYS! so what does it matter! i love this series BITCH. i ain't never gonna stop loving this series. BITCH     ",
      "harry-potter-and-the-deathly-hallows-part-1": "9/10 (part of the harry potter weekly double feature)  i can't really explain why, but i've always loved this one. maybe because it's so loyal to the book for me and i simply love the big emo camping adventure. harry and ron really woulda died without hermione and her tiny ass bag huh     ",
      "searching-2018": "9/10 one of the best wide releases of the whole year, this was so engrossing     ",
      "tomb-raider": "7/10 alicia vikander's arm and back muscles... i'm free on thursdays but i will honestly clear my entire schedule at this point just please call me     ",
      "harry-potter-and-the-half-blood-prince": "7/10 (part of the harry potter weekly double feature)  could very well be my least favorite film in the series, but it's also probably my least favorite book in the series too, if only because i find the gap between the monumental order of the phoenix and adventurous deathly hallows to be... trivial, but still enjoyable. this one is all over the place, but revisiting it now was fun because of how much i still LOVE ron and hermione.... and harry...     ",
      "harry-potter-and-the-order-of-the-phoenix": "9/10 (part of the harry potter weekly double feature)  SUCH a good one. this really sets up the tone for the second half of the film franchise, most notably for me in the soundtrack, which is one of the strongest in the series. the book is so massive and in depth that the amount of stuff cut from this should drive me up the wall, but it's so enjoyable that i can't help but be won over every time. and the big group scenes in this are still so much fun. dumbledore's army: still recruiting, bitch     ",
      "mandy-2018": "6/10 \"you exude a cosmic darkness. can you see that?\"  maybe worthwhile for the grisly gore, but takes quite a while to get there. and the more existential layers this tries to peel back, the less i care about it. i'd rather rewatch mom and dad (2018)     ",
      "slice-2018": "2/10 \"holy shit... did i die?\"\"yeah i think you did\"\"aw SHIT! THAT FUCKIN' SUCKS!\"  i didn't know a24 produced disney channel original movies!     ",
      "harry-potter-and-the-goblet-of-fire": "8/10 (part of the harry potter weekly double feature)  i have such a complicated relationship with this movie. fun fact: 11 year old lucy left the theater after the midnight screening and started crying out of sheer disappointment! that's how much i love the book, and they left so much of the book out of the movie that it blindsided me at the time. but to be fair, the book is massive compared to the first three, and this does it's...     ",
      "harry-potter-and-the-chamber-of-secrets": "10/10    (part of the harry potter weekly double feature)  i've said this before and i'll say it again, chamber of secrets is SO underrated. 12 year old harry really stabbed the shit out of that diary before he even knew what the fuck a horcrux WAS. ICON!     ",
      "sharp-objects": "9/10    \"don't tell mama\"  the ending of the YEAR. i'm about to open my bedroom window and scream into the night     ",
      "christopher-robin": "6/10 if my niece hadn't been distracting me by squirming through every single second of this? i would have been sobbing :/     ",
      "the-rider": "7/10 [yeehaws, but sadly]     ",
      "the-meg": "6/10 \"that thing is the devil!\"  an extra half star because my friends were scared to death and jumping out of their seats every time the biggest shark in known existence somehow snuck up on everyone without being noticed. which happened a lot. she's sneaky     ",
      "eighth-grade": "9/10 \"just cause things are happening right now, doesn't mean they're always gonna happen\"  it won me over. and i'm so glad i saw this with friends. otherwise, it probably would have felt a lot heavier than it did. i was able to laugh along with them to things that sometimes did sting moments after our laughter faded away, and then we would continually cringe in unison. i thought people might be overhyping it a bit, but (for me) this really...     ",
      "slender-man": "2/10 https://youtu.be/Z7c6RgddcYE     ",
      "lick-the-star": " this inspired phantom thread     ",
      "sicario-day-of-the-soldado": "3/10 if this movie had a face i would punch it     ",
      "mission-impossible-fallout": " i saw this at the drive-in but wasn't paying attention at all so like... sorry scientology     ",
      "the-heat": "9/10 \"you gotta... vent.. that.. furnace\"     ",
      "the-curious-case-of-benjamin-button": "8/10 so he was an old dude for like 2 hours and the hotter he got the more i knew it was gonna fuck me up??? and it did??? i cried so hard when he was a baby like wtf???????? i'm fucked up     ",
      "zodiac": "7/10 \"just cause you can't prove it doesn't mean it's not true\"  i was really hoping this would grow on me more, but i still feel left in the dark. it's riveting at times, and they can only do so much with a muddled true story, but it's... so fucking long. and structurally it doesn't keep rhythm for me, the text popping up every few minutes to remind you what you're looking at and when exactly it was. the real life...     ",
      "panic-room": "9/10 \"nice house you guys got\"  as mainstream a thriller as you would find in 2002, but just as stylish as anything fincher had made up until then. i personally think this is overlooked for how effectively it works within the walls of a single location, and the \"cutting edge\" and slightly goofy cgi just make it more fun. oh, and casting jodie and kristen as mother and daughter makes this an lgbt film, i don't make the rules     ",
      "the-game": "8/10 goddammit fincher     ",
      "se7en": "9/10 \"ladies and gentlemen, we have ourselves a homicide\"  seems slightly lackluster now compared to his later films, but you can't deny it's lasting effect. a grim 90's film for the ages. and it's pronounced \"Sa-Seven-En\"     ",
      "unfriended-dark-web": "8/10 takes a lot of the simplistic elements that made the first movie enjoyable for me and turns them into something genuinely scary this time. this is no ghost, the threat is very possible and very ominous. there are so many people that hate the style of these movies, and how they switch from campy to silly to morbid, but it all draws me in every time     ",
      "first-reformed": "8/10 in a way, i wanted to dislike this, but by the time all the old uptight christian couples in the audience gasped i knew it was too late for that     ",
      "sorry-to-bother-you": "8/10 capitalism really be like that huh!!!     ",
      "swimmer": " lynne ramsay can do with 13 minutes what some directors can't do in the span of their entire filmography     ",
      "the-first-purge": "7/10 maybe the 4th time's the charm. this series is obviously super repetitive and kind of corny but there were genuinely some moments of this that made my jaw drop for a second. at one point i gasped and said \"the cinematography...\" and my dad looked at me as if i had lobsters crawling out of my ears     ",
      "hotel-transylvania-3-summer-vacation": "4/10 EXT. THE AFTERLIFE - DAY  mary shelley: so, have you seen the third one yet?bram stoker: mary, you know damn well i gave up half way through the first film after i realized it featured the voice \"talents\" of adam sandler. never again     ",
      "mamma-mia": "5/10 amanda seyfriend i'm free on thursdays     ",
      "ant-man": "3/10 snubbed at the razzies     ",
      "lean-on-pete": "9/10 \"if they ever thought of me, i'd rather they think of me as being ok\"whatever i was expecting, it wasn't this: a crushing, singular vision. completely captivating and even cathartic. an intimate look at the way people in our lives come and go, but in the end we only have ourselves and whatever keeps us going     ",
      "wont-you-be-my-neighbor": "8/10 the collective sigh of everyone in my theater when it ended and we're all trying to inhale our tears     ",
      "american-animals": "8/10 what was working so well as a comedy became dark and realistic FAST, but for the most part i think the genre shift is effective. my rating for this is probably gonna go up or down with some reflection, only time will tell  also, the best line in the movie, in reference to reservoir dogs: \"it's probably my least favorite tarantino film\"     ",
      "a-serious-man": "8/10 \"everything that i thought was one way turns out to be another\"  the coens really can squeeze metaphor into anything huh     ",
      "the-purge-election-year": "4/10 so i put my HANDS UP THEY'RE PLAYIN MY SONG AND THE BUTTERFLIES FLY AWAY     ",
      "before-midnight": "7/10 \"well... it must have been one hell of a night we're about to have\"  ...oh     ",
      "before-sunset": "9/10 \"how am i doing?\"\"still here\"\"good. i like being here\"  ...OH?     ",
      "hereditary": "9/10    youtu.be/PCZ2Dp6Is9M     ",
      "night-and-fog": " i can't in good conscience rate the realities of human suffering. this is gonna stick with me for a while     ",
      "desert-hearts": "6/10 yeehaw!     ",
      "the-celluloid-closet": "8/10 \"i get so angry about what hollywood will do with an original story or script to get rid of the lesbian element, that i feel like standing up in the theater and just shouting: these characters are dykes and this movie isn't saying so\"  representation is one of the most important aspects of art, otherwise we'd just be going around in circles. i'm suddenly so relieved to be living in the time i do, even for a moment, compared to the scarce, grim and repressed films of the past. i almost feel spoiled     ",
      "hannah-gadsby-nanette": " tore apart and reinvented the art of stand-up comedy in 60 minutes? maybe so     ",
      "incredibles-2": "7/10 dare i say... jack-jack is more iconic than any of the avengers     ",
      "hotel-artemis": "6/10 the casting director on their fourth cup of coffee: how would you like to play a live action cartoon villain in this probably semi-shitty movie but also jodie foster is there so can it really be shitty if jodie foster is there?  every celebrity in this: i don't know what you just said but i heard the words Jodie Foster so i guess     ",
      "raising-arizona": "9/10 \"you go RIGHT back up there and get me a toddler\"  my dad was just in hysterics for every second of this even though he's seen it a thousand times and it only made it infinitely more hilarious     ",
      "the-tale": "9/10 \"i find that i trust him so much, i never realize where he's leading me\"  horrific, but demands to be seen. the only comfort here is that it's skillfully told by a woman from her own experience and on her own terms. and in her own words. and now more than ever, it's the time to listen     ",
      "oceans-eight": "8/10 so cookie-cutter for it's genre but in the most enjoyable way. maybe it could have been better in some aspects, but i was having so much fun that it didn't matter to me at all. this is what a really good popcorn movie looks like     ",
      "flower-2017": "9/10 definitely not for everyone, and had a lot of elements that shouldn't work, but on some singular level everything mostly comes together and it works for me. also, zoey deutch gives maybe the best \"teen\" performance i've seen in years (i said what i said) and dylan gelula is fucking hilarious (follow her on twitter)     ",
      "action-point": "2/10 they really made this movie on purpose huh     ",
      "upgrade": "6/10 a little cheesy sometimes, but i did really get a kick out of this. the camerawork in the action scenes alone make it worthwhile. i do have something to say however, and i don't know where else to put these thoughts, so it's gonna have to be here:   hollywood and the media in general has such an obsession with stories about disabled people becoming able bodied again. through science or even a miracle, rarely are physically disabled characters given spotlight...     ",
      "avengers-infinity-war": "7/10 when this ended my friend pulled out her phone, went to dial 911 and said \"i'm calling the police\"     ",
      "revenge-2017": "9/10 cameras $200lighting $150actor's salary $800fake blood $3,600editing $150someone who is good at the economy please help me budget this. my movie is dying     ",
      "a-mighty-wind": "7/10 \"can you have an actual three dimensional.. object... that represents the thing that it actually is, can that be next to something that it's pretending to be?\"     ",
      "life-of-the-party-2018": "3/10 christina aguilera has a cameo in this. and that really sums it up     ",
      "deadpool-2": "4/10 two things:1. domino has the coolest power of ANY cinematic universe and2. lesbian..... superhero..... couple     ",
      "waiting-for-guffman": "7/10 \"i always have a place at the dairy queen\"     ",
      "gods-own-country-2017": "8/10 honestly we've hit the point in film where the tenderness and longing and understanding expressed in almost any movie between lgbt characters is simply so much more profound than most straight romances in film history     ",
      "tully-2018": "7/10 mackenzie davis cuddling a newborn baby made my womb ache     ",
      "john-mulaney-kid-gorgeous-at-radio-city": " STREET SMARTS!     ",
      "blockers": "5/10 \"love myself\" is now a lesbian anthem     ",
      "captain-america-civil-war": "7/10 Avengers 2.5: Sorry For Age of Ultron     ",
      "avengers-age-of-ultron": "7/10 mary-kate and ashley's sister and Kick-ass did not get enough screen time     ",
      "captain-america-the-winter-soldier": "8/10 this is essentially a surprisingly decent spy thriller where steve rogers flirts with all his friends... love that     ",
      "the-avengers-2012": "7/10 me, every day of my life: the mcu ain't shit  the avengers (2012): bitch?  me, suddenly filled with nostalgia of the summer it came out: sitting on the hood of a car at the drive-in numerous times to rewatch it with my friends and having just an absolute all around fun time: ...what the fuck do you want     ",
      "three-colours-white": "6/10 amy dunne watching this and taking notes: 👀📝     ",
      "isle-of-dogs-2018": "6/10 easily my least favorite wes anderson movie in the last decade, maybe he's finally on the decline   this is still cute enough and fun enough to enjoy, i love the symmetry and the snappiness and i still smiled a lot, but the story and it's characters and it's dialogue feel spaced out and disconnected (it probably has something to do with the fact that half or so of the entire cast speak words that aren't translated, leaving a gap at...     ",
      "visions-of-light": "10/10 a 1992 documentary about cinematography is MY comfort movie? maybe so     ",
      "fat-girl": "8/10 \"male fantasies, male fantasies, is everything run by male fantasies? up on a pedestal or down on your knees, it's all a male fantasy: that you're strong enough to take what they dish out, or else too weak to do anything about it. even pretending you aren't catering to male fantasies is a male fantasy: pretending you're unseen, pretending you have a life of your own, that you can wash your feet and comb your hair unconscious of the ever-present...     ",
      "the-hours": "8/10 when she said \"i'm living in a town i have no wish to live in. i'm living a life i have no wish to live\" WOW..... i felt that     ",
      "ready-player-one": "7/10 almost every second of this kept me entertained, but by the last few scenes the effect started to wear off. i had fun, but nothing really resonated with me otherwise  the second challenge and the iron giant were fuckin SICK though     ",
      "the-night-of-the-hunter": "8/10 \"it's a hard world for little things\"     ",
      "paint-it-black-2016": "8/10 a startling vision and the role alia shawkat has deserved for the past decade     ",
      "pacific-rim-uprising": "6/10 maybe not a very good movie, but by the time one of the jaegers used their gigantic robotic hands to flip off a kaiju that had just been beaten to a pulp, i realized i was having too much fun in the moment to care     ",
      "pacific-rim": "9/10 still holds up as one of the most entertaining and well rounded sci-fi action movies of the past decade in my eyes. by the end of this rewatch i was transported back to 2013 when i saw this at the drive in at least twice that summer with my friends. so glad to see it's aged well     ",
      "unsane": "8/10 \"sweet dreams\"\"drop dead\"  the best lifetime movie i've ever seen, but as a regular Motion Picture? it has it's issues. i think i'm gonna leave it at that for now     ",
      "i-love-you-man": "9/10 youtu.be/G0le3GWyW-k     ",
      "margarita-with-a-straw": "8/10 not without it's flaws, but gets a half star boost for being personally and sometimes painfully relatable to me in numerous ways (ways that are almost never ever portrayed on film)     ",
      "vertigo": "7/10 what annoyed me more? the last act of this, or the toothache that's been gnawing at me all day? the toothache wins, but just barely     ",
      "a-wrinkle-in-time-2018": "4/10 it means well. this has a pulsating heart, beating deep beneath miles of mess. i can feel it, the movie itself constantly reminds me it's there, but sometimes that isn't enough  the headlining actors make this a painless and sometimes joyful ride, and the child actors do bring charm to round out the cast, but the script is incredibly weak, and the plot is even weaker. and people claim that interstellar doesn't make sense..... the visuals do heighten the experience,...     ",
      "close-encounters-of-the-third-kind": "7/10 DO ᵈᵒ ᴅᴏ dₒ do     ",
      "the-square-2017": "7/10 thought i would love this, but it has about 6 different movies crammed into 1 and didn't do much for me. although, the two main elisabeth moss scenes are absolutely hilarious     ",
      "mom-and-dad-2017": "8/10 \"we wanna trust you, we really do... but you don't make it easy\"  so much fucking fun. and probably as long as it needs to be, but i could really watch another hour of this. the ending is kind of abrupt, but honestly, it still works. i've seen complaints about the directing and pacing, and i can see the problem areas clearly myself, but the editing and score were pieced together so uniquely that i didn't really mind. even it's...     ",
      "the-better-angels": "6/10 indie darling brit marling... always barefoot in the woods or something.... love that     ",
      "la-confidential": "7/10 a really good walkthrough of l.a. noire     ",
      "sing-street": "3/10 eh     ",
      "his-favorite-person": " \"my rubber band just broke\"\"are you gonna be ok?\"\"it's just a rubber band\"  simplistic and so effective. this is hands down the most proud i've ever been of your work, jacob. this feels like something bigger than it's parts. the writing is solid, the storytelling is your best yet. jacob ward gives a great performance, i'm still so impressed. i absolutely loved the score, and the coloring came out so gorgeous. everything comes together and it feels really...     ",
      "get-out-2017": "8/10    i'm never gonna think about jeffrey dahmer the same way again     ",
      "the-post-2017": "8/10 me six months ago: what the hell kind of boring shit is this gonna bespielberg: happy awards season. here's a movie, eat it upme now: delicious. finally some good fucking food     ",
      "call-me-by-your-name": "5/10 AFI 2017: film #1  watching this really was the definition of neutral for me, if not bordering on slight dislike. i suppose i can understand why people would fall in love with this movie, but it feels more like a puzzle with mostly missing and broken pieces and i'm not sure what ‘brilliant' bigger picture i'm supposed to be seeing. also: the sufjan songs were the only thing i genuinely loved, he did an incredible job for just bringing a few songs to the table     ",
      "darkest-hour": "4/10 best picture showcase: film #6  joe wright's directing is strong, but my fatigue is stronger. i slept through at least 30 minutes of this     ",
      "dunkirk-2017": "8/10 i saw this in imax and i need a fucking xanax     ",
      "the-shape-of-water": "9/10 dark amelie show me the forbidden love story the government doesn't want us to see     ",
      "three-billboards-outside-ebbing-missouri": "5/10 CIFF 2017: film #5  one of the very first \"i played myself\" films of the year. gotta love the soft sting of disappointment!     ",
      "lady-bird": "8/10 CIFF 2017: film #2  definitely a movie i would have fallen head over heels for in my teens. it has so much heart and humor that my cheeks almost hurt from smiling. if saoirse somehow landed an oscar nom for brooklyn, she absolutely deserves one for this     ",
      "phantom-thread": "8/10 best picture showcase: film #1  so pretty that it's almost insufferable. a part of me wanted to hate it (and a small part of me did) but the end won me over and the score is just too enchanting for me to ignore. you win this time pta........     ",
      "early-man": "6/10 claymation movies that are just ok are still better than anything illumination entertainment puts out     ",
      "ex-machina-2015": "8/10 it took me way too long to finally see this don't look at me     ",
      "dog-day-afternoon": "9/10 fuck out my way when you see me... i'm rollin' with the lgbt     ",
      "faces-places": "9/10 the amélie of documentaries?     ",
      "loving-vincent": "9/10 i love and support these moving globs of paint     ",
      "dr-strangelove-or-how-i-learned-to-stop-worrying-and-love-the-bomb": "9/10 \"i'm sorry too, dimitri. i'm very sorry. all right, you're sorrier than i am! but i am sorry as well. i am as sorry as you are dimitri, don't say that you're more sorry than i am because i'm capable of being just as sorry as you are! so we're both sorry, alright?\"     ",
      "the-cabinet-of-dr-caligari-1920": "8/10 it's german. black & white. and silent     ",
      "the-cloverfield-paradox": "6/10 the release is a game changer. the movie itself however... is not. that's sad huh     ",
      "polina-2016": "7/10 some select scenes amplify the movie and bring it to a new level, with a pulsating score giving them life, but the spaces in between feel slightly hollow and uninteresting. polina herself feels distant from us and the story, even though she's front and center, but maybe that was the point. a solid 3 stars but the ending earns a half because it was maybe the best part of the film     ",
      "paddington-2": "7/10 sally hawkins deserves that oscar, and not just for the shape of water. i speak that into existence, i've planted the seed and i will see the harvest     ",
      "paddington": "8/10 oh..... i get it now     ",
      "the-lego-batman-movie": " not rating this yet because i didn't actually get to finish it BUT... i really thought nothing could be as iconic as margot robbie's harley quinn... until i heard jenny slate's harley quinn     ",
      "ponyo": "7/10 the credits: PONYO PONYO PONYO FISHY IN THE SEA!  me: https://giphy.com/gifs/126bpm-dancingatclub-5n067EUZwH8cvtRfGz     ",
      "zathura-a-space-adventure": "7/10 GIMMIE A JUICE BOX BIATCH     ",
      "bpm-beats-per-minute": "8/10 anyone else flat out sobbing on this monday night     ",
      "the-florida-project": "9/10 american honey jr  (but i also don't wanna minimize this with a joke because??? it made me feel every emotion at once for a full 115 minutes)     ",
      "blade-runner-2049": "9/10 i would love to make jokes right now but this is truly... a tremendous piece of art. i'm speechless     ",
      "the-salesman-2016": "8/10 \"i behaved badly\"  captivating with a stellar ending. i'm glad i got to catch this in the theater     ",
      "proud-mary": "5/10 could have been and should have been so much better     ",
      "dogville": "9/10 after a long period of consideration, i've finally decided on an archnemesis: uh lars von trier if you're reading this, i'm coming for you     ",
      "the-room": "10/10 webster's dictionary defines motion picture as a series of pictures projected on a screen in rapid succession with objects shown in successive positions slightly changed so as to produce the optical effect of a continuous picture in which the objects move. but what does it truly mean to create art through filmmaking? to show the beating heart of human emotion, and humanity itself?  this may be the closest we as a species will ever get to true artistic brilliance     ",
      "inglourious-basterds": "10/10 \"i think this just might be my masterpiece\"  AND IT IS     ",
      "the-disaster-artist": "6/10 i think the biggest reason this concept doesn't work for me at all is because this movie tries to show us the \"real tommy\" behind the scenes and what he was thinking and feeling, when in reality he is a complete enigma and to assume anyone knows the first thing about him is foolish     ",
      "most-beautiful-island": "7/10 ah!     ",
      "downsizing": "5/10 a concept that would have been much better in the hands of yorgos lanthimos or even someone like charlie mcdowell. i was pretty intrigued while i was watching it, but it left a bad taste in my mouth afterwards. my original review was just gonna be \"???\" which pretty much sums it up     ",
      "the-greatest-showman": "2/10 a movie about a circus and the strangest concept was michelle williams smiling and being happy the entire time     ",
      "all-these-sleepless-nights": "6/10 terrence malick when he first discovers this: McScuse me bitch??     ",
      "13th-a-conversation-with-oprah-winfrey-ava-duvernay": " ava duvernay is truly one of the most intelligent, insightful and important voices in directing right now and we should all be paying attention     ",
      "good-time": "7/10 i'm never drinking sprite again     ",
      "mudbound": "7/10 dee rees is a FORCE of NATURE     ",
      "berlin-syndrome": "8/10 it's remarkable that a basic trope of a plot can be transformed and reborn as something that's skating on the edge of brilliance in more ways than one     ",
      "woodshock-2017": "7/10 kirsten dunst, mother of depression... i would follow you anywhere     ",
      "novitiate": "7/10 youtu.be/XCy9v-cQgp4     ",
      "mollys-game": "5/10 AFI 2017: film #12  what a colossal letdown. i had a feeling aaron sorkin wouldn't be a natural talent at directing, but i had no idea he would throw together something this haphazard and lifeless and incoherent. it has a couple great sequences but it ends up equaling out to a big old corny mess. i intend on giving this another try when it officially comes out but right now it feels like a fucking shame  BY THE WAY this...     ",
      "happy-end-2017": "6/10 AFI 2017: film #10  the whole duration of the movie i had a piece of popcorn stuck between two of my teeth and i couldn't get it out and it still made me less angry than this made me     ",
      "the-endless": "5/10 AFI 2017: film #9  when an ambitious indie sci fi drama doesn't make sense and doesn't live up to it's potential? love that     ",
      "on-body-and-soul": "7/10 AFI 2017: film #8  i'm a vegetarian now and also soulmates are real     ",
      "summer-1993": "6/10 AFI 2017: film #7  quaint, but is that enough? who knows. also i was exhausted during this so who am i to judge     ",
      "a-fantastic-woman": "8/10 AFI 2017: film #4  vibrant and touching, but also doesn't reach it's full potential. the highest point is definitely daniela vega who is wondrous and her presence is profound (especially in real life)     ",
      "in-the-fade": "8/10 CIFF 2017: film #3  listen.... the last 15 minutes of this filled me with so much anxiety that i thought i was going to COLLAPSE and the last two shots ALONE made me raise my rating half a star     ",
      "gemini-2017": "5/10 CIFF 2017: film #1  this is what lola gets for screwing over amy dunne in gone girl     ",
      "thor-ragnarok": "6/10 hearing taika waititi's new zealand accent coming out of a giant rock creature in a marvel movie that HE directed is one of the proudest moments i've had in theaters all year  also tessa thompson is the most beautiful person on this EARTH     ",
      "ingrid-goes-west": "7/10 i can't wait to go back to LA next week and have an existential crisis every time i pull out my phone to snap a picture because i remember this movie exists     ",
      "princess-cyd": "6/10 CIFF 2017: film #4  a few things bothered me, otherwise my rating would be higher... BUT this really was so adorable!     ",
      "tangerine": "7/10 i'm in love     ",
      "starlet": "9/10 i'm the dog     ",
      "the-bad-batch": "7/10 \"what are you doin right now? do you wanna hang out or somethin?\"  i uhhhhhh really wish i didn't like this as much as i did     ",
      "awol-2016": "5/10 ..... i don't know what i expected     ",
      "landline": "8/10 jenny slate has such a calming aura and i trust her with every bone in my body     ",
      "battle-of-the-sexes-2017": "7/10 a soft gay love story marketed as a goofy steve carell comedy drama about tennis     ",
      "henry-gambles-birthday-party": "8/10 gorgeously authentic. makes me even more excited that i already have my ticket for princess cyd     ",
      "blade-runner": "8/10 NEON BLUE     ",
      "home-again-2017": "2/10 this is the corniest thing i've ever seen and i live in a town that has literal cornfields surrounding it     ",
      "a-little-princess-1995": "8/10 me as a small child, sobbing: why is this movie so good?me now, seeing the names alfonso cuaron and emmanuel lubezki in the credits: That's Why     ",
      "kill-bill-vol-2": "10/10 listen..... the entire chapter \"elle and i\" is absolutely one of the best sequences that quantum toronto has ever MADE     ",
      "kingsman-the-golden-circle": "4/10    me: this is bad?julianne moore: fuck you elton! KILL ELTON JOHNme: this is still bad but i'm so happy julianne moore has an oscar     ",
      "kikis-delivery-service": "7/10 pretty fucked up that i wasn't born a cartoon witch     ",
      "a-ghost-story-2017": "9/10 time isn't real, but depression is eternal     ",
      "mother-2017": "6/10 kinda like a charlie kaufman movie... if he did a bunch of coke and speed read the bible     ",
      "xx": "6/10 annie clark could literally do or create ANYTHING and i wouldn't be surprised at all. if it was announced tomorrow that she was joining a space mission i'd be like \"makes sense\"     ",
      "cars-3": "6/10 \"but why they have eyes?\" -my 3 year old niece     ",
      "the-brave-little-toaster": "5/10 would you believe me if i said this was one of the scariest movies ever made     ",
      "the-glass-castle-2017": "6/10 brie larson is one of the most important people in my life and i don't even know her     ",
      "logan-lucky": "8/10 me? giving a movie an extra half star just for riley keough? youtu.be/f28klp1qQGI     ",
      "12-angry-men": "7/10 loved this reference to veronica mars season 2 episode 10 \"one angry veronica\"     ",
      "these-amazing-shadows": "7/10 i cried at the end just 'cause i love movies     ",
      "dancer-in-the-dark": "8/10 \"mum's the word\"  i think...... i might vomit. can't even place exactly how i feel about this right now except that i'm gonna go rinse the tears off my face and sleep this one off! ZOOP! BYE     ",
      "wendy-and-lucy": "8/10 michelle williams: hums, says my name a lot, lets a dog lick her lipsme: poetic cinema.....     ",
      "supermodel-acting-class": " this was more entertaining than most of this year's oscar noms     ",
      "the-lion-king": "6/10    i saw this with my nieces at the theater and at that One point in the movie, the 3 year old very loudly asked me \"why his dad is dead?\" and honestly? tea     ",
      "sugar-2017": " i think the most surreal part about logging this on letterboxd is how i got to see the process happen in glimpses. i got texted a draft of the script by jacob a few months ago (which i forgot to read right away 😬), and got sent snapchats before filming, of bags of sugar and purposely burnt cakes. and in the middle of all that, i found myself in LA for a weekend, driving around with jacob himself, laughing and...     ",
      "my-life-as-a-zucchini": "7/10 lumps of clay that speak french made me cry?????     ",
      "atomic-blonde": "10/10 GOD IS A WOMAN     ",
      "certified-copy": "6/10 what the fuck is going on in here on this day     ",
      "valerian-and-the-city-of-a-thousand-planets": "4/10    it's brilliant sci fi in it's world building and overall concepts, but by the time rihanna does her shape shifting male fantasy strip show i had already realized that it's unfortunately a corny, uninteresting and incoherent mess. what a shame     ",
      "blood-simple": "9/10 i can't believe the coen brothers invented anxiety in 1984??? THIS ALMOST GAVE ME A HEART ATTACK.....     ",
      "baby-driver": "9/10 when a movie is so satisfying that it makes me wanna claw my nails into the fabric of the gross movie theater seat in front of me and rip it to shreds like a cat getting a hold of a toilet paper roll     ",
      "song-to-song": "6/10 me: this is finerooney mara: \"you kissed me in public. you held my hand.\"me: 68.media.tumblr.com/78a001914cc928473da16a057fdaaba5/tumblr_oslkrxjz9y1qblevxo1_250.gif     ",
      "okja": "7/10 she's cute, but she's no snowpiercer!     ",
      "the-beguiled-2017": "8/10    KIRSTEN DUNST DIDN'T DESERVE ALL THAT     ",
      "the-book-of-henry": "3/10 this has the most alarming tone of any movie i've ever seen, including tommy wiseau's the room     ",
      "rough-night": "4/10    i'm gonna get RIGHT to the cold hard facts in this review because the people need to know the TRUTH: zoë kravitz and ilana glazer's characters are ROMANTICALLY CONNECTED in this movie, and it's NOT played out as a joke. at the end they even get back together and KISS, and by that point it felt like a very large GUST of WIND had come ZOOMING from the screen and PINNED me to my very SEAT, and my heart gushed SO INTENSELY that it SPUN out of my chest like a fidget spinner     ",
      "it-comes-at-night": "7/10 this was fine until riley keough showed up and started talking about bread pudding and then i was like OH WOW! CINEMA     ",
      "wonder-woman-2017": "8/10 me??? starting to cry during ACTION SCENES because i'm so full of joy????? oh most definitely     ",
      "batman-v-superman-dawn-of-justice": "8/10 THIS WAS SO GOOD KISS MY ASS  also the wonder woman theme song changed my life bye     ",
      "a-cure-for-wellness": "5/10 some eels: slither slitherdane dehaan's squeaky crutches: squeakme: fun! but what's happening     ",
      "possibly-in-michigan": " \"but loooove shouldn't cost an arm and a leg\"     ",
      "la-haine": "9/10 oh.....     ",
      "lovesong-2016": "9/10 i'm really floored by how good this was... i wasn't expecting something this striking. so beautiful in the most simplistic ways. natural, and quiet. love shown in glances more often than actions (similar to movies like moonlight, and carol) the sting of heartbreak in the awkward spaces in between: casual conversations, group interactions. the tragedy of love when it exists, but isn't acknowledged. the stomach churning reality of it. pure longing. i don't usually write serious reviews but this truly deserved more than a one liner from me. my heart hurts     ",
      "alien-covenant": "6/10    james franco being cast as the captain of the ship only to fry to death in his cryotube in the first five minutes is the weirdest and funniest fucking cameo i've seen since channing tatum showed up in the hateful eight hskehdknsheksjsh     ",
      "prometheus": "7/10 the characters in every sci fi movie: Let's spend an unfathomable amount of dough to go find fuckin unknown alien shit or whatever and uhhhhh like poke at it until we die?  me: why the fuck not... how bout in the sequel you fly a spacecraft to hell to shoot lasers at the grim reaper or some shit... for research... might as well     ",
      "alien-resurrection": "8/10 THIS WAS SO MUCH FUN AND FULL OF SURPRISES... and i... loved it? i've done nothing to prepare for this situation...     ",
      "alien-3": "6/10 me: this was alright me, remembering it was directed by David Fincher: Alien 3 is a 1992 American science-fiction horror film directed by David Fincher in his directorial debut, produced by Gordon Carroll, David Giler and Walter Hill, and written by Giler, Hill and Larry Ferguson from a story by Vincent Ward. It serves as the third film installment of the Alien franchise, and takes place after the events of Aliens (1986) and was followed by Alien: Resurrection (1997)-     ",
      "the-fifth-element": "7/10 OK i went with my friend to see it at the theater and when i got back from the bathroom before it started, my friend loudly told me \"you're the only one here who hasn't seen it\" WHEN I WAS GONE SHE TALKED TO EVERYONE ELSE AND EXPOSED ME HDJSJSHSKSLBD BYE     ",
      "aliens": "8/10 producer guy 1: next on the agenda, what should we call the sequel to alien?producer guy 2: well i had an idea.... there's going to be, in fact, more than one alien in this one, correct?producer guy 1: yes, plural. go onproducer guy 2: how about we just call it... Aliens. stick an S on that bad boyproducer guy 1: bruhproducer guy 2: bruh     ",
      "the-prestige": "10/10 FUCK     ",
      "guardians-of-the-galaxy-vol-2": "6/10    I'M MARY POPPINS Y'ALL     ",
      "the-zookeepers-wife": "6/10 me, about the zoo animals every time jessica chastain was hanging out with them: god i wish that were me     ",
      "colossal-2016": "7/10 maybe a little too ambitious for it's own good, and also simultaneously underwhelming, but i honestly LOVED the concept and ending enough to forgive it's flaws  also: original screenplays like this are an absolute NECESSITY. even if they don't hit their mark perfectly, they still make most churned out mainstream hollywood scripts look ridiculously lazy in comparison, and are completely worth the risk of creating and putting out into the world     ",
      "the-graduate": "8/10 HELLO DARKNESS MY OLD FRIEND.....     ",
      "free-fire": "8/10 almost as unraveling and incoherent as high rise, only more compressed and much more satisfying. does for guns what mad max fury road did for cars  and A24 + brie larson remain maybe my new favorite cinematic collaboration     ",
      "an-american-werewolf-in-london": "8/10 \"A NAKED AMERICAN MAN STOLE MY BALLOONS\"     ",
      "kong-skull-island": "7/10    \"so: she's got an oscar, AND she was gripped in a giant ape's fist and shoved down a skullcrawler's THROAT\" -my dad, just now, about academy award® winning actress brie larson     ",
      "in-the-mood-for-love": "7/10 this movie INVENTED the color red. pay up taylor swift     ",
      "north-by-northwest": "6/10 i honestly wish i had something profound to say but all i'm thinking about right now is how at the beginning of this movie the main guy goes to the oak room and an alarm went off in my mind that just screamed CAROL     ",
      "personal-shopper": "6/10    kstew texting a ghost: R u real ?me texting a ghost: HEY SPOOKY BITCH!!! 👻 what's up? i can't believe it took dying for you to upgrade from an android! how much do iphones cost in hell? 💀📱     ",
      "the-discovery": "8/10 me? giving a movie an extra half a star just for a sad plot twist and an alt-j song playing over the end credits? it's more likely than you think     ",
      "beauty-and-the-beast-2017": "3/10 i honestly can't remember the last time i was so uninterested in a movie     ",
      "the-belko-experiment": "6/10 didn't utilize NEARLY enough average office supplies for murderous purposes, but still fun     ",
      "daisies": "6/10 all they wanted to do was eat and destroy things... big mood     ",
      "fantastic-planet": "8/10 this is cooler than every disney movie i've ever seen     ",
      "logan-2017": "7/10 this sequel to the last of us was wild     ",
      "my-neighbor-totoro": "8/10 CAT BUS     ",
      "all-about-eve": "8/10 this is definitely amy dunne's favorite movie     ",
      "children-of-men": "9/10 alfonso... my dude..... goddamn     ",
      "i-dont-feel-at-home-in-this-world-anymore": "8/10 UM? HOLY FUCK?     ",
      "napoleon-dynamite": "10/10 how do i rate a movie higher than 5 stars     ",
      "polytechnique": "9/10 shookadjectiveemotionally or physically disturbed; upset     ",
      "incendies": "10/10 this ended like 45 minutes ago and i'm still sitting here trying to recover     ",
      "enemy": "9/10 i'm fucked up     ",
      "sicario-2015": "8/10 the score was amazing but otherwise i was really underwhelmed     ",
      "alice-in-wonderland-1951": "9/10 this is the best classic disney movie so jot that down     ",
      "miss-stevens": "8/10 why isn't lily rabe in everything     ",
      "boy-2010": "8/10 taika waititi: you are safe now my sweet childme: i owe you my life     ",
      "moonlight-2016": "9/10 blue/blo͞o/adjective1. of a color intermediate between green and violet, as of the sky or sea on a sunny day.\"the clear blue sky\"2. informal(of a person or mood) melancholy, sad, or depressed.\"he's feeling blue\"     ",
      "lion": "8/10 if this is oscar bait then i guess i'm a fish now because i've been CAUGHT and REELED the fuck IN     ",
      "manchester-by-the-sea": "9/10 i love michelle williams and her apple care wig     ",
      "hacksaw-ridge": "3/10 https://i.imgur.com/WQtTF0K.jpg     ",
      "hidden-figures": "7/10 the three real women and the three actresses that portray them... iconic.... legends..... iconic legendary icons   also: who the fuck cast bazinga in this film     ",
      "hell-or-high-water": "6/10 when they were robbing all those banks i guess they also decided to rob Jackie (2016) of her best picture nomination huh     ",
      "fences-2016": "6/10 viola davis (born august 11, 1965) is an american producer and actress of stage, screen, and television. after graduating from the juilliard school in 1993,     ",
      "arrival-2016": "8/10 denis villeneuve: points a camera at a wallme: HOLY SHIT     ",
      "maelstrom": "9/10 i can't come up with anything clever to say but just know that the deeper i dive into denis villeneuve's filmography the more fucked up i become     ",
      "elle": "4/10 i think the fuck not     ",
      "20th-century-women": "9/10 greta gerwig: \"menstruation\"me: Acting is an activity in which a story is told by means of its enactment by an actor or actress who adopts a character—in theatre, television, film, radio, or any other medium that makes use of the mimetic mode     ",
      "stolz-der-nation": " i could have sworn i've seen this before... oh right, that was american sniper     ",
      "scenes-from-the-suburbs": " two things:1. i'm sad2. i love arcade fire     ",
      "wasp": " not to be dramatic but andrea arnold is a legend in the making     ",
      "water-lilies": "7/10 céline sciamma really has been the queen of sad french movies about ambiguously gay adolescence for like 10 years now     ",
      "like-crazy": "8/10 de·pres·sion/dəˈpreSH(ə)n/nounfeelings of severe despondency and dejection     ",
      "y-tu-mama-tambien": "7/10 😩     ",
      "weekend-2011": "8/10 i don't know why i'm crying in the club right now     ",
      "blue-ruin": "8/10 every time the tension in a jeremy saulnier movie is broken by a sudden burst of chaotic violence... i shit myself... EVERY... TIME     ",
      "the-love-witch": "7/10 near the end there, i was ALMOST asleep because of how tired i am right now, but then she did THAT™ and i woke RIGHT the fuck up     ",
      "paterson": "8/10 some day i hope i can be this content and in love     ",
      "its-only-the-end-of-the-world": "7/10 me, giving you a tour of my house that resides up xavier dolan's ass: hi mtv welcome to my crib     ",
      "captain-fantastic": "7/10 me: sees one tree and hears a bird chirpme: this is just like in captain fantastic...     ",
      "the-wolf-of-wall-street": "9/10 can you believe that leo won his first oscar for grunting when THIS performance exists     ",
      "nocturama": "8/10 kind of like the mixed-up files of mrs basil e frankweiler, only they blew up half the city first     ",
      "miss-sloane": "9/10 i was so blown away by this movie that my body kept flying further back into the theater as the film progressed, much like a human feather, until i smacked up against the projector at full force and had to be surgically removed     ",
      "the-girl-with-all-the-gifts": "8/10 if being a zombie is all i have to do to be around gemma arterton then fuck it, time to become a zombie i guess     ",
      "jackie-2016": "9/10 crying is the shedding of tears in response to an emotional state. the act of crying has been defined as \"a complex secretomotor phenomenon characterized by the shedding of tears from the lacrimal apparatus, without any irritation of the ocular structures\". a related medical term is lacrimation, which also refers to non-emotional shedding of tears. crying is also known as weeping, wailing, whimpering, and bawling-     ",
      "christine-2016": "6/10 kind of feels like a lifetime movie after seeing kate plays christine, if i'm being honest     ",
      "the-lure": "8/10 the two mermaids: hissing and singing and chewing on human body partsme with my camera out: you're doing amazing sweeties     ",
      "cameraperson": "10/10 this is genuinely one of the most interesting and engulfing films i've ever seen     ",
      "the-red-balloon": "    never imagined that at 22 years old i'd be crying over fictional ghost balloons but here we are     ",
      "bottle-rocket": " the charlie brown music while they're shooting guns..... wes really has been quirky since day 1     ",
      "the-eyes-of-my-mother": "7/10 norman bates WHOM?     ",
      "certain-women": "8/10 certain(ly gay) women     ",
      "across-the-universe": "10/10 ME IN THE SKY WITH DIAMONDS     ",
      "toni-erdmann": "5/10 i mean... this sure was... i guess     ",
      "kate-plays-christine": "7/10 the stress that those last 5 minutes caused me is going to do serious damage to my body in the long run     ",
      "american-beauty": "10/10 imagine going over to ricky's house for a dime bag and he's just sitting there watching a video he recorded of a dead cat in a dumpster or something and he senses your presence and says \"i watch this every day at exactly 3:41pm. it reminds me that i'm not alone in the world\" and then he starts crying and you're just like \"ricky... the weed\"     ",
      "the-polar-express": "7/10 snowpiercer: the animated children's christmas special     ",
      "elf": "7/10 it's really unnerving that zooey deschanel looks nothing like zooey deschanel in this movie     ",
      "unaccompanied-minors": "6/10 paul feig is a comedy legend, this movie included, so jot that down     ",
      "carol-2015": "10/10 BYE     ",
      "the-night-before-2015": "5/10 how is michael shannon in every single movie     ",
      "why-him": "4/10 i saw this 5 hours ago and not only did i forget to log it, but i also forgot that i even saw it in the first place. that about sums it up     ",
      "divines": "8/10 FUCKIN HELL     ",
      "the-edge-of-seventeen": "6/10    true grit girl really was lowkey in love with her best friend huh     ",
      "white-girl-2016": "7/10 where's the britney spears \"dump him\" t-shirt when you need it     ",
      "always-shine": "7/10 a list of some of the scariest concepts known to human kind:1. space2. the ocean3. female friendships gone wrong     ",
      "embers-2015": "5/10 this 50 first dates spinoff was weird     ",
      "snowpiercer": "10/10 not to sound dramatic but this is just short of being a masterpiece in my eyes??????? every time i see it i'm blown away!!!!!!!!!!! oh my god!!!     ",
      "nocturnal-animals": "7/10 amy adams: and i feel like this year is really about... like the year of just realizing stuff     ",
      "room-2015": "9/10 SO POWERFUL     ",
      "loving-2016": "7/10 RUTH     ",
      "fantastic-beasts-and-where-to-find-them": "6/10 i was gonna complain but then i remembered something my dad once said when the hobbit movies came out \"the movies might not be great, but any time spent back in middle earth is time well spent\" and having spent my entire childhood obsessed with harry potter... i'd have to apply that logic here to the wizarding world universe     ",
      "prisoners": "9/10 something to lighten the mood     ",
      "miss-you-already": "7/10 i've never met her but i trust drew barrymore with my life and i always have     ",
      "macbeth-2015": "6/10 macbeth: i have done the deedlady macbeth: that's hot     ",
      "lore": "9/10 ok damn!     ",
      "saving-face": "7/10 CUTE     ",
      "let-the-right-one-in": "10/10 \"how did you get in?\" \"i flew.\"     ",
      "first-girl-i-loved": "7/10 hmm! i wanna die!     ",
      "happiness": "7/10 no     ",
      "evolution-2015": "6/10 what kind of twilight zone nonsense     ",
      "alps": "8/10 characters in yorgos lanthimos movies are just aliens that are still in the beginning stages of mastering how to impersonate human beings     ",
      "los-angeles-plays-itself": "4/10 actually i played myself by watching this whole thing     ",
      "inside-2007": "7/10 i think i just felt my womb shrivel up     ",
      "the-girl-on-the-train-2016": "8/10 emily blunt metaphorically smacked me across the face with an ARRICAM lite and by the time the credits were rolling i had to be scraped off the movie theater carpet with a large spatula     ",
      "tickled": "8/10 THIS WAS TOO MUCH     ",
      "mama-2013": "6/10 GOTH JESSICA CHASTAIN     ",
      "scripted-content": " i would die for jessica chastain     ",
      "hunt-for-the-wilderpeople": "7/10 when will you all watch eagle vs shark. my crops are dying     ",
      "miss-peregrines-home-for-peculiar-children": "8/10 i'm gonna adopt all of those peculiar children!!! they're my kids now     ",
      "thirst-2009": "8/10 they drinko the blood     ",
      "summertime-2015": "6/10 I'M SO EMO     ",
      "i-am-not-a-serial-killer": "7/10    we need to talk about kevin meets alien? wild     ",
      "natural-born-killers": "6/10 a few months ago my brother's girlfriend called woody harrelson hot but she got him mixed up with woody allen so i was absolutely horrified for a good 30 seconds     ",
      "persona": "7/10 ok...     ",
      "the-fits": "9/10 me during every single shot: A SHOT     ",
      "the-butterfly-effect": "10/10 THE DIRECTOR'S CUT ALTERNATE ENDING HAS HAUNTED ME SINCE I WAS LIKE 11 YEARS OLD     ",
      "dear-zachary-a-letter-to-a-son-about-his-father": "9/10 Ye ever wanty just wrap yersel up in tin foil nice and cosy and then just fucking get right inty the microwave and blow yersel up tae fuck     ",
      "blair-witch": "3/10    a 17 year wait to finally see the witch and she looks like some kind of flying demonic string cheese noodle ass. i quit     ",
      "legend-2015": "6/10 funny, i don't remember the parent trap being this dark     ",
      "the-dressmaker-2015": "7/10 she sure did... make some dresses     ",
      "antibirth": "5/10 rosemary's baby WHOM?     ",
      "hail-caesar-2016": "7/10 \"would that it twuuuuuuh so simple\"     ",
      "train-to-busan": "7/10 zombies on a train > snakes on a plane     ",
      "storks": "6/10    at the end the storks were delivering babies to gay couples (as well as delivering them to straight couples) and i started crying bye     ",
      "clouds-of-sils-maria": "5/10 kstew is really giving ellen page a run for her money with that wardrobe     ",
      "morgan-2016": "7/10    in the last ten minutes kate mara was walking through atmospheric woods with a hunting rifle and it was better than the entirety of the revenant     ",
      "eden-lake": "8/10 teenagers: bad     ",
      "the-light-between-oceans": "7/10 time to fill out my paperwork for alicia vikander to adopt me     ",
      "cache": "6/10 i mean... ok     ",
      "kubo-and-the-two-strings": "7/10 patty brought the twin witch party     ",
      "city-of-god": "9/10 WOAH     ",
      "the-intervention-2016": "6/10 it sure took a long time for but i'm a cheerleader to get a sequel     ",
      "the-diving-bell-and-the-butterfly": "7/10 i always thought the title was \"the driving bell and the butterfly\" until i saw the opening credits bye     ",
      "wiener-dog": "6/10 this dog better not get snubbed at the academy awards.....     ",
      "bad-moms": "4/10 if i had a dime for every bad movie i've watched for kristen bell i would have enough money to make my own movie just to cast kristen bell in it     ",
      "the-kid-with-a-bike": "6/10 the kid sure did..... have a bike     ",
      "junebug": "8/10 SOMEHOW AMY ADAMS HAS NO OSCAR. NOT ONE SINGLE ACADEMY AWARD. JUST IN CASE YOU FORGOT, HERE I AM TO REMIND YOU     ",
      "celeste-jesse-forever": "7/10 rashida jones. that's my whole review i hope you enjoyed it     ",
      "unfriended": "8/10 i literally just watched this with my friend while we were talking on skype     ",
      "the-handmaiden": "9/10 DUDE     ",
      "visions-2015": "3/10 this wasn't good but hey guess what: i love isla fisher     ",
      "the-purge-anarchy": "7/10 i love how everyone in these movies jumps straight to cold blooded murder like... relax perhaps     ",
      "the-purge": "6/10 just purge me guy     ",
      "lights-out-2016": "4/10 those lights sure were... out     ",
      "the-disappearance-of-eleanor-rigby-her": "8/10 i would die for jessica chastain part 2: i would die for her even more now     ",
      "the-disappearance-of-eleanor-rigby-him": "7/10 i would die for jessica chastain     ",
      "the-wave-2015": "5/10 just drown me guy     ",
      "sun-choke": "6/10 millie from freaks and geeks really fucked shit up     ",
      "money-monster": "7/10 JODIE YES     ",
      "tallulah": "7/10 the wardrobe department of any ellen page movie: ok ellen here's your outfit for today-  ellen: ok but consider this... flannel shirts and combat boots     ",
      "monster": "6/10 carol (2015) dir. todd haynes who???     ",
      "the-tribe-2014": "8/10 things that are fucked up:-this-me after watching this     ",
      "rust-and-bone": "8/10 those shots when he carries her on his back... ooooooh my gosh oh my gosh. oh my. gosh. oh my... god. shit. fuck. oh my god     ",
      "nerve-2016": "7/10 if this was a real game i would probably die playing it because i love money and validation     ",
      "doubt": "8/10 WHY DOESN'T AMY ADAMS HAVE AN OSCAR YET     ",
      "ghostbusters-2016": "10/10 CINEMA IS SAVED     ",
      "the-secret-life-of-pets": "4/10 i wasn't really paying attention but anyways i would die for jenny slate's voice alone     ",
      "fantastic-mr-fox": "8/10 \"beagles love blueberries\"     ",
      "where-the-wild-things-are": "6/10 when is spike gonna adapt harold and the purple crayon     ",
      "babel-2006": "8/10 one gun... really fucked everything up and made everyone sad     ",
      "me-and-you-and-everyone-we-know": "8/10 the \"i want to poop back and forth\" scene just changed my life     ",
      "my-own-private-idaho": "7/10 sad gays, the backbone of our society     ",
      "star-trek-beyond": "5/10 \"for anton\" THANKS I LOVE CRYING     ",
      "star-trek-into-darkness": "7/10 benadryl cumbersome can suck my foot for trying to ruin this series with his crap acting     ",
      "star-trek": "9/10 they boldly went™     ",
      "mud": "4/10 he mud     ",
      "son-of-saul": "8/10 this was so heavy i feel like i'm being crushed by the weight of it     ",
      "the-skin-i-live-in": "6/10 BOY THIS WAS FUCKED UP     ",
      "oslo-august-31st": "7/10 most of the movie actually took place on august 30th. i feel so betrayed     ",
      "popstar-never-stop-never-stopping": "6/10 they sure did... never stop never stopping     ",
      "ghostbusters": "5/10 they sure did... bust some ghosts     ",
      "cronos": "4/10    that little girl is gonna grow up and her story to tell at parties is gonna be like \"hey, you guys wanna hear about the time my grandpa found a golden bug and basically turned into a vampire?\"     ",
      "chungking-express": "7/10 🎶 CALIFORNIA DREAMIN' 🎶     ",
      "safe": "6/10 julianne moore, queen of anxiety     ",
      "adaptation": "9/10 @ charlie kaufman: are u ok dude     ",
      "jurassic-world": "3/10 bad     ",
      "the-shallows": "7/10 ok but if i was attacked by a shark i would just give up. just eat me guy     ",
      "breathe-2014": "9/10 it's scary how accurately this captures the intensity and insanity of relationships between young girls. i hate how much i related to this.     ",
      "you-are-not-alone-2016": "6/10 She Was Not Alone     ",
      "the-way-he-looks": "7/10 this was cutest thing i've ever seen???     ",
      "the-fundamentals-of-caring": "7/10 when is paul rudd gonna take MY disabled ass on a roadtrip across america     ",
      "swiss-army-man": "6/10 mary elizabeth winstead: \"what the fuck?\"me: I KNOW     ",
      "antichrist": "5/10 a great first date movie     ",
      "equals": "7/10 kstew deserves an oscar for pretending to be This Straight     ",
      "the-lizzie-mcguire-movie": "5/10 HEY NOW HEY NOW, THIS IS WHAT DREAMS ARE MADE OF     ",
      "finding-dory": "7/10 A CARTOON OF SOME FISH MADE ME CRY     ",
      "only-god-forgives": "6/10 ryan gosling: [has 4 lines the entire movie]me: now THIS is acting!     ",
      "triple-9": "6/10 can men in action movies like... idk, calm down maybe     ",
      "midnight-special": "8/10 i love to die     ",
      "walk-hard-the-dewey-cox-story": "8/10 HE NEEDS MORE BLANKETS AND HE NEEDS LESS BLANKETS     ",
      "wet-hot-american-summer": "9/10 \"you taste like a burger. i don't like you anymore.\"     ",
      "the-departed": "8/10 i'm so stressed out i'm about to have a hernia     ",
      "super-8": "9/10 \"PRODUCTION VALUE\"     ",
      "the-conjuring-2": "6/10 they sure did... conjure more things     ",
      "the-stanford-prison-experiment": "6/10 fucked up if true!     ",
      "martha-marcy-may-marlene": "7/10 is mary kate & ashley's sister ok     ",
      "the-machinist": "7/10 \"i just want to sleep\" bitch me too! the fuck!     ",
      "boogie-nights": "8/10    the part where rollergirl asks julianne moore to be her mom..... relatable! i would say the exact same thing to julianne moore if given the chance. know that     ",
      "neighbors-2-sorority-rising": "6/10 remember when everyone thought that hit girl was a good actress     ",
      "white-god": "8/10 I LOVE DOGS     ",
      "as-above-so-below-2014": "7/10 i don't fuck with demons     ",
      "i-will-follow": "4/10 when matt from glee showed up i almost started screaming. i didn't even know that guy could talk     ",
      "closer": "8/10 Overdramatic Cheating Culture     ",
      "a-league-of-their-own": "6/10 i love the part where they have their own league     ",
      "kissing-jessica-stein": "2/10 this movie is the reason the term \"gal pals\" exists     ",
      "the-invitation-2015": "3/10 fucking dinner parties     ",
      "carnage": "4/10    I AM GLAD OUR SON KICKED THE SHIT OUT OF YOUR SON AND I WIPE MY ASS WITH YOUR HUMAN RIGHTS     ",
      "kingsman-the-secret-service": "5/10 the... church... scene...     ",
      "hard-candy": "8/10 fuck     ",
      "the-piano": "7/10 SHE JUST WANTED TO PLAY HER PIANO     ",
      "88": "5/10 katharine isabelle: queen of acting     ",
      "faults": "7/10 she did THAT™     ",
      "the-keeping-room": "8/10    at one point, a male character stares at brit marling for a moment before whispering under his breath \"fuck... you're beautiful\" dude... I KNOW     ",
      "magic-mike-xxl": "8/10 I'M SHOOK     ",
      "i-believe-in-unicorns": "6/10 teenage boys are Bad     ",
      "queen-of-earth": "6/10 this was... A Lot     ",
      "full-metal-jacket": "5/10 misleading: no one wore a jacket made out of metal     ",
      "high-rise-2015": "8/10 GOOD LORD.....     ",
      "phoenix-2014": "7/10 \"this is fucked up\" -me for 98 minutes     ",
      "the-shawshank-redemption": "8/10 damn... he really did 👏 that 👏     ",
      "taxi-driver": "5/10 he sure did... drive that taxi     ",
      "a-clockwork-orange": "6/10 let's drink some milk and go commit unspeakable crimes: the movie     ",
      "the-fountain": "7/10 kinda like bubble boy... only not     ",
      "a-single-man": "8/10 those changes in color saturation... just ruined my life     ",
      "hush-2016": "8/10 GO OFF     ",
      "take-shelter": "9/10 the sexual tension between me and the weather from now on after i've seen this movie     ",
      "the-hateful-eight": "8/10 jennifer jason leigh's performance blew my tits off     ",
      "freeheld-2015": "6/10 [me, while literally drowning in tears] i'm totally chill     ",
      "tom-at-the-farm": "7/10 my head is so far up xavier dolan's ass that it's stuck     ",
      "mosquita-y-mari": "7/10 this was so cute i wanna die     ",
      "the-overnight": "6/10 i can't believe this is a real movie     ",
      "heaven-knows-what": "8/10 \"yeah, suck my clit! asshole\"     ",
      "the-summer-of-sangaile": "6/10 weird, but not like... bad weird     ",
      "turbo-kid": "5/10 the gore ALONE... dario argento who? quentin tarantino what?     ",
      "the-devil-wears-prada": "8/10 i would die for emily blunt     ",
      "10-cloverfield-lane": "9/10 YOOOOOOOOOO     ",
      "kumiko-the-treasure-hunter": "8/10 running away from your problems, level: expert     ",
      "bridge-of-spies": "2/10 do you think they set out to make this dull as fuck or was it an accident     ",
      "fish-tank": "4/10 what a bummer     ",
      "mustang-2015": "7/10 i wish i had sisters     ",
      "kick-ass": "9/10 no offense but deadpool who?     ",
      "deadpool": "5/10 fun, but it's no kick-ass     ",
      "the-tree-of-life-2011": "7/10 life, love, and daddy issues: the movie     ",
      "weighting": " brie larson is the most important person in my life right now     ",
      "appropriate-behavior": "9/10 i loved this so much     ",
      "somewhere": "6/10 i too want to eat gelato in a dark milan hotel room in the middle of the night while watching friends dubbed in italian     ",
      "victoria-2015": "8/10 suck it, birdman     ",
      "anomalisa": "8/10 im gonna fight charlie kaufman     ",
      "steve-jobs": "7/10 \"that THING... looks like judy jetson's easy bake oven\"     ",
      "the-revenant-2015": "6/10 this whole movie needs to take a chill pill     ",
      "the-big-short": "1/10 WHY     ",
      "joy-2015": "5/10 brie larson's character named joy in room > this whole movie     ",
      "the-danish-girl": "4/10 alicia vikander if you read this i'm free on thursday night and would like to hang out. please respond to this and then hang out with me on thursday night when i'm free     ",
      "brooklyn": "6/10 i feel like this is a movie that most grandmas would enjoy     ",
      "spotlight": "8/10 WOW     ",
      "american-ultra": "7/10 its so much fun when a list actors do hyper violent action comedies     ",
      "sisters-2015": "4/10 kate mckinnon's character with her whopping 2 lines and background dancing was maybe the best thing about this whole movie     ",
      "citizen-kane": "4/10 have you guys ever heard of this movie? citizen kane? directed by orson welles? ever heard of it? citizen kane? probably not, it's pretty indie     ",
      "the-gift-2015-1": "5/10 i thought i was completely unphased by this but the other night i had a really weird nightmare about it so 1 point to The Gift (2015)     ",
      "the-hunger-games-mockingjay-part-2": "5/10 honestly this could have been the shittiest movie in the world and i wouldn't know or care because my peeta/katniss-lovin-ass has been waiting like 5 years     ",
      "funny-games-2007": "8/10 i do prefer this over the original, though it's disturbingly impressive how alike the two movies are shot by shot     ",
      "funny-games": "6/10 i think i much prefer the american version but i'd have to rewatch it to be sure     ",
      "v-h-s": "3/10    FUCK!!! WHAT A WASTE OF TIME IM SO MAD what the fuck  ok. an extra half star though for the tape with the guy and girl on vacation that ends in the girl's lesbian lover stabbing the guy in the throat and making out with the girl and them running away together. that was pretty badass     ",
      "insidious-chapter-3": "4/10 eh... didn't really have the feel of an insidious movie and didn't bring enough to the table to be interesting or worthwhile. would have been better as it's own new thing instead of attached to this series  edit: i change my mind, i wish this hadn't been made at all tbh     ",
      "insidious-chapter-2": "8/10 probably the scariest movie i've ever seen in the theaters if i'm being honest. fucking amazing as far as sequels go, a must see that really adds to the first film  and for the record: insidious > insidious: chapter 2 > the conjuring     ",
      "creep-2014": "6/10 creepy     ",
      "maniac-2012": "7/10 fuck     ",
      "the-loved-ones": "8/10 i thought i knew what i was getting into but that was some twisted shit     ",
      "would-you-rather": "7/10 it's 9 days until halloween and i'm already running out of things to say about decent horror movies. this was decent. i liked it a decent amount.     ",
      "pontypool": "7/10 what a strange little film     ",
      "the-duke-of-burgundy": "10/10 a whole movie about kink shaming. with butterflies. and no men. 5 stars.     ",
      "the-final-girls": "5/10 a little... not good.  also: WHERE IS MY HILARIOUS COMEDY STARRING ALIA SHAWKAT AS THE LEADING LADY AND NOT THE BEST FRIEND FOR ONCE, WORLD?     ",
      "martyrs": "9/10 i don't even know how to rate this. i don't even know what to say. i'm in absolute shock, terrified to my core. i don't know what i was expecting, but it wasn't that. pure horror. i'm gonna have nightmares tonight.     ",
      "the-green-inferno": "4/10 \"what's wrong with you, man? everyone is fucking dying and you're fucking jerking off?! you sick fucking asshole!\"     ",
      "the-lazarus-effect-2015": "6/10 pretty spooky!!! with a great cast. i actually really liked this     ",
      "tower-of-terror": "7/10 the height of cinema. it'll never get better than this, folks     ",
      "beneath-2013-1": "2/10 never in a million years would i willingly go into a fucking coal mine or a deep ass cave or something like that. what the fuck. of course there's probably ancient creatures or zombies or some shit down there just waiting to be disturbed by someone. why did i watch this.     ",
      "crimson-peak": "8/10 listen: jessica chastain is everything to me. EVERYTHING. i am not even exaggerating. i just spent the past half hour whispering her name aggressively and bouncing around energetically in the dark, empty movie theater parking lot. weird? maybe. necessary after seeing this movie? for me, absolutely     ",
      "the-ward": "4/10 damn that was some shitty acting     ",
      "dont-look-under-the-bed": "7/10 a near perfect film. a masterpiece.     ",
      "excision": "6/10 american mary: the early years. extra star for that ending. i mean GODAMN     ",
      "goodnight-mommy": "7/10    it's a shame that i guessed the ending twist really early on     ",
      "the-heart-machine": "4/10 he could have just went on catfish but ok     ",
      "dope-2015": "8/10 i honestly thought it was set in the 90's until the justin bieber reference     ",
      "young-ones": "3/10 why did the fucking robot get more screen time than elle fanning     ",
      "bronson": "3/10 tom hardy really is something else     ",
      "camp-takota": "2/10 i'm gonna pretend i didn't watch this     ",
      "the-martian": "8/10 disco sucks     ",
      "beginners": "9/10 why did it take me so long to watch this     ",
      "the-life-aquatic-with-steve-zissou": "7/10 i didn't even know that cate blanchett was in this and when she showed up i was like \"oh my god! that's cate blanchett!\" what a nice surprise     ",
      "mommy-2014": "10/10 the power that xavier dolan has over me at this point is embarrassing tbh     ",
      "me-and-earl-and-the-dying-girl": "7/10 earl says \"titties\" 7 times throughout this movie     ",
      "wetlands-2013-1": "9/10 surprisingly gross but surprisingly good     ",
      "lost-river": "7/10 nwr really had an impact on ryan gosling huh     ",
      "laurence-anyways": "6/10 at this point i'd watch paint drying for 3 hours if it was made by xavier dolan     ",
      "tracks-2013": "5/10 dogs are the most important creatures on this earth and i love my dogs     ",
      "men-women-children": "7/10 stressed n' depressed     ",
      "pariah": "9/10 \"it's not a phase! there's nothing wrong with me!\"  ugh. so good. so good.     ",
      "the-age-of-adaline": "6/10 i'm in love with blake lively     ",
      "eddies-million-dollar-cook-off": "7/10 my watch history recently is pretty embarrassing     ",
      "elena-undone": "1/10 i hate myself for watching this     ",
      "inside-out-2015": "8/10 so fucking cute     ",
      "addicted-to-fresno": "8/10 both judy greer and natasha lyonne have deserved leading roles like this for about 15 years now so i'm satisfied  also: natasha's love interest was aubrey plaza. i'm glad we live in a universe where that happened and i feel bad for the universes where it didn't     ",
      "magnolia": "6/10    an extra half star for the frogs     ",
      "preservation": "7/10 reminded me of eden lake     ",
      "nightcrawler": "9/10 this shit is still fucked     ",
      "vacation-2015": "5/10 the four corners scene  also: christina applegate and leslie mann are my cool aunts and i love them     ",
      "the-man-from-uncle": "4/10 not bad but not good either???????????????     ",
      "life-itself": "7/10 movies are magical. roger knew it, and i can relate. as corny as it may sound, watching this only solidifies my deep passion and love for movies, and i hope to revolve my life around them in the years to come, truly.     ",
      "comet": "8/10 i'm such a sucker for good cinematography in modern indie movies     ",
      "spy-kids-2-the-island-of-lost-dreams": "9/10 unironically one of the best movies ever made     ",
      "welcome-to-me": "6/10 ok what is it with kristen wiig and starring in 'Emotionally Draining Indie Dramedies That Are Never Quite As Good As You Hope They'll Be'     ",
      "bottle-rocket-1996": "7/10 \"what are you putting that tape on your nose for?\" \"exactly!\"     ",
      "from-dusk-till-dawn": "7/10 the wildest bar fight in film history     ",
      "god-bless-america": "3/10 part 3/3 of my \"accidentally awful movie marathon\"  i fell asleep on purpose on a friend of a friend's living room recliner. it was weird. the movie, not the recliner (or the friend of a friend)     ",
      "minions": "2/10 part 2/3 of my \"accidentally awful movie marathon\"  hell is real. i witnessed it firsthand laying in the back of a pickup truck at a drive in, staring at the stars and hoping a ufo would appear out of the sky to abduct me as the minions jabbered on in the background. it's a miracle i fell asleep.     ",
      "fantastic-four": "4/10 part 1/3 of my \"accidentally awful movie marathon\"  the plot is paper thin and as bland as a saltine cracker, which really is a shame considering the main cast are all super talented. then again, maybe i would have liked it slightly more if i hadn't been up for 19 straight hours and watching it at a double drive in where i started cracking jokes and repeating \"i love kate mara\" until my friend told me to shut up     ",
      "jennys-wedding": "4/10 should've been called \"jenny's wedding: and how her mildly homophobic family stole all her screen time\"     ",
      "contact": "6/10 now i just wanna rewatch interstellar again     ",
      "atonement": "8/10 saoirse ronan fucked everything up     ",
      "trainwreck": "3/10 ugh     ",
      "the-boxtrolls": "7/10 cute!     ",
      "starry-eyes": "5/10 um ok     ",
      "spy": "7/10 i should have seen mad max again tbh     ",
      "girlhood-2014": "8/10 made boyhood look like shit tbh     ",
      "honeymoon-2014": "8/10 what the what!     ",
      "the-guest-2014": "9/10 hot damn that's fresh!!!!!     ",
      "coherence": "7/10 what the fuck     ",
      "a-girl-walks-home-alone-at-night": "9/10    the slow motion scene with 'death' by white lies playing in the background changed my life for the better     ",
      "they-came-together": "6/10 not as good as wet hot american summer, but then again what is     ",
      "cobain-montage-of-heck": "8/10 this put me in such a melancholy mood     ",
      "cosmopolis": "3/10 the song by metric in the closing credits was the best part     ",
      "four-rooms": "7/10 i've never seen something quite like tim roth in this film     ",
      "leon-the-professional": "8/10 I HAVEN'T GOT TIME FOR THIS MICKEY MOUSE BULLSHIT     ",
      "i-origins": "7/10 not the best movie i've ever seen but then again i'd probably watch anything if it had brit marling in it     ",
      "mulholland-drive": "9/10 holy fuck     ",
      "in-your-eyes-2014": "5/10 this was just a nicholas sparks adaption that was trying to be \"quirky\"     ",
      "the-hobbit-the-battle-of-the-five-armies-extended-version": "4/10 lotr trilogy: a 3 course meal at a 5 star restaurant  hobbit trilogy: a bad tv dinner cooked in the microwave     ",
      "22-jump-street": "9/10 \"i'm impressed you caught up to me. you probably haven't run that fast since you played stickball in the field behind Old Pop Wiggleby's Sweet Shop\"     ",
      "being-john-malkovich": "10/10 oh my god     ",
      "birdman-or-the-unexpected-virtue-of-ignorance": "8/10 a bird and also a man     ",
      "foxcatcher": "5/10 wrestling is weird     ",
      "cake-2014": "9/10 i loved this     ",
      "the-imitation-game": "5/10 not bad, but not necessarily great either     ",
      "unbroken": "5/10 could have been a lot better and i almost fell asleep during the last half hour     ",
      "the-grand-budapest-hotel": "10/10 fucking stupendous     ",
      "still-alice": "9/10 this was such a quiet and beautiful film. julianne moore absolutely deserves all the awards she's won and more coming her way for this role     ",
      "big-eyes": "8/10 slightly predictable, but charming nonetheless     ",
      "american-sniper": "1/10 BLEH     ",
      "the-theory-of-everything-2014": "8/10 hearing 'arrival of the birds' at the end made me burst into tears     ",
      "selma": "9/10 outstanding     ",
      "a-most-violent-year": "5/10 i'm pretty bummed out this wasn't better     "
   }
}