{
   "user": "ingridgoeswest",
   "reviews": {
      "dune-part-two": "10/10 as written     ",
      "dune-2021": "10/10 DESERT POWER     ",
      "this-is-menow": "1/10 HAPPY BIRTHDAY OLIVIA THIS ONE IS FOR YOU     ",
      "death-note-2006": "9/10 \"here, you're still wet\"\"i'm sorry\"And then they kissed and the show ends     ",
      "madame-web": "10/10 GOOPED AND GAGGED PLEASSSEEE JUST GO SEE THIS MOVIE PLEASE NO WORDS CAN DESCRIBE HOW GOOD THIS IS  funniest movie i have ever seen in theaters. this will be shown at midnight showings in theaters for decades to come and everyone will shout in unison \"but i don't have a neuromuscular disorder!\"     ",
      "grounded-ii-making-the-last-of-us-part-ii": " oh ellie... i think they should be terrified of you     ",
      "the-iron-claw-2023": "10/10    I guess it's because I used to be a brother. And now I'm not a brother anymore.     ",
      "fight-club": "5/10 I need to watch it again but rn I hate fight club     ",
      "gremlins": "8/10 I love how little shits anyone gave in the 80's. also children should die more in movies. #childrenshoulddiemore     ",
      "godzilla-minus-one": "10/10 best lizard     ",
      "leave-the-world-behind-2023": " if sam esmail has million fans, then I'm one of them.if sam esmail has one fan, then I'm THAT ONE.if sam esmail has no fans, that means I'm dead.     ",
      "popstar-never-stop-never-stopping": "10/10 you know how when you watch a movie and you love it so much you decide to go listen to the soundtrack and then appreciate the movie even more? this is the perfect example of this.     ",
      "the-mist": "10/10 never let out a scream in a movie like i did with this one. all of my childish phobias and anxieties have dissolved. every ounce of fear i have is for the mist and the mist alone.     ",
      "five-nights-at-freddys": "7/10 Okay!!!!     ",
      "dick-tracy-special-tracy-zooms-in": "10/10 one in a million     ",
      "the-killer-2023": "5/10 This man freak out here with the craziest keto gluten free paleo dukan atkins diet.   BREAKFAST: mcmuffin with NO BUNLUNCH: hard boiled gas station eggDINNER: advil, whiskey, and starbucks coffee  You WISH you had his discipline ‼️‼️‼️     ",
      "killers-of-the-flower-moon": "10/10    are you real?  pure fiery melancholy. lily gladstone puts everyone to shame. best performance maybe ever. scorsese... you have a lot of therapy to pay for.     ",
      "coraline": "10/10 wybie is my roman empire     ",
      "saw-x": "9/10 JOHN FUCKING KRAMERJIG FUCKING SAWGAME FUCKING OVER     ",
      "possession": "10/10 WHAT?     ",
      "barnyard": " chemical imbalance     ",
      "saw-iv": "3/10 IS HE THE MURDERER THE POLICE SAY HE HIS     ",
      "stop-making-sense": "10/10 does anybody have any questions?     ",
      "sanctuary-2022": "8/10    THIS IS REBECCA WE'RE IN LOVE SHES IN CHARGE NOW THIS IS REBECCA WE'RE IN LOVE SHES IN CHARGE NOW THIS IS REBECCA WE'RE IN LOVE SHES IN CHARGE NOWTHIS IS REBECCA WE'RE IN LOVE SHES IN CHARGE NOW THIS IS REBECCA WE'RE IN LOVE SHES IN CHARGE NOW THIS IS REBECCA WE'RE IN LOVE SHES IN CHARGE NOWTHIS IS REBECCA WE'RE IN LOVE SHES IN CHARGE NOW THIS IS REBECCA WE'RE IN LOVE SHES IN CHARGE NOW THIS IS...     ",
      "martyrs": " very very glad 14-year-old me, as desperate as she was to find and watch this, was never able to. sometimes questions are better left unanswered.     ",
      "bottoms": "10/10    suspenders over your nipples like a goddamn freak     ",
      "asteroid-city": "10/10 all my pictures come out     ",
      "braindead-1992": "10/10 braindead baby forever and always     ",
      "talk-to-me-2022": "4/10 mmmmm no not for me thank you!     ",
      "kill-bill-vol-1": "10/10 I COLLECT YOUR FUCKING HEAD     ",
      "mission-impossible-dead-reckoning-part-one": "10/10 squealed gasped wept laughed denialed angered bargained depressioned accepted and now i'm expected to go home and carry on with my life?   A TOM CRUISE PRODUCTIONTOM CRUISEPRODUCED BY TOM CRUISE  perfect perfect cinematic cinema masterpiece it was just everything i needed and more. i couldn't get enough and wished with everything in me it would last forever.     ",
      "evil-dead-rise": "8/10 This one is dedicated to all my skanks sluts and whores ‼️‼️‼️     ",
      "evil-dead": "10/10 Kiss me you dirty cunt     ",
      "beau-is-afraid": "4/10    when i said i wanted to see more cock and balls in movies this is literally the exact opposite of what i meant     ",
      "john-wick-chapter-4": "8/10 john wick is in desperate need of a self care day     ",
      "dancer-in-the-dark": "4/10 lars von trier you will see hell. you will see hell and it will be brutal. it will be relentless and evil. every nightmare you have ever had will come true and i will make sure of it.     ",
      "the-house-bunny": "7/10 diet coke cinema     ",
      "speed-racer": "10/10 so this is a joke right? 5 stars for speed racer? weirdly enough, speed racer is a movie that means so much to me. that's not a normal thing to say. but it's true.  my brother died in 2011. he was 7 years old and never went a day without smiling and making everyone around him smile. his favorite movie, and mine at the time as well, was speed racer. i talk about this movie now as a joke, considering...     ",
      "raging-bull": "9/10 thelma schoonmaker's mastery here makes my heart swell up with envy and joy. she perfects every moment in this, each cut more interesting than the last. i hooted and hollered so many times for her and thank god everyday that she and scorsese continue to create.  ❤️ scorsese + schoonmaker forever ❤️     ",
      "catch-22-2019": "9/10 Christopher Abbott you have me by the throat     ",
      "easy-a": "7/10 t t t t t t t t t t.....     ",
      "malignant-2021": "10/10 a sexier or cooler movie does not exist     ",
      "the-matrix": "10/10 a cooler or sexier movie does not exist     ",
      "entergalactic": "9/10 christopher abbott's animated mole means more to me than any combination of words can ever describe. cried because of this and many other reasons. this movie loves love and so do i.     ",
      "the-lost-city-2022": " i thought i was hallucinating when this ended with the clean version of Big Energy... but i was not. it really does end with the clean version of Big Energy     ",
      "james-white": "10/10    And the thing about us is we feel good things way up here. But we feel bad things way, way, way down there. And we got to try and remember there's all this space in between.  We gotta try and live in there, too.     ",
      "the-great-muppet-caper": "10/10 That's so me     ",
      "eternal-sunshine-of-the-spotless-mind": "10/10 I pray people get broken up with so I can recommend this movie.     ",
      "black-bear": "10/10 before all the movies     ",
      "saw-3d": " SAW DD: the boobies chapterorSAW DR: the lawrence chapter  The Choice is Yours.     ",
      "saw-v": "4/10 i have never tried so hard to keep up with a movie in my entire life     ",
      "knock-at-the-cabin": "7/10 Dave Bestiesta     ",
      "black-panther-wakanda-forever": "5/10 overedited, underlit, misguided     ",
      "the-box-2009": "6/10 YEAAAHHHH RIGHHHTTT *APPLAUSE* *CHEERING*     ",
      "pulse-2001": "10/10 Kawashima's continuously flawless outfits were the only thing keeping me from going absolutely insane during this. first half had me the most scared i've been in a movie in a long time, just for the second half to touch me and leave me feeling like I shouldn't try to watch another movie ever again. Absolutely fucking baller     ",
      "infinity-pool": "6/10    Mia Goth: yasss kill yourself you're so sexy ahaha     ",
      "thinner": "3/10 💀💀💀     ",
      "saint-maud": "8/10 getting dicked down by God can be so personal     ",
      "sunset-boulevard": "9/10 I find I'm terribly afraid of losing you.     ",
      "the-irishman-2019": "9/10 This is the saddest movie I've ever seen     ",
      "national-lampoons-christmas-vacation": "9/10 a family tradition in my house!   anyway, merry christmas to all of you. i'm so thankful for every single one of you that clicked the follow button, comment on my reviews, and even the ones that take the time to read my essays. i couldn't have picked a better website to spend my days on and i love you all so much! happy holidays     ",
      "the-virgin-spring": "8/10 tw sexual assault   the night i was assaulted, by the man i thought was a brother to me, i stumbled out of his living room. i felt my childhood disappear behind me. all of the memories of innocence i experienced there, memories of the joy my departed brother felt there, memories i held desperately onto, were instantly gone.    i remember so clearly how fast i ran up those stairs. the carpeted staircase i had played on years before were...     ",
      "babylon-2022": "10/10 shortest three hours of my entire life. sobbing uncontrollably knowing movies don't get better than this. hold the ones you love and watch movies always and forever     ",
      "the-whale-2022": "3/10    Did Dan the pizza guy represent God judging us? Sorry I don't get movies unless every single metaphor is explained to me     ",
      "once-upon-a-time-in-hollywood": "3/10 Wouldn't it be funny if you guys could climb out of Tarantino's ass and admit this is a pointless, boring movie?     ",
      "ambulance-2022": "9/10    Jake Gyllenhaal getting shot and DYING is the aesthetic all filmmakers should be reaching for!!! PUSH HIM, Lars Von Trier!! FINISH HIM!!!  also side note happy birthday jake gyllenhaal ❤️     ",
      "mirrormask": "8/10 PANS LABYRINTH for bitches with serious mommy issues. also terrifying movie. Hits you where it hurts while simultaneously being fucking nuts. everyone Needs to watch this movie now.     ",
      "the-fabelmans": "9/10 \"guilt is a wasted emotion.\"  a 150 minute love story, flashing before my eyes. endlessly empathetic, touching, captivating. my eyes hurt from lack of blinking and the incapability of turning away. the time spielberg takes and doesn't take between cuts and transitions to show time forgiven. characters disappear from our view for years, from one scene to the next. we are left to imagine time between where they have messed up, made decisions, deepened their understanding of each other. leaving...     ",
      "videodrome": "6/10 hmm! I think the fuck NOT.     ",
      "mother-2017": "1/10    I lost it when they threw her on the ground.  When I say I lost it, I'm not talking about the losing it where tears just come bursting out. Not the losing it where you tuck your head into your knees because you just can't handle standing the sight of anything anymore. I'm talking about the losing it where you feel like everything you've just experienced was nothing more than a bad dream. That nothing this disgusting could ever be made...     ",
      "cat-people-1982": "6/10 with gasssoooollliiiiiiinnneeeeeeeee     ",
      "terrifier-2": "3/10 This is how i lose     ",
      "luck-2022": "1/10 Is this not Abominable?     ",
      "american-hustle": "7/10 Amy Adams every single morsel of this rating is for you and you only     ",
      "enter-the-void": "8/10 Drugs 😍🎉✨     ",
      "the-terminal": "5/10 could be meaner!     ",
      "the-black-phone": "8/10    Scott Derrickson loves his dead kids. He loves ‘em walking and talking! Moving around! Doing their thing :) and I think that's alright.     ",
      "elvis-2022": "7/10 biggest surprise of the year so far because it was not absolute shit. take a hit, settle in and don't overthink it. baz is having a blast and if you let yourself, i promise you can too.     ",
      "the-house-that-jack-built-2018": "8/10 I have watched this twice and now I hate myself more than I did to begin with     ",
      "the-guilty-2021": "2/10 genuinely insufferable. i guess that's just jake's version baby!     ",
      "men-2022": "8/10 Yes!!!! YES!!!!!!!! YESSSSS!!!!!!!!!!!!!!! YESSSSSSSSSSSSSS!!!!!!!!!!!!!!     ",
      "the-shape-of-water": "10/10 love is what keeps us alive. love is all we have. love is everything. this film is everything. this film is love.     ",
      "were-all-going-to-the-worlds-fair": " anna cobb you are a star. alex g you are on thin ice.     ",
      "doctor-strange-in-the-multiverse-of-madness": "3/10 i am so convinced that some nephew of kevin feige or smth who's seen evil dead 2 one too many times got to ghost direct this under raimi's name. all i can do is hope that's true because sam raimi... if you really did this... your days are numbered.     ",
      "moon-knight-2022": "2/10 deeply idiotic from the moment it started to the moment it ended     ",
      "the-northman": "7/10 cried multiple times throughout the whole thing. this movie is so, SO much more moving than i ever could've imagined it being, in performances and visuals alike. anya taylor-joy is giving the most emotional performance i've seen out of her, let alone anyone this year. loved so much about this movie and have not been able to stop thinking about it.  even with all of this, no matter how much it struck me; i felt disappointed and cheated. there were...     ",
      "the-piano": "10/10    going to pretend this ended the way jane campion actually intended and call this a masterpiece     ",
      "the-jerk": "6/10 Cat juggling Cat juggling Cat juggling Cat juggling Cat juggling Cat juggling Cat juggling Cat juggling Cat juggling Cat juggling Cat juggling Cat juggling Cat juggling Cat juggling Cat juggling Cat juggling Cat juggling Cat juggling Cat juggling Cat juggling Cat juggling Cat juggling Cat juggling Cat juggling Cat juggling Cat juggling Cat juggling Cat juggling Cat juggling Cat juggling Cat juggling Cat juggling Cat juggling Cat juggling Cat juggling Cat juggling     ",
      "the-mummy-returns": "4/10 STOP BRITISH KIDS!!!! SOMEONE STOP THEM!!!! WE DO NOT NEED THEM!!!     ",
      "bram-stokers-dracula": "6/10 to be british or not to be british, that is the question i am asking keanu can you please answer me     ",
      "freaky": "3/10 i do not remember why or how i once loved movies     ",
      "windfall": "5/10 jesse plemons groans loudly     ",
      "alpha-and-omega-the-big-fureeze": "3/10 the least offensive of the octuple to me     ",
      "alpha-and-omega-dino-digs": "4/10 splash studios did it for the furries and the furries only     ",
      "morbius": "2/10 venom but i cannot see or hear anything that is happening and also jared leto is venom :/ :(     ",
      "fresh-2022": "6/10 Yes but also no     ",
      "lie-2001": " y'all I don't even know....     ",
      "too-young-to-be-a-dad": "4/10 paul franklin dano     ",
      "deep-water-2022": "6/10    Tracy, letts not text and drive next time, okay?     ",
      "eraserhead": "8/10 david lynch, WHAT THE FUCK     ",
      "cmon-cmon": "10/10 one day I'll see him again. I'll hold his tiny, stupid, cute little face. I don't know if he'll remember me, if he'll be little anymore, if he'll be disappointed in the things I've done or even call me his sister.   all I know is that I'll hold him and remind him of everything.   thank you as always, mike mills. you beautiful bastard.     ",
      "scanners": "7/10 Where is my man getting all these jackets!!     ",
      "the-big-hit": " ????????????????     ",
      "lamb-2021": " There certainly were lambs!     ",
      "titane": "9/10 made me feel like I can love movies again the way I did when I first fell in love. so much fucking fun     ",
      "space-jam-a-new-legacy": "1/10 lebron james     ",
      "war-dogs-2016": "5/10 me: *trying to figure out why this movie is trash*me:todd phillips: heyme: ohhhhhh     ",
      "percy-jackson-the-olympians-the-lightning-thief": "6/10 if this was your favorite movie in 2010 there's a 100% chance you're rolling with the lgbt     ",
      "spring-breakers": "7/10 if I have to hear james franco say spring break one more time I swear to fucking god     ",
      "im-thinking-of-ending-things": "6/10    taylor swift trying to explain the gayness of betty and dorothea = charlie kaufman saying, \"it was from the man's perspective all along!!!\"     ",
      "halloweentown": " what is this     ",
      "the-kissing-booth-2": " cannot express how happy I am that this is worse than the first one, greatest gift of the year (besides folklore by Taylor Swift please stream 🍂🌾folklore🌾🍂 by Taylor Swift)     ",
      "on-flux-2005": " no comment ❤️     ",
      "heat-1995": "10/10 If i sobbed during heat. I didn't sob during heat bc i did. No i didnt ❤️     ",
      "childs-play-2019": "5/10 \"I hate Chucky and everything he stands for\" -my mom     ",
      "a-star-is-born-2018": "9/10 to quote charli xcx... sorry 'bout grammy night     ",
      "jason-goes-to-hell-the-final-friday": "2/10 why lie for the timeline, this movie was so boring so i listened to garden song by phoebe bridgers on repeat during the whole thing ✨STREAM PUNISHER✨     ",
      "john-mulaney-kid-gorgeous-at-radio-city": "9/10 SHE IS A DYNAMITE 5 FOOT JEWISH BITCH, AND SHE'S THE BEST     ",
      "dick-tracy-special": "10/10 warren beatty please pound me     ",
      "godzilla-1998": "2/10 objectively the longest movie ever made     ",
      "shes-gotta-have-it": "7/10 taurus queen nola darling. she is the woman i've always wanted to be     ",
      "oldboy-2013": "5/10 THEY SHAZAM A SONG THATS ON THE RINGTONE SECTION OF THE IPHONE THE NAME IS RIGHT THERE... WAS THIS JUST A SHAMELESS SHAZAM PLUG??? HOLY SHIT THIS MOVIE HILARIOUS     ",
      "scooby-doo-2-monsters-unleashed": "7/10 weirdly sexual movie     ",
      "shirley-2020": "8/10 i feel the exact same way about shirley that i felt about madeline's madeline: uncomfortable, somewhat disgusted, a little in love, and ready to never watch it again.     ",
      "the-cable-guy": "9/10 i'm having a lot of trouble comprehending how this movie exists     ",
      "bohemian-rhapsody": "2/10 whoever did the fucking horrendous fake teeth must've watched the godfather one too many times and instead of stuffing a couple pieces of toilet tissue in rami malek's mouth, they shoved the entire goddamn roll     ",
      "the-lovebirds": "7/10 no matter what gender, sexuality, race, religion, or age you are, there is absolutely no escape from Fireworks by Katy Perry.  There. Is. No. Escape.     ",
      "somethings-gotta-give": "8/10    alright guys, hear me out. i have discovered the truth behind this film. are you ready? jack nicholson's character?  HE'S WARREN BEATTY.  let's start with the obvious: the womanizing. jack nicholson's character is a flirty man who can seemingly get any woman in the world. he's old but dates girls half his age. remind you of anyone? maybe... warren beatty? one of the most INFAMOUS womanizers of hollywood? in his hay-day, warren beatty had a confirmed TWENTY SEVEN relationships. but...     ",
      "rules-dont-apply": "6/10 alright which one of the FOUR editors is responsible for the first 45 minutes? prison NOW     ",
      "the-fury": "8/10 the things I would do to do john cassavetes     ",
      "fantasy-island": "4/10 lucy hale definitely wears the strap     ",
      "body-double": "4/10 not even joking someone in the comments pleade explain what happened     ",
      "model-shop": "7/10 jacques demy's filmography be like can I get five more of these little blonde heartbroken crying bitches?     ",
      "interview-with-the-vampire": "7/10 would you believe me if I told you that this movie is about a gay vampire couple (tom cruise and brad pitt) struggling to raise their young lesbian vampire daughter (kirsten dunst)? because I just watched this movie and I still don't believe it     ",
      "running-on-empty-1988": "10/10 river phoenix best actor to ever live     ",
      "parenthood": "8/10 there is a scene in this movie where keanu reeves describes joaquin phoenix masturbating as \"slapping the salami\" to dianne weist     ",
      "the-hunger-games-mockingjay-part-2": "7/10 if you are anything other than team peeta you deserve the death sentence ❤️     ",
      "the-hunger-games-mockingjay-part-1": "8/10 still rips     ",
      "the-hunger-games-catching-fire": "9/10    the absolutely annoying, horny, throbbing crush I had on finnick odair as a preteen did NOT go away. it's actually worse now. there is no one like him. NO ONE. #justiceforfinnick     ",
      "out-of-sight": "7/10 if this movie was as sexy as its sexiest scene, it would be the sexiest movie ever made     ",
      "the-twilight-saga-breaking-dawn-part-2": "9/10 and that? that's on .     ",
      "the-twilight-saga-breaking-dawn-part-1": "9/10 everytime jacob appears on screen, an angel loses its wings #teamedward     ",
      "twilight-2008": "8/10 my mom forced me to watch this and then quoted the entire thing and then started crying because she didn't have someone like edward and I told her that their relationship was actually really abusive and she said \"Sweetie I know, me and your dad got divorced because of this movie.\" and now she's running around the house looking for something to eat Please save me     ",
      "quiz-show": "8/10 can't believe martin scorsese won his first oscar for best actor in a motion picture for his revolutionary performance in Quiz Show (1994) dir. Robert Redford     ",
      "a-new-leaf": "8/10 happy birthday taurus legend elaine may     ",
      "married-to-the-mob": "9/10 matthew modine and michelle pfeiffer i am now asking for BOTH of your hands in marriage, please sign this document so we can all be married and fall in love an-     ",
      "the-woman-in-the-fifth": "2/10 the things I suffer through for ethan hawke's sexy ass...     ",
      "creep-2": "9/10 why the fuck did this not win best picture     ",
      "synecdoche-new-york": "5/10 damn charlie kaufman pick a struggle     ",
      "angels-in-america": "10/10 \"If I can find hope anywhere, that's it, that's the best I can do. It's so much not enough. It's so inadequate. But still bless me anyway. I want more life.\"     ",
      "ordinary-people": "10/10 the best movie about mental illness ever made? why is this not more talked about?     ",
      "amadeus": "9/10 i knew mozart was an aquarius the EXACT MOMENT his goofy annoying ass walked into the room     ",
      "hiroshima-mon-amour": "10/10 \"The only memory I have left is your name... I yearn for you so badly I can't bear it anymore.\"     ",
      "lick-the-star": "8/10 phantom thread for depressed girls in the late '90s     ",
      "down-with-love": "10/10 THIS IS JUST EWAN MCGREGOR'S VILLAIN ORIGIN STORY OF HOW HE WENT FROM BEING A TOP TO A BOTTOM     ",
      "a-woman-under-the-influence": "10/10 hardest time I've ever had watching a movie. started crying 10 minutes in and never really stopped.     ",
      "a-dangerous-method": "7/10 My love for you was the most important thing in my life. For better or worse, it made me understand who I am.      ",
      "violet-daisy": "8/10 this movie is fun you guys just hate women     ",
      "the-devils-arithmetic": "4/10 why 😭😭     ",
      "la-confidential": "5/10    lmao you're gonna tell me the only character trait they give russell crowe is that he's a woman protecting feminist king and then he violently assaults the woman he's \"in love with\"? tell it to the judge Bud White     ",
      "the-deer-hunter": "6/10 not enough robert de niro schlong     ",
      "school-of-rock": "10/10 TALENTED, BRILLIANT, INCREDIBLE, AMAZING, SHOW STOPPING, SPECTACULAR, NEVER THE SAME, TOTALLY UNIQUE, COMPLETELY NOT EVER BEEN DONE BEFORE, UNAFRAID TO REFERENCE OR NOT REFERENCE, PUT IT IN A BLENDER, SHIT ON IT, VOMIT ON IT, EAT IT, GIVE BIRTH TO IT     ",
      "night-moves-2013": "7/10 if I ever see that little mark zuckerberg bitch in person... it's on sight     ",
      "blackhat": "8/10 this movie is for bad bitches only     ",
      "the-bridges-of-madison-county": "10/10 \"I don't want to need you, cause I can't have you.\"     ",
      "the-insider": "9/10 al pacino is my husband... I would do anything for him... my taurus king... the love of my life     ",
      "a-league-of-their-own": "7/10    THIS WOULDVE BEEN A GOOD MOVIE IF THE ANTICHRIST HERSELF AKA DOTTIE'S SISTER AKA LORI PETTY HADNT WON I FUCKING HATE HER SO FUCKING MUCH IVE NEVER BEEN SO DISAPPOINTED IN A MOVIE IN MY ENTIRE LIFE FUCK YOU KIT I FUCKING HATE YOU GO FUCK YOURSELF AND FUCKING DIE     ",
      "come-and-see": "10/10 100%, no doubt in my mind, this is the best film ever made. I cannot believe this is real, I'm so fucking glad I saw this in theaters.     ",
      "ralph-breaks-the-internet": "7/10 GAY GAY GAY GAY GAY GAY     ",
      "emma-2020": "9/10 josh o'connor for best picture     ",
      "bound": "10/10 this is it. the best movie I've ever seen     ",
      "oh-hello-on-broadway": "9/10 Ravi! It's George. I'm on the floor. My blood sugar's crashing. Could you go get me a Ferrero Rocher chocolate? Or a Lindt Lindor truffle? My favorite flavor is blue.      ",
      "dead-ringers": "8/10 i'm not saying we should legalize incest bu-     ",
      "muriels-wedding": "8/10 this one's for love, my future in new york, and new beginnings     ",
      "certified-copy": "9/10 \"All she wants from you is that you walk beside her and lay your hand on her shoulder. That's all she's longing for. But for her, it's vital. But all your problems can be solved by a simple gesture. Do it and set yourself free.\"     ",
      "philadelphia": "9/10 jonathan demme I miss you so much     ",
      "the-lodge-2019": "7/10    FUCK DEM KIDS     ",
      "25th-hour": "9/10 \"It all came so close to never happening. This life came so close to never happening.\"     ",
      "the-favourite": "10/10 best movie ever made     ",
      "cries-and-whispers": "9/10 really hard for me to watch this. I was stuck with the image of my brother right before he died, especially the moment in the film where all you can hear are the sounds of her in pain. I miss him so much, but I'm so glad I did watch this. bergman is the master of sorrow.     ",
      "portrait-of-a-lady-on-fire": "10/10    \"After a while, you'll see her when you think of me.\"     ",
      "la-pointe-courte": "8/10 \"I know you by heart.\"     ",
      "ma-2019": "8/10 MAsterpiece     ",
      "uncle-yanco": "9/10 \"The sea is the element of love.\"     ",
      "final-task": "7/10 as always milez shows a lot of promise and skill in his short films. besides some continuity mistakes in the beginning with the drinks and some lighting issues, all the performances are great and the direction is confident and exciting.great job milez!!     ",
      "three-colours-red": "10/10 oh fuck     ",
      "the-assistant-2019": "8/10 so quietly powerful, this is a female film through and through. gut wrenching in the simplest way. julia garner is a superstar     ",
      "parasite-2019": "10/10 \"She may look like a sheep, but inside, she's a fox.\"     ",
      "happy-together-1997": "8/10 I finally understood how he could be happy running around so free. It's because he has a place he can always return to.     ",
      "birds-of-prey-and-the-fantabulous-emancipation-of-one-harley-quinn": "8/10 yeah I support women's rightswomen's rights to FUCK MY SHIT UP     ",
      "tomboy-2011": "9/10 the relationship between mikäel and jeanne was the most beautiful portrayal of siblinghood I've ever seen on screen, and makes me miss crawling into my brothers bed when I was scared at night. It's incredible that céline captures the essence of complex emotions, relationships, and the feeling of longing for something/someone in the most delicately gentle way.     ",
      "miss-americana": "8/10 it's you and methere's nothing like thismiss americana is out on netflixwe're so gladwe paint the town redvoted most likely to cry watching the new taylor swift documentary     ",
      "le-bonheur": "9/10    \"It's not my fault if you came second. That's the way it is!\"     ",
      "the-gentlemen": "9/10    1. this movie is filled to the BRIM with the hottest men2. jeremy strong is doing the best kevin spacey impression i've ever heard3. michelle dockery PLEASE STEP ON MY FACE4. i want to nurture and protect colin farrel and his lads 5. gay hugh grant wanting to fuck charlie hunnam... yeah     ",
      "the-ascent": "10/10 maybe the most devastatingly beautiful film I've ever seen     ",
      "paris-is-burning": "9/10 let's exchange the experience      ",
      "shadows-1958": "7/10 \"That's what I'm trying to do every day in this crazy rat race, man. Is, I got to be me.\"- Nick Kroll as Gil Faizon in Oh, Hello on Broadway- John Cassavetes in Shadows.     ",
      "color-out-of-space": "7/10 SLAM DUNK     ",
      "landline": "10/10 I thought I was okay and then Sister by Angel Olsen started playing and then I realized I want to scream and cry and be loved and get over you and die... fuck this movie for being everything I've been feeling for the past month     ",
      "jenny-slate-stage-fright": "9/10 BORN WITH THE HORNINESS OF A 57 YEAR OLD DIVORCÉE WHO'S LIKE \"MAMA LOVES TO FUCK... WHO'S UP? TICK TOCK, ROMEO. LET'S GO\"     ",
      "what-did-jack-do": "4/10 filmbros be like\"what did jack do?\" is the greatest film of the decade (and yes this counts as a feature length film) and spoke to me on a deep emotional level. i am crying so hard     ",
      "honeyland-2019": "5/10 when it's focusing on the main lady and her bees (and her cats!), this is wonderful. unfortunately though, this documentary spends too much time on her neighbors, mostly the annoying men and their annoying male children. i'm exhausted     ",
      "the-king-of-comedy": "9/10 todd phillips is rupert pupkin     ",
      "1917": "4/10 would rather watch dunkirk on an ipod nano     ",
      "carlitos-way": "8/10    would do literally anything to have al pacino break down my door just to have sex with me     ",
      "the-talented-mr-ripley": "9/10    \"Tom is talented. Tom is tender. Tom is beautiful. Tom is a mystery. Tom is not a nobody. Tom has secrets he doesn't want to tell me, and I wish he would. Tom has nightmares. That's not a good thing. Tom has someone to love him. That is a good thing. Tom is crushing me.\"     ",
      "little-women-2019": "10/10 i'm so warm with love. thank you great gerwig     ",
      "eyes-wide-shut": "10/10 I say this with no hesitation this is the scariest movie I have ever seen     ",
      "clinger": "6/10 the funniest movie ever made please watch this immediately it's on amazon prime     ",
      "wounds": " I will pay someone $50 if they can coherently explain the plot and ending of this movie to me     ",
      "crash-2004": "1/10 go fucking fuck your fucking self     ",
      "chicken-little-2005": "6/10 do you guys think florence pugh and zach braff have discussed this movie     ",
      "9-11-2017": "2/10 never forget     ",
      "bombshell-2019": "1/10 I will not be accepting comments when I say men should never be allowed to write or direct movies about women's sexual assault experiences and also that Bombshell is the worst movie of the decade.     ",
      "john-mulaney-the-sack-lunch-bunch": "10/10 jake gyllenhaal just gave us the performance of the decade     ",
      "the-titan": "2/10 everything I do.... I do it for noah jupe     ",
      "wonder-2017": "8/10 noah jupe I love you     ",
      "luce": "2/10 this movie is absolutely idiotic and insane and stupid and i hate it. i hate luce and his stupid name so much and you can all tell me i'm missing the point of this movie but fuck luce and fuck his stupid mom and fuck this movie. luce, it's time to die. luce literally is the worst character of all time i hate his stupid smile and his stupid voice i hate everything about him and i get that i'm supposed to sympathize with him but FUCK LUCEEEEEEE!!!!!!!!!!!!!!!!     ",
      "her-smell": "8/10 elisabeth moss PLEASE FOR THE LOVE OF GOD beat the shit out of me     ",
      "midsommar": "7/10    Imagine being left out of your family's suicide lmao     ",
      "phantom-thread": "10/10 After Phantom Thread ended, two older women walk out of the theater, laugh, and say, \"You do what you have to do to make your relationship work. It was perfect.\"  In other words, it'll be hard for any film this year to beat this. Paul Thomas Anderson is in love with filmmaking and its so obvious in the way Phantom Thread is presented. Hilarious, tantalizing, enchanting, and beautiful. Vicky Krieps steals the show.     ",
      "american-psycho": "9/10 merry christmas     ",
      "uncut-gems": "9/10 THIS IS HOW I (AND ADAM SANDLER) WIN (HIS OSCAR)     ",
      "cats-2019": " I never review movies before they come out but someone needs to go to prison for this     ",
      "it-chapter-two": "1/10 THIS MOVIE IS SHIT LMAOOOOO     ",
      "mystic-river": "6/10 FUCK YOUUUUUUUUUUUUUU     ",
      "a-hidden-life-2019": "8/10 bruno 💗     ",
      "the-assassination-of-jesse-james-by-the-coward-robert-ford": "6/10 gay     ",
      "suburbicon": "3/10 Noah Jupe for President     ",
      "honey-boy": "10/10 \"I'm going to make a movie about you.\"  Honey Boy is not perfect (update—it very much is perfect). But Honey Boy is loud, and with emotions as honest and raw as these, loud is perfect. Loud enough to give me bruises and stains of mascara on my cheeks, honest enough to dig up old phone calls with my dad, raw enough to leave me in pieces. All I know right now, with the scars Honey Boy left with me, is that Noah...     ",
      "the-godfather": "8/10 it's no the irishman     ",
      "ford-v-ferrari": "9/10 NOAH JUPE     ",
      "jojo-rabbit": "4/10    Sam Rockwell plays a gay nazi     ",
      "the-report-2019": "5/10 anyways watch Zero Dark Thirty     ",
      "the-goldfinch": "8/10 \"This is the painting I love most.\"  Okay. Yes. This movie is bad. The editing is bad, the script is bad, the score is bad. The pacing is insane and the acting is bizarre. Finn Wolfhard is horrendous and Ansel Elgort is just a sad puppy dog the whole time. I have no reason to like this movie because it is objectively bad.  But fuck it. I love this bad movie.     ",
      "the-souvenir": "6/10 genuinely so proud of myself for making it through this entire movie     ",
      "i-am-easy-to-find": "10/10 \"But I'm learning to lie here in the quiet lightWhile I watch the sky go from black to greyLearning how not to die inside a little every timeI think about you and wonder if you are awakeAnd I'm learning to live without the heartache it gives meNothing I wouldn't do for another few minutesLearning how not to cry every time there's another sad unbearable morningBut sometimes there's nothing I can do\"     ",
      "far-from-heaven": "9/10 \"We would just talk... and somehow, it made me feel, I don't know, alive somewhere. Eleanor, I know it's ridiculous and mad but I think of him, I do. What he's doing, what he's thinking... I do.\"     ",
      "alice-doesnt-live-here-anymore": "10/10 I love movies     ",
      "the-wolf-of-wall-street": "9/10 4 stars for margot robbie, 1/2 for dicaprio's ass     ",
      "knives-out-2019": "9/10 Ana de Armas. That's it that's the review.     ",
      "marriage-story-2019": "10/10    Marriage Story begins and ends with love.  There's anger in between. Rage, confusion, blistering pain, bitterness, grief, and fear. There's moments of friendship that are closely followed with the remembrance of loss, remains of a marriage that once was.  But Marriage Story begins and ends with love. For whatever was in between, whatever tore them apart, there begins the nostalgia of falling for each other. There's always love.  And that is what makes Marriage Story the best film of the year.     ",
      "cold-war-2018": "10/10 \"Let's go to the other side. The view will be better there.\"  Forever drawn to each other, incapable of forgetting. Escape was never an option. For them, love is eternal.     ",
      "vox-lux": "8/10 \"I looked SO ugly, and it made me wanna DIE!\"     ",
      "long-shot-2019": "10/10 It's a master-fucking-piece     ",
      "apocalypse-now": "9/10 war™ is bad.     ",
      "seth-meyers-lobby-baby": "8/10 seth meyers good boy     ",
      "motherless-brooklyn": "4/10 \"Okay\" - ian     ",
      "ad-astra-2019": "10/10 My boyfriend: Why is Tommy Lee Jones in this?Me: Cause it's a good movie My boyfriend: But Tommy Lee Jones doesn't make good movies     ",
      "joker-2019": "4/10 Todd Phillips is trying to tell you that he's not trying to tell you anything. He snickers and nods behind the camera of his attempt at the movie version of \"We Live In A Society\", where female characters are props and violence isn't justified, but rather are excuses for a wimpy, poorly written character. Todd Phillips and his awareness of his apparent \"unawareness\" is why Joker fails.  An audience can make excuses for a filmmaker for as long as possible,...     ",
      "the-fanatic": "    [Moose leaves an envelope for Dunbar on the front yard, but he notices Dora, one of the housekeepers, pick up the envelope. He runs towards her as she prepares to open it] Moose: No, don't read it! Don't read it! Don't read it! Dora: What are you doing? Moose: I said don't read it! [Dora hits Moose with a feather duster] Dora: Out! Out! Moose: Ow! Stop hitting me! [as Dora continues to hit him with the feather duster, Moose...     ",
      "jfk": "8/10 The shortest 3 **and a half** hour movie I've ever seen     ",
      "inglourious-basterds": "10/10 the fact that melanie laurent did that though     ",
      "sierra-burgess-is-a-loser": "1/10 Love some casual played-for-fun sexual assault in my movies     ",
      "twelve-monkeys": "8/10 \"I feel like I've known you before. I feel I've always known you.\"     ",
      "freddy-got-fingered": "1/10 thanks babe for the 1 year anniversary gift     ",
      "to-the-bone-2017": "5/10 straight men who sing and wear fedoras are a disease     ",
      "replicas": "1/10 maybe the most confused and completely upsetting movie ever made. when my brother died in 2011, my mom and i went through the most excruciating, yet necessary act of life CALLED GRIEF. when one of you lovely movie viewers loses a family member/friend, it will be painful. but Fucking Christ I would NEVER IN A MILLION YEARS TRADE MY FUCKING BROTHER FOR A CLONE COPY AND BE OKAY WITH MYSELF. When I was watching this I thought to myself, \"okay,...     ",
      "shazam": "8/10 Zachary Levi may have been married to a woman but God if that man isn't a twunk*     ",
      "fantastic-four": "1/10 Release the Snyder cut     ",
      "scream-2": "9/10 No cops at pride just Courtney Cox and Neve Campbell with their guns     ",
      "pet-sematary-2019": "3/10    Bruh I was so excited for Gage to get hit by that truck again why did this movie do me dirty like this     ",
      "billionaire-boys-club-2018": "1/10 I've heard my whole life that love has no limits. Well, let me tell you, none of you who've said that have had to watch Billionare Boys Club for your Taron Egerton obssesed boyfriend.     ",
      "home-alone-4": "1/10 Glaring continuity in this movie. Kevin tells his mother he loves her, when he obviously doesn't give 2 shits about anyone but himself. Shameful.     ",
      "sing-2016": "1/10 Suicide     ",
      "us-2019": "7/10 \"we're americans\"     ",
      "toy-story-4": "8/10 This movie has everything. Abandonment, Keanu Reeves playing a Canandian stunt man, clinging to the past, saying goodbye to people you love, Forky,     ",
      "multiple-maniacs": "5/10 couldn't eat during this one     ",
      "tour-de-pharmacy": "8/10 Freddie Highmore playing a woman? Genius casting     ",
      "cry-baby": "10/10 Too many good quotes to just pick one so  \"I'm so tired of being good!\"\"It's not sexy, electricity makes me INSANE!\"\"No wonder we're together, honey, we're both orphans!\"\"Orphans have special needs.\"\"I'M BURNING INSIDE TO TOUCH YOU BABY!\"\"Your honor, could we take Wanda the fuck home?\"\"I pay taxes on cigarettes, don't I? And what do I get for those taxes? Happiness? Hell no! I get tuberculosis!\"\"You can't lock up his music!\"\"God bless Richard...     ",
      "robin-hood-2018": "3/10 Bennie and the jets     ",
      "schindlers-list": "10/10 genuinely and completely perfect, I've only heard good things about this but I was never expecting to lose myself in it as much as I did. this film respectfully honors every person who died in the holocaust in the most beautiful and sympathetic way possible. nothing here is manipulating, everything is true.     ",
      "dybbuk-box-true-story-of-chris-chambers": " Uhhhh... further review later I need to talk about this later     ",
      "dark-phoenix": "2/10 Glad we saw this at a drive-in so we could turn the audio for Secret Life of Pets 2 and listen to that instead     ",
      "romy-and-micheles-high-school-reunion": "8/10 romy and michele are my moms     ",
      "insidious": "9/10 I want patrick wilson to be my daddy 🥺     ",
      "gremlins-2-the-new-batch": "8/10 Joe Dante said Fuck Everyone     ",
      "godzilla-king-of-the-monsters-2019": "9/10 Did I see a different movie from all you tasteless idiots? This deserves best picture     ",
      "rocketman-2019": "8/10 I think my boyfriend may be in love with either Taron or Elton I couldn't tell, but he sobbed THE ENTIRE FUCKING MOVIE     ",
      "extremely-wicked-shockingly-evil-and-vile": "5/10 extremely stupid, shockingly dumb and pointless     ",
      "avengers-endgame": "7/10 make a 3 hour ant-man movie and you'll have my respect     ",
      "the-perfect-date-2019": "3/10 If someone had told me that me and Noah Central were gonna have the same birthday, I would've warned my parents to wait just a couple days before conceiving me.     ",
      "the-best-of-enemies-2019": "4/10 C.P ELLIS, PRESIDENT OF THE KKK, STANDS FOR COLORED PERSON ELLIS!!! LITERALLY WHAT ABOUT IT???     ",
      "green-book": "5/10 guess racism has an expiration date now!     ",
      "skin-2018-1": "2/10 Sounds about white     ",
      "first-man": "8/10 ryan gosling didn't look pretty on screen for 2 hours to lose to a rat with fake teeth     ",
      "nymphomaniac-volume-i": "7/10 considering I watched this as a sad 11 year old I really enjoyed it the second time around. very sad though and made me feel guilty for years     ",
      "velvet-buzzsaw": "6/10    it's fun garbage     ",
      "at-eternitys-gate": "5/10 paul gauguin to vincent van gogh: sorry m8 can't be your friend anymore, our star signs aren't compatible 😝😖☹️ it's me not you babe     ",
      "can-you-ever-forgive-me": "9/10 Melissa McCarthy and Richard E. Grant give two of the best performances of the year and will go completely unrecognized. And that, my friends, is a greater crime than forgery.     ",
      "shoplifters": "9/10 \"If they love you, this is what they do.\"     ",
      "the-terrible-two": " WATCH THIS AND BELIEVE IN CINEMA AGAIN     ",
      "roma-2018": "10/10 Alfonso Cuarón didn't release this beautiful film in in theaters just so Bohemian Rhapsody could be played in the theater next to it and rudely play Queen over EVERY EMOTIONAL SCENE     ",
      "lake-alice": "1/10 I agree with Joshua     ",
      "triangle-2009": "7/10 Hit the road, jack     ",
      "if-beale-street-could-talk": "9/10 this movie made me feel helpless, hopeful, sad, happy, broken, fixed, enraged, calm, and at peace all at the same time.     ",
      "life-itself-2018": "1/10 If this is what life is like then please count me out     ",
      "slender-man": "1/10 Watched the first 20 minutes and gave up. I can only look at Joey King's face for so long.     ",
      "pain-gain": " WHY WOULD THIS BE BREAST MILK     ",
      "widows-2018": "8/10    I keep telling y'all... never trust a man.     ",
      "trick-r-treat": "9/10 let's be real this movie is insanely brilliant     ",
      "halloween-2018": "7/10    GOTCHA     ",
      "alien-covenant": "9/10    I love only 2 men and michael fassbender is both of them     ",
      "a-wrinkle-in-time-2018": "4/10 never have I wanted so badly to shove a vest wearing, gay nerd into a locker before but alas here we are.     ",
      "hereditary": "10/10 I honestly don't know how to talk about this movie. There are no words that could describe how terrifying, heartbreaking, hysterical and fucking brilliant this movie is. Nothing could have ever prepared me for this.   It's been almost an hour since I walked out of my Hereditary screening, and I find myself baffled. Still shaking and laughing, trying to have a normal conversation with my mom. I have fallen in love with movies over and over again, but horror movies...     ",
      "the-kissing-booth": "1/10 this is 13 reasons why for single people who hate themselves     ",
      "venom-2018": "6/10 this is a simulation     ",
      "leave-no-trace": "8/10    \"I know you would stay if you could.\"     ",
      "when-harry-met-sally": "10/10 the rest of my life just started     ",
      "there-will-be-blood": "9/10 i want daniel day-lewis to drink my milkshake     ",
      "gone-baby-gone": "5/10 yeah fuck this movie     ",
      "shotgun-stories": "8/10 I would give Michael Shannon my life if he would just promise to spit on my coffin at my funeral     ",
      "columbus-2017": "9/10 I am Crying So Much     ",
      "blackkklansman": "9/10 IS YOUR DICK UNCIRCUMSTANCED     ",
      "you-were-never-really-here": "10/10    \"Let's go. It's a beautiful day.\"     ",
      "the-house-2017": "6/10 Movies can be fun? Who knew!     ",
      "lean-on-pete": "10/10 \"I just miss him a lot. I miss him so much.\"     ",
      "christopher-robin": "7/10 Can someone get my dad a group of animal friends so that he can finally learn how to be in my life? Thanks!     ",
      "little-children": "9/10 This movie is not happy     ",
      "the-poughkeepsie-tapes": "4/10 there's one moment in this movie where the people being interviewed get mad about 9/11 happening, not cause they're sad about 9/11, but because they were angry that the news wouldn't cover their own stories because THE NEWS WAS TOO BUSY COVERING 9/11. WHY IS THIS MAKING ME SO ANGRY     ",
      "the-devils-rejects": " \"I set my standards pretty low so I'm never disappointed.\"     ",
      "eighth-grade": "10/10    The car scene broke me into a trillion pieces. It tore me down, ripped me of my skin and then let me bleed. But after the movie was over, it bandaged me and I could breathe.   I've been where she was. The youngest one in the room, left alone with some guy way older and way stupider. When you're 13, you never really say what you want until you've been taken to your line. You agree and agree and agree,...     ",
      "mission-impossible-fallout": "10/10 Tom Cruise will never die     ",
      "dr-strangelove-or-how-i-learned-to-stop-worrying-and-love-the-bomb": "8/10 Peter Sellers was a dilf     ",
      "step-brothers": "8/10 \"I couldn't eat another bite of turkey without thinking of you inside of me. Come on, let's try something illegal.\"     ",
      "superman": "7/10 Can someone please teach Lois Lane how to spell?     ",
      "mission-impossible-iii": "9/10 Tom Cruise is not real     ",
      "unfriended-dark-web": "10/10 This is the best movie I've ever seen, so much so that I saw it a second time in a DRIVE IN (best decision ever?) and luckily got the second ending which is INCREDIBLE. This movie is the light of my life.     ",
      "call-me-by-your-name": "10/10 \"I remember everything.\"  I remember everything. I couldn't put this film into words if I tried. I couldn't ever review this, or even explain how personal this felt to me. Every kiss, every movement, every laugh, every dance, every look, goodbye, embrace. If I could, I couldn't even begin.   \"I remember everything.\"     ",
      "the-master-2012": "8/10 \"If you leave me now, in the next life you will be my sworn enemy. And I will show you no mercy.\"I really miss Phillip Seymour Hoffman.     ",
      "the-man-from-uncle": "8/10 Gay     ",
      "fateful-findings": " Uhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhh     ",
      "fantastic-mr-fox": "10/10 I refuse to believe that this didn't win best  actor, actress, supporting actor, supporting actress, cinematography, score, animated movie, director, writing, and all the other oscars?     ",
      "fifty-shades-of-grey": "6/10 i'M fiFtY sHaDeS oF FuCkEd Up     ",
      "jurassic-park": "10/10 Good movie     ",
      "spider-man-3": "9/10 Fuck you all this movie has a man who literally TURNS INTO SAND and it's fucking hilarious and I would die for it so fuck you     ",
      "crazy-stupid-love": "8/10 Yes     ",
      "american-animals": "4/10 I do not know why this movie exists. It's trying so hard to be cool and ends up just being unwatchable, but nice try I guess!     ",
      "sorry-to-bother-you": "8/10 Bojack Horseman would be proud     ",
      "skyscraper-2018": "4/10 MEGA GAY     ",
      "mulholland-drive": "9/10 first time viewing and I literally cannot wait to watch this again.     ",
      "coco-2017": "9/10 Me: Haha I love Coco! It's so funny and cute!Coco: Your family might forget you and because of that you may never see them after you die.Me: Hahahahaha the dog can fly :)     ",
      "hot-summer-nights": "4/10 this movie works at Zumiez     ",
      "sicario-day-of-the-soldado": "2/10 My mom is the biggest Benicio del Toro fan on the face of this earth, and yet during the middle of this she leaned over and whispered, \"Are you ready to leave yet?\" (OH, AND WE LEFT!!)     ",
      "the-forest-2016": "2/10 Lmao no thanks     ",
      "flower-2017": "4/10 You can 10000% tell that this was written by one of the 4 (!!! FOUR?) men who DID CREATE THIS MESS who had a hot step-sister who they wanted to fuck so they created the manic pixie dream girl version of her and then the character of Erica was born! Who apparently loves to suck dick (wrong), who loves to fuck pedophiles (wrong), and who wants to fuck her kind of brother (WRONG)!!! WhAT THE FUCK IS THIS MOVIE!!!!! If anyone has any idea what TJE FUCK IS GOUNG ON ID LOVE TO KNOW     ",
      "chef": "8/10 I have such a weird relationship with this movie and it's 100% because of my shitty relationship with my dad but I keep coming back to it and I've seen it like 4 or 5 times and I won't stop anytime soon so fuck dads and I love you Chef (2014) dir. Jon Favreau!     ",
      "the-guest-2014": "9/10 the neon guest (2014) saved me and i have been reborn.     ",
      "friend-request": "1/10 why do I keep watching movies     ",
      "frances-ha": "8/10 this further proves my point that girls are incredibly strong     ",
      "the-den": "7/10 bro you just gotta throw the whole computer away     ",
      "face-2-face-2016": "6/10 Gay people are so predictable smh     ",
      "before-sunset": "10/10 \"I have these dreams, you know, that I'm...I'm standing on a platform, and uh, you keep going by on a train, and...you go by, and you go by, and you go by, and you go by, and I wake up with the fucking sweats, you know? And then I have this other dream, oh...where you're...pregnant, in bed beside me, naked, and I want so badly to touch you, but you tell me not to and then you look away and...and...     ",
      "reality-bites": "7/10 ethan hawke was one GREASY bitch wasn't he     ",
      "alex-strangelove": "5/10 😂 Who did this 😂     ",
      "carol-2015": "10/10 I've always struggled with my sexuality. From 7th-8th grade I was 100% sure I was gay, until I realized I wasn't and had a major panic attack. Having to un-come out to all of my friends was one of the most heart wrenching and upsetting things I ever did. I was so embarrassed, ashamed, and felt completely idiotic.   I know now that I am bisexual and am completely comfortable with it.   I've never been confident. I never believe I can...     ",
      "beginners": "10/10 this movie is perfect     ",
      "solo-a-star-wars-story": "5/10 Who is responsible for lighting this movie. Please give them my number, I would like to have a word with them. There is NO WAY that the cinematographer of FUCKING ARRIVAL did this. I literally COULD NOT SEE ANYTHING THAT WAS GOING ON IN THE FIRST HOUR. What the fuck happened. Who is responsible. Other than that I have no strong emotions towards this movie. Goodnight!     ",
      "the-pregnancy-pact": "2/10 Bitches.... be crazy?     ",
      "thoroughbreds-2017": "10/10 chills     ",
      "oceans-eight": "8/10 women     ",
      "wont-you-be-my-neighbor": "10/10 Unbelievably perfect. Go see this if you can, it's just so good. The entire theater was crying from the first 10 minutes. I don't have any other words besides I believe in love and the goodness in the world we live in. Thank you Mr. Rogers.     ",
      "logan-lucky": "10/10 this movie is the only good thing left in this godforsaken planet and we took it for granted     ",
      "bug-2006": "8/10    Everything in this movie makes sense to me except the doctor smoking crack. Someone please explain this to me and my confused mother.     ",
      "upgrade": "6/10 dumb but fun     ",
      "donnie-darko": "10/10 happy birthday to my main man, jake gyllenhaal. you gave us donnie darko, you gave us bubble boy, and for that we love you forever.     ",
      "up-in-the-air": "8/10 yeah this one hurt     ",
      "annihilation": "9/10 the last 15 minutes of this movie are scarier than anything I've ever seen in my entire life     ",
      "first-reformed": "8/10 like if Mother! was actually good     ",
      "you-get-me": "2/10 I would really like to speak to whoever casts these shitty teen melodramas. I swear to god every single one stars the same limp dick, no lipped, elf eared whitey who really gets exactly what he deserves. Or are men just getting more and more unattractive? More bland? Why am I so attracted to Bella Thorne in this bland white movie? Someone just fucking kill me     ",
      "deadpool-2": "3/10 movies are not good     ",
      "speed": "10/10 THE FUCKING BEST FILM I HAVE LITERALLY EVER SEEN     ",
      "big-trouble-in-little-china": "9/10 this movie makes no sense but that's what makes sense about it     ",
      "tremors": "9/10 Uh dare I say, the greatest and most homoerotic film ever made?     ",
      "mistress-america": "10/10 There is no way I could ever write anything to explain how perfect this movie is, so I'll leave you with the screenplay. (I tried to paste it, but it was too long. So here.)   Also, thank you Logan, for 5 hour talks and movies like this.     ",
      "where-the-wild-things-are": "10/10 There's so much of you in this.  I see you everywhere. In Max's anger and frustration, in his wonder and imagination. The undeniable loneliness we both felt through our parents divorce. I know you hated this movie cause it scared you, but I find comfort in the fact that it's you. When I can't run up to you and hug you and say sorry for the lost nights, I can find you here.   I miss you more than ever but I feel you more than ever.     ",
      "fences-2016": "7/10    I have no sympathy for the cheating man. especially one that cheats on viola davis. fuck off buddy.     ",
      "the-switch": "4/10 me at 11:30 the night before my final in a class I'm on the verge of getting a C in: huh maybe I should watch some shitty jason bateman comedies!     ",
      "the-rider": "9/10 I am crying in Cowboy     ",
      "terminal-2018": "3/10 if the neon demon, suicide squad, and riverdale had a child it would only be half as ugly as this movie is!!     ",
      "guardians-of-the-galaxy-vol-2": "8/10 drax's laugh is gonna save the world     ",
      "tully-2018": "9/10 tully is infectiously sweet, dreamy, otherworldly. watching this with my mom made it all the better, crying into each others arms watching a world we both knew and dreamt of. life and motherhood are intertwined with love and dreams. tully is magic.     ",
      "last-tango-in-paris": "1/10 fuck marlon peanut dick brando, fuck the director, and fuck anyone who likes this movie.     ",
      "the-grand-budapest-hotel": "10/10 agatha <<<3333 [redacted]     ",
      "isle-of-dogs-2018": "10/10    In the middle of watching Isle of Dogs, the first film I've seen at a private screening, and one I had been waiting for for what seems like years, I realized I was watching what might be the best adventure film ever made.   If you know anything about me, you know that Wes Anderson has been my favorite filmmaker for a very long time, and that there isn't a film of his that I don't absolutely adore. When I heard...     ",
      "a-quiet-place-2018": "8/10 why on god's green earth would john krasinski realease this during FUCKING ALLERGY SEASON     ",
      "election": "10/10 the quintessential he got what he deserved movie     ",
      "the-1517-to-paris": "2/10 uGGGHHhHhHhHHHhHhHhHHHHHHH     ",
      "99-homes": "8/10 andrew garfield is a pussy ass bitch no printer just fax     ",
      "my-neighbor-totoro": "10/10 A MORE CHEERFUL AND PERFECT MOVIE EXPERIENCE DOES NOT EXIST!     ",
      "loveless-2017": "    My mother has been through the worst of the worst. She lost her child, which she always tells me is something no one besides a parent would ever understand. She grieved with me and by herself, and although I know what loss is, I don't think I will ever understand what she went through.   Watching this film made me feel nothing. I think it was supposed to, which is why I don't absolutely hate it, but I've never felt like...     ",
      "the-social-network": "9/10 \"Sorry, my prada's at the cleaners! Along with my hoodie and my 'fuck you' flip-flops, you pretentious douchebag!\"     ",
      "oceans-eleven-2001": "10/10 this was my favorite movie of all time when I was a kid, and I'm so glad it holds up. also I'm starting to realize brad pitt only plays gay characters. I'm starting a gofundme to have brad pitt as the face of the LGBTQ+ community. please support me     ",
      "leprechaun-4-in-space": "6/10 masterpiece pt. 2     ",
      "leprechaun-3": "7/10 masterpiece     ",
      "boyhood": "10/10 this movie is the love of my life but when they're playing charades and they tell samantha she can't use props she uses her skirt AND THATS STILL A PROP THIS WILL BOTHER ME FOREVER.     ",
      "tank-girl": "8/10 gay lmao     ",
      "the-witch-2015": "7/10 SO SLOW but SO ATMOSPHERIC.     ",
      "mulan-ii": "2/10 This movie is a threat to ALL my senses     ",
      "mute-2018": "2/10    I absolutely love when a movie has a blue haired manic pixie dream girl that's only purpose is to die and the pedofile is redeemed! also LOVE those homophobic undertones! also LOVE when a movie is utter garabge! LOVE IT!     ",
      "lady-bird": "10/10 this is the best movie ever made     ",
      "the-descent": "9/10 when people tell me a movie is scary, I 100% of the time assume they're idiots who have seen 3 movies in their entire life  i should've listened to those idiots when it came to this one. my skin has crawled off of my body and descended into another realm.     ",
      "forgetting-sarah-marshall": "7/10 i did not need that many penis shots but okay jason segal whatever you say     ",
      "john-mulaney-new-in-town": "10/10 IM GONNA PUSH HIM     ",
      "free-fire": "10/10 UGH, MEN     ",
      "moonstruck": "9/10 Loretta, I love you. Not like they told you love is, and I didn't know this either, but love don't make things nice - it ruins everything. It breaks your heart. It makes things a mess. We aren't here to make things perfect. The snowflakes are perfect. The stars are perfect. Not us. Not us! We are here to ruin ourselves and to break our hearts and love the wrong people and die. The storybooks are bullshit. Now I want you to come upstairs with me and get in my bed!     ",
      "mollys-game": "8/10 Sorry! I legally cannot hate any movie where Jessica Chastain and her incredible boobs are in my face, even if this is a messy piece of garbage! I'm signing off! 😘     ",
      "maggies-plan": "7/10 greta gerwig please date women challenge     ",
      "paterson": "10/10 I am so upset but so happy at the same time? What is this feeling? Adam Driver, please save me!!!     ",
      "i-dont-feel-at-home-in-this-world-anymore": "7/10 sad people are valid     ",
      "ex-machina-2015": "10/10 I watched this movie and cried in the shower for an hour and then it became my favorite movie ever made     ",
      "black-panther": "9/10 michael b. jordan could spit in my face, leave me on read, and completely treat me like garbage and I'd still text him back     ",
      "luther": "3/10 this movie is bad but joseph fiennes is HOT     ",
      "fifty-shades-freed": "7/10 can't tell if the hottest thing jamie dornan does is cry or lick ice cream off of dakota johnson's leg     ",
      "professor-marston-and-the-wonder-women": "9/10 \"I want you to love me for all of my days.\"     ",
      "la-la-land": "10/10 best film i've ever seen. i'm at a loss for words right now. longer review later.     ",
      "rust-and-bone": "7/10 the power they brought eachother, but THE TEARS THEY BROUGHT ME... AT WHAT COST MARION     ",
      "boogie-nights": "10/10 I FUCKING LOVE DIRK DIGGLER. WHAT A STAR!!!     ",
      "fifty-shades-darker": "8/10 this movie is good you all can suck my dick     ",
      "marie-antoinette-2006": "9/10 kirsten dunst could murder everyone in my family and I still wouldn't behead her     ",
      "get-out-2017": "9/10 \"Now you're in the sunken place.\"  MY ASS IS SHAKING     ",
      "gods-own-country-2017": "10/10    HE HAD TO GO GET HIM     ",
      "arrival-2016": "10/10    Okay, so now that i've sat down and thought about this, i'm ready to talk.  This movie is 100% a masterpiece. The visuals are perfect, the acting, ESPECIALLY from Amy Adams, is wonderful. The fucking score, Jesus Christ. Everything about this movie is absolutely amazing. The aliens looked terrifying and gorgeous at the same time. I didn't breathe for a good 60 seconds when you first meet them. Still, a movie can fail with an amazing score, breathtaking cinematography, and...     ",
      "wonderstruck": "10/10 easily the most beautiful movie I have ever seen, todd haynes resparked my love for the world, film, and all things new york. i'm at a loss for words.     ",
      "big-little-lies": "10/10    ‪the finale of this show is one of the most empowering pieces of art i've ever seen, the moments between these women are so powerful and real. the way they look at each other and defend each other, i have never seen something so merciless and beautiful.‬ the rage, power, grace. big little lies has done something that no show has done before.     ",
      "a-serious-man": "10/10 I don't think I've ever been so upset yet so relieved a movie finally ended.     ",
      "paddington-2": "10/10 HAPPY BIRTHDAY    AAAAAAAAAAAAAAAHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHH     ",
      "gone-girl": "10/10 Noah fence but anyone who marries me should and can expect this     ",
      "blade-runner-2049": "10/10 I don't even want to try to talk about this     ",
      "miss-sloane": "8/10 jessica chastain could blink in my direction and I would have a heart attack     ",
      "paddington": "10/10 perfection     ",
      "ask-me-anything": "4/10 christian slater is hot, i'm horny, and depressed, what the fuck is new     ",
      "bright": "1/10 I forgot I watched this 4 days ago but I did and it was the worst mistake of my life.     ",
      "the-hours": "9/10 OUCHHHHHHH     ",
      "jumanji-welcome-to-the-jungle": "4/10 karen gillan is hot what's new     ",
      "the-girl-most-likely-to": "6/10 love when men get what they deserve     ",
      "the-book-of-henry": "5/10 this movie needs a therapist     ",
      "geostorm": "3/10 uh     ",
      "neighbors-2-sorority-rising": "2/10 chloe grace mortez saying fake feminist bullshit trying to sound woke as fuck is easily the cringiest thing i've ever seen     ",
      "all-the-money-in-the-world": "7/10 I will be campaigning for Michelle Williams to win all the awards because she is a force of nature and is probably the only reason this movie is interesting.     ",
      "world-of-tomorrow-episode-two-the-burden-of-other-peoples-thoughts": "10/10 \"Do you remember what happens next?\"\"Of course I do.\"  FUCK     ",
      "suspiria": "10/10 FUCK ME WITH PRETTY COLORS     ",
      "black-mirror-san-junipero": "9/10 UGHHHHHH MY HEART     ",
      "baby-driver": "10/10 holy fucking shit     ",
      "i-tonya": "8/10    I cry everytime I see the video of her landing the triple axel.  That's truly who Tonya was. She wasn't the evil villain to America's twisted story of fame, nor was she a redneck, a hillbilly, or a white trash girl with no education. She was that triple axel. She was the buildup to it, and the falling out after it. She was the doubt, the inspiration, and the feeling everyone across the world had when she landed it. After...     ",
      "die-hard": "10/10 this movie is a christmas miracle     ",
      "home-alone": "9/10 NO CLOTHES ON ANYBODY? SICKENING     ",
      "billy-star": "9/10 in preparation for call me by your name tonight.     ",
      "jack-frost": "8/10 fuck you, i liked it     ",
      "star-wars-the-last-jedi": "8/10 luke skywalker really is the gayest bitch in the galaxy isn't he     ",
      "star-wars-the-force-awakens": "9/10 kylo ren can pop this hot topic p*ssy any day of the week     ",
      "the-disaster-artist": "10/10 I haven't been this proud and in awe of a movie since Lady Bird. Please give James Franco his GODDAMN OSCAR.     ",
      "the-room": "1/10 IT MADE ME PASS OUT FOR 3 HOURS SO THERES THAT     ",
      "christian-mingle": "1/10 Hahahahha God isn't real     ",
      "the-devil-wears-prada": "8/10 STAnley tUCCI IS THE LOVE OF MY LIFE     ",
      "kids": "2/10 I hate you     ",
      "jim-andy-the-great-beyond": "8/10 give me a full length documentary on jim carrey embodying jesus christ PLEASE     ",
      "split-2016": "9/10 FUCKING ANYA TAYLOR-JOY RUNNING AROUND IN THAT OUTFIT MADE ME GAY     ",
      "atonement": "10/10 Love fucking sucks guys what's new     ",
      "transformers-the-last-knight": "2/10 take a shot everytime the aspect ratio changes and I promise you will die     ",
      "kill-bill-vol-2": "10/10    tag yourself I'm Bill because Uma Thurman also makes my heart fucking explode     ",
      "three-billboards-outside-ebbing-missouri": "7/10 more movies with frances mcdormand threatening to kill all rapists please     ",
      "ingrid-goes-west": "9/10 \"I'm just... I'm just tired of being me.\"     ",
      "wind-river-2017": "8/10 women are a fucking force. elizabeth olsen is an angel. jon bernthal is an angel. SHE RAN SIX MILES IN THE SNOW. I FUCKING. BYE.     ",
      "chicago": "9/10 THIGHS     ",
      "thor-ragnarok": "9/10 TAIKA WAITITI. also this movie is funny as fuck, but the funniest scene is when tom hiddleston is wearing an all black suit and he looks EXACTLY like tommy wiseau from the room. I promise you won't be able to unsee this, it's truly the greatest thing I've ever seen.     ",
      "the-killing-of-a-sacred-deer": "9/10 No     ",
      "night-on-earth": "9/10 Winona Ryder, Date Me Please     ",
      "friday-the-13th-part-viii-jason-takes-manhattan": "10/10 HE     ",
      "jigsaw-2017": "7/10 HOW IS THIS THE WORST YET Best mOVIE IVE EVER SEEN?     ",
      "planet-terror": "7/10 GUN LEG     ",
      "zodiac": "10/10 spotlight but with murder     ",
      "the-florida-project": "9/10 literal magic, blends american honey and sean bakers previous project tangerine in the most enchanting and immersive way possible. i can't say anything else that hasn't already been said, but i truly feel like a kid again.     ",
      "hotel-for-dogs": "7/10 isn't a 5/5 because of lack of logic, but truly is a beautiful cinematic experience that would be wonderful to see in theaters.     ",
      "it-2017": "8/10 Don't touch my kids peniswise or I'll stick a rod up your ass     ",
      "black-mirror-white-christmas": "9/10 WELP THATS SOME FUCKED UP SHIT     ",
      "collateral": "10/10 my first mann, and fuck was it good. which one should I watch next??     ",
      "blade-runner": "10/10 i'm actually crying this is the most beautiful movie i've ever seen     ",
      "bone-tomahawk": "10/10 bone tomahawk isn't forgiving. its brutal, dirty, cold, but at the same time it begs you to hope for these characters, even when everything seems lost. it gives you a sliver of light in the most godless moments and then breaks your heart, and then gives you light again. it's everything it planned to be and never isn't perfect.     ",
      "krampus": "9/10 GOD TIER MOVIE     ",
      "hostel-part-iii": "2/10 take a shot everytime there's an ass on screen and I promise you'll die from alcohol poisoning     ",
      "before-sunrise": "10/10 this film is perfect. there is nothing wrong with this movie. I cried and laughed and cried again and honestly I wish I didn't watch the last two this one was too magical for me     ",
      "gaga-five-foot-two": "7/10 she     ",
      "kingsman-the-secret-service": "9/10 HAIL SATAN     ",
      "kingsman-the-golden-circle": "8/10 all 4 stars go to channing tatums bulge and channing tatums bulge only     ",
      "heathers": "10/10 i hope winona ryder knows i would die for her     ",
      "dark-dungeons": "1/10 I AM CHAOTIC NEUTRAL     ",
      "moonrise-kingdom": "10/10    The shot of Sam and Suzy, walking out of the church, in slow motion, with that fucking music, while Suzy kisses his hand, changed cinema for the better.     ",
      "cyberbully": "1/10 why is this literally the funniest movie EVER MADE     ",
      "magic-mike": "8/10 UM? GAY?     ",
      "good-time": "10/10 Imagine your worst panic attack.  Times it by 100.     ",
      "dunkirk-2017": "10/10 I've deleted 3 different reviews for this because I genuinely don't know what to say.  It's been over an hour since I've seen Dunkirk and my head is still pounding, my heart is still beating to Hans Zimmer's score. I know that a lot of people can't, but truly, if you can, see it in IMAX.   I was seriously an emotional wreck for the last 30 minutes of this, I kept having to hold my mouth shut because I was worried...     ",
      "death-note-2017": "1/10 \"this whole movie should not be existed\" - my friend while watching this     ",
      "do-the-right-thing": "9/10 oh wow my will to live is GONE     ",
      "stolz-der-nation": "8/10 this is better than apocalypse now     ",
      "the-loved-ones": "7/10 me     ",
      "the-royal-tenenbaums": "10/10 \"I've had a rough year, dad.\" WES ANDERSON WANTS ME DEAD     ",
      "the-night-before-2015": "7/10 michael shannon is probably the greatest human to ever grace the earth     ",
      "hellraiser": "8/10 goddamn disgusting     ",
      "shark-lake": " please. everyone. i'm fucking begging you. please watch this. this is the funniest fucking movie i have ever seen in my entire life. my friend and i rewinded every other scene. the movie made $0 at box office. dolph is in a movie about sharks. its literally called shark lake. I honestly cannot rate this movie because I have no idea what the fuck to give it. but I want everyone to watch this. please. skip baby driver, skip casablanca, skip moonlight. but please, fucking watch SHARK LAKE.     ",
      "gifted-2017": "9/10    you know what I haven't finished this yet but I got to the scene where chris evan adopted ALL THE CATS and this rating went up SO FAST and btw I would die for chris evan and his soft hands and the fact that he wore a shirt inside out and also? jenny slate is god     ",
      "death-proof": "10/10 okay but consider this... this is the best film ever made     ",
      "glitter": "1/10 I actually don't think there was any glitter in this     ",
      "exit-through-the-gift-shop": "8/10 if you don't consider street art to be real art block me     ",
      "brokeback-mountain": "10/10 gustavo santaolalla saved me with this and the last of us score. my favorite composer.     ",
      "the-dark-knight": "10/10 I once showed my friend a picture of the actual joker from this masterpiece after we saw suicide squad together and she said jared leto did it better. we are not friends anymore!!!     ",
      "the-emoji-movie": "1/10 please end my life     ",
      "atomic-blonde": "9/10 AM I YOUR BITCH NOW     ",
      "the-good-the-bad-and-the-ugly": "10/10 this movie is cinematic sex     ",
      "nick-and-norahs-infinite-playlist": "6/10 MICHAEL CERA? MAKING A WOMAN CUM? FUNNIEST MOVIE I'VE EVER SEEN. HILARIOUS COMEDY. I'VE BEEN LAUGHING FOR 15 MINUTES STRAIGHT. MICHAEL FUCKING CERA. WORKING THE CLIT MAGIC. I'M CRYING. MICHAEL CERA I LOVE YOU THANK YOU FOR THIS.     ",
      "a-ghost-story-2017": "10/10 I started crying about 7 seconds in and didn't stop for the entire fucking thing.     ",
      "stuart-a-life-backwards": "8/10 Imagine not considering Tom Hardy to be one of, if not the best, actors working today. Every goddamn role he's in, every character he plays, he gives everything he has. I can't get enough of him. The film industry doesn't deserve him. Fuck it, we as a species don't deserve him. I feel sorry for other actors working today since none of them will ever compare. But oh well, fuck them, I love Tom Hardy.     ",
      "star-trek-nemesis": "4/10 can I perhaps fuck tom hardy     ",
      "this-means-war": "3/10    so uh towards the end of this I decided I couldn't stand to see Tom Hardy get rejected so I looked up who Lauren picked and guess what!! Hahahha she went with Chris Pine so I'm not finishing this fuck you Reese Witherspoon I hate you     ",
      "warrior": "9/10 Rocky fucking wishes     ",
      "soylent-green": "7/10 uhhhhh can I unwatch this please     ",
      "superbad": "9/10 I WAS GONNA GO DOWN ON HER, FOR LIKE, SEVERAL HOURS     ",
      "war-for-the-planet-of-the-apes": "9/10 caesar is honestly probably one of the greatest characters of all time     ",
      "drop-dead-gorgeous": "8/10 you know what? i can forgive the academy for giving suicide squad an oscar. i can forgive them for not giving mad max: fury road best picture. but not giving amy adams an academy award for drop dead gorgeous? UN-FUCKING-FORGIVABLE. PAY UP ASSHOLES.     ",
      "the-disappointments-room": "1/10 anyways kate beckinsale has perfect hair     ",
      "jupiter-ascending": "7/10 the funniest movie since spider-man 3, but instead of sand, a woman becomes one with bees. and its fucking hysterical.     ",
      "red-2017": "9/10 holy hell. god = cate blanchett?     ",
      "spider-man-2": "10/10 OKAY I REALIZE THIS IS A FUCKING MOVIE ABOUT A MAN DRESSED AS A SPIDER BUT IT'S REALLY ABOUT CONFRONTING WHO YOU TRULY ARE AND FACING YOUR DEMONS AND I'M ON THE FLOOR WEEPING THIS IS LITERALLY SO DEVASTATING I HOPE YOU ALL DROWN ON YOUR TREE OF LIFE TEARS BECAUSE THIS IS REAL DEPRESSION     ",
      "sergeant-slaughter-my-big-brother": "7/10 tom hardy penis     ",
      "evil-dead-ii": "10/10 fuck anyone who thinks \"groovy\" isn't the best line in all of cinema     ",
      "psycho": "9/10 anyways norman bates is hot     ",
      "pacific-rim": "8/10 me when guillermo del toro breathes: you're doing amazing sweetie     ",
      "breathe-2014": "9/10 oh my god oh my god fuck fuck fuck oh my fucking god fuck fuck fuck     ",
      "the-beguiled-2017": "10/10 sofia coppola has outdone herself. truly the most beautiful film of the year so far, fucking terrifying and tense with insanely brilliant performances. so perfectly paced and composed, I can't stop shaking.     ",
      "okja": "9/10 this movie is absolutely incredible but fuck it for making me think paul dano is hot     ",
      "buffalo-66": "8/10    I don't honestly know if I like this movie but I love christina ricci. I hate vincent gallo but christina ricci. I hate that billy had a character arc in the last 45 seconds but like I said, christina ricci. in conclusion, I love christina ricci. she's an angel and deserves the entire world. vincent gallo can choke on his own dick.     ",
      "invisible-dad": "3/10 zara is gonna remake this and it's gonna change the world     ",
      "barbie-in-the-nutcracker": "8/10 BARBIE FINNA NUT ON THAT CRACKER     ",
      "wonder-woman-2017": "9/10 when y'all told me I would cry during the action scenes I didn't believe you but now i'm sobbing in a crowded theater!!! FUCK     ",
      "feast-2014": "10/10 FEAST ON THESE TEARS BITCH     ",
      "3-2003-1": "8/10 this film came out 2 years after mulholland drive but if we're all being serious david lynch snaked owen hurley     ",
      "xanadu": "3/10    hey, at least it has a better plot than song to song     ",
      "point-break": "9/10 \"I know you want me so bad it's like acid in your mouth.\" dude could you be any gayer lmao     ",
      "the-bad-batch": "8/10 keanu reeves explaining how shitting works is honestly the peak of cinema     ",
      "clueless": "10/10 PAUL RUDD IS MY DADDY     ",
      "room-2015": "9/10 CAN MY STRONG BE HER STRONG TOO 😩😩     ",
      "song-to-song": "2/10 me :malick fanboys : You just don't understand. You have to become one with Malick, and become one with the trees and air. Terrence Malick films are a journey, you just don't understand the journey he's taking you on. You're too immature to understand what his films MEAN, what they TRULY MEAN. you don't understand love, or what Malick is trying to tell you about love. get out of here with your bullshit opinions and shitty film taste, unless...     ",
      "death-bed-the-bed-that-eats": "1/10 yeah no thanks     ",
      "moonlight-2016": "10/10 \"I'm sorry\"  i can't stop crying.     ",
      "mad-max-fury-road": "10/10 I have no words     ",
      "scott-pilgrim-vs-the-world": "10/10 5 stars for mary elizabeth winstead with pink, green AND blue hair.     ",
      "hot-fuzz": "9/10 \"This is JUST like Casablanca!\"     ",
      "hardcore-henry": "6/10 anyways hayley bennett is my girlfriend     ",
      "the-dirties": "4/10 matt johnson... you're not cool     ",
      "little-miss-sunshine": "10/10 I can't believe this movie simultaneously caused and cured my depression!     ",
      "colossal-2016": "9/10 my whole life has been surrounded by the fragility of masculinity and the men that it curses. my father, many of my old friends, and lots of other people that I care about. I've never seen a film so perfectly portray how fragile men can be and how much they care about being the strongest one in the room. being a woman in a world of men who are like Jason Sudeikis' character is so scary sometimes, and I cannot...     ",
      "captain-underpants-the-first-epic-movie": "8/10 THIS MOVIE DESERVES SO MUCH MONEY     ",
      "the-mummy-2017": "1/10 I attempted suicide at least 50 times     ",
      "hasan-minhaj-homecoming-king": "9/10 I WAS GETTING HANDJOBS WHEN I WAS 9     ",
      "it-comes-at-night": "9/10 holy hell, that was fucking brutal.     ",
      "pulp-fiction": "10/10 Fabienne is forever and always the most character to ever grace the silver screen.     ",
      "twin-peaks-fire-walk-with-me": "10/10 My heart? SHATTERED. BROKEN. FUCKING DESTROYED.     ",
      "a-nightmare-on-elm-street-the-dream-child": "1/10 FUCK THIS SHIT     ",
      "how-the-dook-stole-christmas": "7/10 more like how the dook saved the gays     ",
      "the-muppets": "8/10 I love that big green Kermit dick ;)     ",
      "reservoir-dogs": "8/10 my favorite film genre is tim roth crying when he's hurt. give me more of this iconic cinema please     ",
      "adore": "2/10 THEY'RE LESBIANS, HARGE     ",
      "hello-my-name-is-doris": "9/10 THAT ENDING... ME TEARS     ",
      "raw-2016": "10/10    \"I'M SURE YOU'LL FIND A SOLUTION HONEY.\"I JUST STARTED LAUGHING SO HARD AND I TEARED UP AND I SCREAMED HOLY SHIT I LOVE THIS SO FUCKING MUCH JESUS CHRIST     ",
      "girlhouse": "7/10 MAN KILLS WOMEN CAUSE SOMEONE MADE FUN OF HIS ACORN PENIS     ",
      "wiener-dog-internationals": "1/10 WHY GOD     ",
      "the-straight-story": "9/10 I can't believe Lynch made a film that actually filled my heart with love and comfort instead of dread and confusion.     ",
      "teeth": "7/10 she has a killer pussy     ",
      "the-road-to-el-dorado": "6/10 they're gay     ",
      "killer-klowns-from-outer-space": "8/10 this movie had the budget of 2 million dollars     ",
      "the-worlds-end": "9/10 does edgar wright know that he created the gayest trilogy of all time     ",
      "the-autopsy-of-jane-doe": "7/10    black phillip did it better     ",
      "the-fifth-element": "8/10 LOVE!!! IS!!! WORTH!!! SAVING!!!     ",
      "ratchet-clank": "1/10 wow Star Wars has some fucking competition 😍😍💦💦😫😫     ",
      "all-that-jazz": "9/10 why the hell isn't this movie called  All That Sad ?     ",
      "the-lego-movie": "9/10 \"Emmet, you didn't let me finish earlier, because I died.\"  how do you think James Cameron would react if I told him I cried during The Lego Movie but not Titanic     ",
      "mommy-2014": "10/10 I GOT... CHILLS.     ",
      "we-are-still-here": "7/10 WHY DON'T Y'ALL JUST... LEAVE THE HOUSE????     ",
      "lady-blue-shanghai": "8/10 me - \"hey what's happening in this?\"brendan - \"who cares. do you care? \"me - \"no\"brendan - \"exactly.\"     ",
      "trust-2010": "6/10 GROSS     ",
      "steve-jobs": "10/10 what a fucking cast. what a fucking screenplay. what fucking incredible acting. what a fucking masterpiece.     ",
      "seven-psychopaths": "9/10 \"Gandhi was wrong.\"  SEVEN FUCKING PSYCHOPATHS     ",
      "interstellar": "10/10    \"It was you. You were my ghost.\"  HOLY SHIT I AM REALLY NOT OKAY WITH BEING ALIVE RIGHT NOW     ",
      "world-of-tomorrow": "10/10 \"Sometimes, I sit in a chair late at night and quietly feel very bad\" bitch me too the fuck?     ",
      "alien-resurrection": "2/10 I have literally been watching this for only 20 seconds and this is the rating I'm 200% positive it deserves.     ",
      "wild-at-heart": "10/10 \"But, I'm wild at heart!\"\"If you're truly wild at heart, you'll fight for your dreams.\"  David Lynch, you brilliant, brilliant fucker. I love you so.     ",
      "twixt": "3/10 Why     ",
      "the-hateful-eight": "10/10    \"When you get to hell, John, tell them Daisy sent you.\"AHHHHHHHHHHHHHHHHHHHHHHHHHH     ",
      "logan-2017": "9/10 putting laura in a shirt with a rainbow on it isn't very subtle you guys... I love my gay knife daughter.     ",
      "circle-2015": "6/10    the best part of this movie is when everyone voted that the homophobe should die     ",
      "moulin-rouge-2001": "10/10 BUT I LOVE YOU (I LOVE YOU) UNTIL THE END (UNTIL THE END) OF TTTTIIIIIIIMMMMEEEE     ",
      "louis-ck-2017": "9/10 I'M TOP SHELF GAY     ",
      "the-prestige": "10/10 I ACTUALLY SHRIEKED     ",
      "christine-2016": "10/10 \"You might just make it after all.\"I would love to talk about this film and what it did to me, but right now I'm about to lose it so I don't think I can. I hope more people do watch this though, because it's absolutely perfect.     ",
      "the-graduate": "10/10 are you kidding me? this movie is perfect. it is definitely somewhere on my top 10.     ",
      "chelsea-peretti-one-of-the-greats": "10/10 HOW DO I DE-DICK THIS DELICIOUS TREAT?     ",
      "louis-ck-hilarious": "9/10 PING     ",
      "louis-ck-live-at-the-beacon-theater": "9/10 YOU'RE RAISING HITLER, MOTHERFUCKER     ",
      "zootopia": "10/10 name an animated fox that you aren't attracted to     ",
      "daisies": "9/10 CHAOTIC EVIL     ",
      "im-not-ashamed": "1/10 actually I think I would rather get hit by a truck 10 times everyday then ever have to watch anything made by *these kind of christians ever again     ",
      "audition": "8/10 RIGHT FOOT PLEASE     ",
      "the-iron-giant": "10/10 me? crying over a hunk of metal saying \"superman\"? no way     ",
      "before-midnight": "8/10 this movie was amazing but it made me really angry. I love this series but i wish they would have stopped at before sunset or even before sunrise     ",
      "power-rangers": "4/10 Bad     ",
      "prevenge": "7/10 only complaint? not enough men died     ",
      "blow-out": "9/10 SAD     ",
      "life-2017": "6/10 omg 😍😍 did you know 🤣🤣 that I,🔥🔥 Ryan Reynolds 😊😊 am funny 😜😜?? Here's a couple jokes 💦💦 just in case 🤥🤥 you forgot 😘😘...     ",
      "possibly-in-michigan": "10/10 THIS IS WHAT I CALL CINEMA     ",
      "persona": "10/10 this movie is so soft and rough and perfect but I have no idea what the actual fuck happened     ",
      "in-the-realm-of-the-senses": "8/10 that sure was... sex     ",
      "20th-century-women": "10/10 Oh my god I literally am Abbie. Mike Mills, you beautiful bastard. I didn't think he could do better than Beginners but he did it! I'm Fucked Up.     ",
      "slumdog-millionaire": " I haven't finished this yet cause I'm too tired but it doesn't matter cause my review was and is gonna be I want to **** *** **** *** ** Dev Patel     ",
      "kong-skull-island": "8/10 I relate to king kong because I too would protect brie larson at all costs     ",
      "the-fly-1986": "10/10 I want to fuck jeff goldblum so fucking hard     ",
      "crank": "10/10 An actual perfect film.     ",
      "bambi-meets-godzilla": "9/10 W H Y     ",
      "t2-trainspotting": "9/10 NO MORE CATHOLICS     ",
      "three-colours-blue": "10/10 Grief in cinema is so important to me. I've been through grief at its worse, and I still can't really put into words what it feels like. But in Blue, the feeling is perfectly portrayed, through anger, pain, longing, forgiveness, and desperation.   Because grief is not black and white, grief is blue. Grief is everything you've ever felt at once, tangled up in your stomach in knots. Grief is when Julie runs her knuckles across a wall to taste the blood coming from her own hands. I love grief in cinema because of films like this. Blue is perfect.     ",
      "2-fast-2-furious": "9/10 the gayest film of all time     ",
      "minions": "1/10 I'm going to be 100% honest, I watched the version of this without minions. I'm fucking logging it because I would rather die than watch the real version. Fuck you Illumination Entertainment     ",
      "lost-in-translation": "10/10 I'M SPECIAL (SPECIAL)     ",
      "across-the-universe": "9/10 THE I WANT TO HOLD YOUR HAND SCENE MADE ME GAY     ",
      "the-boss-baby": "2/10 Absolutely not     ",
      "the-bye-bye-man": "1/10 THE CHRIS DAY MAN     ",
      "the-super-inframan": "9/10 Yes     ",
      "mulan": "9/10 YOU FIGHT GOOD     ",
      "panic-room": "9/10 gays are stronger together :) also I hope jared leto chokes on his cornrows     ",
      "personal-shopper": "10/10 It's perfect.  Fucking perfect.     ",
      "legend-2015": "8/10 \"I prefer boys.\"2 STARS FOR EACH TOM HARDY     ",
      "whiplash-2014": "9/10 gave me heart palpitations and made me sweat so bad wtf     ",
      "rock-dog": "2/10 song to song (2017) dir. terrence malick sure was wild     ",
      "only-lovers-left-alive": "10/10 I'm trying to pinpoint my favorite part of this film.There's too much to choose from.I'm just going to say everything.     ",
      "neal-brennan-3-mics": "9/10 WE GOTTA FUCK OUR WAY OUT OF RACISM     ",
      "john-mulaney-the-comeback-kid": "10/10 EXCUSE ME? YOUR KID BIT MY DICK     ",
      "dave-chappelle-deep-in-the-heart-of-texas": "9/10 WHAT COULD BE MANLIER THAN FUCKING ANOTHER GUY IN THE ASS?     ",
      "bo-burnham-make-happy": "10/10 I love this man he is the loml     ",
      "the-bling-ring": "7/10 BAD BUT I LOVE IT     ",
      "what-if-2013": "8/10 mackenzie davis smoking 4 cigarettes at the same time is the hottest thing I've ever seen in my entire life     ",
      "what-we-do-in-the-shadows": "10/10 I THINK OF IT LIKE THIS. IF YOU ARE GOING TO EAT A SANDWICH, YOU WOULD JUST ENJOY IT MORE IF YOU KNEW NO ONE HAD FUCKED IT.     ",
      "wendy-and-lucy": "9/10 michelle williams performance in this just stabbed me and then twisted the knife     ",
      "bo-burnham-what": "10/10 I love bo burnham     ",
      "jen-kirkman-just-keep-livin": "9/10 JESUS LOVED WHORES     ",
      "demetri-martin-live-at-the-time": "10/10 YEP YEP YEP YEP YEP YEP     ",
      "amy-schumer-the-leather-special": "4/10 so I laughed a lot. like, almost at every joke, but it felt wrong? like, her jokes are just not actual jokes. I find the word pussy amusing but that literally is the entire show. I do think she's funny, but her jokes gets old.     ",
      "alien-3": "6/10 it's better than fight club so jot that down     ",
      "inland-empire": "8/10 ??????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????¿???????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????¿????????????????????????????????????????¿????????????????????????????????????????¿??????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????¿???????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????¿???????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????¿????????????????????????????????????????¿????????????????????????????????????????¿??????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????¿???????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????¿???????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????¿????????????????????????????????????????¿????????????????????????????????????????¿??????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????¿?????????????????????????????????????????????????????????????     ",
      "mad-max": "5/10 BAD     ",
      "life-after-beth-2014": "8/10 okay honestly I would date dead aubrey plaza over alive anna kendrick??     ",
      "army-of-darkness": "10/10 giving this movie less than 5 stars would be a crime against humanity     ",
      "me-and-you-and-everyone-we-know": "8/10 I am, have been, and always will be, a slut for pretentious indie films.     ",
      "tickled": "9/10 UM WHAT THE FUCK     ",
      "ruby-sparks": "9/10 redacted     ",
      "perfect-blue": "8/10    darren aronofsky really did snatch mima's wig didn't he     ",
      "sleepover": "4/10 I swear to god I actually cried laughing and spit out my coke when that girl jumped over a dog on her skateboard the fucking things I'll do for Academy Award winner Brie Larson     ",
      "don-jon": "4/10    when brie larson finally spoke and saved the greasy sausage man... cinema was reborn     ",
      "kung-fury": "8/10 PUNCHING NAZIS IS VALID     ",
      "a-history-of-violence": "9/10 I think if Viggo Mortensen was in every movie ever made, the world would be a better place.     ",
      "irma-vep": "8/10 olivier assayas sure does love his lesbians.. and not making sense...     ",
      "kumiko-the-treasure-hunter": "10/10 I LOVE !!!     ",
      "the-happening": "2/10 making zooey deschanel look ugly was this movies greatest crime     ",
      "whip-it": "8/10 OKAY BUT DON'T YOU KNOW THAT ALL THESE GIRLS HAD SO MUCH FUN MAKING THIS MOVIE     ",
      "the-lego-batman-movie": "10/10 I STRAIGHT UP SCREAMED EVERYTIME THEY SAID \"MASTER DICK\" WTF I LOVE THIS MOVIE SO MUCH     ",
      "kedi-2016": "10/10 watching cats run around for a good hour is the best way I can imagine spending my time tbh     ",
      "blue-jay-2016": "10/10 FUCK YOU THIS WRECKED MY ASS     ",
      "the-cat-in-the-hat-2003": "6/10 I'm sitting in my room. My mom walks in and stares at me, stares at my computer screen, and then walks out of the room. She screams, \"You made me watch that fucking movie at least 1,000 times when you were a kid.\"  I apologize. Emmanuel Lubezki's name comes on screen. I start to cry. I'm tired.     ",
      "the-fits": "8/10 girls are so beautiful and wonderful and I love all of them     ",
      "risky-business": "8/10 \"Looks like the University of Illinois!\"  I love icons.     ",
      "nights-and-weekends": "5/10 if a movie makes me think greta gerwig is annoying, it's doing something wrong     ",
      "eastern-promises": "10/10 I LOVE THAT GOOD VIGGO DICK     ",
      "men-women-children": "6/10 \"I want that big penis of yours.Um...That's right. I want it.I want your dick.Oh, attagirl.I want you to destroy mewith your big fucking cock.Oh, fuck, yeah.\"  \"You're really beautiful,you know that?\"  these quotes come from the same movie. I quit.     ",
      "the-lord-of-the-rings-the-return-of-the-king": "10/10 \"I am no man.\"I LOVE THIS SONG!!!     ",
      "the-lord-of-the-rings-the-two-towers": "8/10 MAKE GAY FRODO CANON     ",
      "the-one-i-love-2014": "8/10 I LOVE THE ENDING OF THIS MOVIE SO MUCH PLEASE WATCH THIS MOVIE IF ONLY FOR THE ENDING HOLY FUCKING SHIT     ",
      "the-salesman-2016": "9/10 I loved this so much. I really had no problems with it up until the end, it felt a little drawn out.   *SPOILER*  I wish that the film would've focused on Rana. The whole climax of the story was about her but I feel like there wasn't enough time given to her character.     ",
      "blair-witch": "5/10 if the scariest thing about your movie is a fucking foot then we have a problem     ",
      "shin-godzilla": "8/10 I watched this for the poster but instead got one of the most batshit experiences I've ever had watching a film.     ",
      "the-voices": "7/10 always listen to your cat     ",
      "cameraperson": "9/10 I literally never wanted this to end. I can't express how interesting and personal this memoir documentary was. I loved this so so so much.     ",
      "antichrist": "7/10 BUT WHY     ",
      "aliens": "10/10 \"GET AWAY FROM HER YOU BITCH!\" (!!!!!!!!!!!!!!!!!!!)     ",
      "green-room": "9/10 the effects!!! oh my lord!!! when they cut open that guys stomach!!!! ahhhhh!!!!!     ",
      "tusk-2014": "6/10 The fact that Kevin Smith truly doesn't give two fucks anymore is beautiful to me.     ",
      "de-palma": "8/10 \"My true wife is my movie, not you.\"  I wish I had watched more of De Palma's films before watching this, cause now I'm fucking hooked. What a wonderful asshole. I can't wait to watch his work.     ",
      "locke": "9/10    Irritated Ivan : Divorce Road     ",
      "krisha-2015": "9/10 I want to fucking die     ",
      "a-most-violent-year": "8/10 tell me bisexuality isn't valid and I'll send you a link to A Most Violent Year (2014). you try and decide whether to fuck Oscar Issac or Jessica Chastain, then choke on my dick.     ",
      "showgirls": "8/10 ERY'BODY GOT AIDS AND SHIT     ",
      "into-the-forest": "8/10 fuck you there is no way that evan rachel wood kept that short hair for 15 fucking months fuck off     ",
      "laggies": "7/10 sam rockwell makes me feel really weird things about hot lawyer dads     ",
      "bottle-rocket-1996": "8/10 I seriously don't think Wes Anderson has or ever will make a bad movie. Even though this is one of his weaker films, it's still really great.  (also, I finally finished his filmography!!)     ",
      "for-a-good-time-call": "8/10 OH MY GOD LET THEM BE GAY     ",
      "wetlands-2013-1": "8/10 I have so much respect and love for women who are so curious and explorative with their sexualities. Make more movies like this please!!!     ",
      "hostel-part-ii": "7/10    Fuck it, I'm adding an extra half star because someone gets their dick cut off for calling a woman a cunt. This movie is incredible.     ",
      "the-love-witch": "7/10 samantha robinson and amy adams better come for whoever wins the oscar for best actress this year     ",
      "greenberg": "7/10 why am I every single character greta gerwig has ever played     ",
      "side-by-side-2012": "8/10 \"If things are important to human beings, we figure out ways to preserve them, always been true. Yes, we lose stuff, but that's part of life.\"This documentary kind of scared the shit out of me. Being an aspiring filmmaker and hearing all these talented people talk about how film is dead is a little scary, but I quickly gained my confidence again when Greta Gerwig appeared on screen!!!     ",
      "lion": "7/10 WHY DO I ALWAYS FORGET HOW HOT DEV PATEL IS     ",
      "blood-simple": "10/10 LITERALLY ONE OF MOST GORGEOUS AND DARKLY HILARIOUS MOVIES I'VE EVER SEEN. I'm so glad the theater I saw this in was completely packed. This was the most fun I've had seeing a movie in a theater full of people!!! I love movies so much oh my god.     ",
      "the-duke-of-burgundy": "10/10 \"How can I resent you? I love you. I love you.\"  I'm so sad.     ",
      "closet-monster": "10/10 Take a guess of who wants to Die!!!     ",
      "i-am-not-a-serial-killer": "8/10    this movie has christopher lloyd being injected with pepto-bismol     ",
      "the-handmaiden": "10/10 my first review of this movie, \"What?\", really didn't sum up what this movie means to me.everything. this movie is everything. a lot gayer and better (these are basically synonyms at this point) than i excepted. I couldn't look away.     ",
      "incendies": "10/10    at the beginning of this movie - \"DENIS IS GOD I LOVE HIM SO MUCH!!\"at the end of this movie - \"Fuck Denis, I fucking hate him.\"     ",
      "pockets": "7/10 FIGHT CLUB WHO     ",
      "swiss-army-man": "9/10    why the fuck did no one tell me this movie was gay     ",
      "all-cheerleaders-die": "10/10 this is my 6th time seeing this film and literally I keep expecting me to realize it's bad but I've come to the conclusion that it's PERFECT     ",
      "y-tu-mama-tambien": "8/10 \"I just wanted the gays to happen.\"     ",
      "anomalisa": "9/10 \"I think you're extraordinary.\"\"Why?\"\"I don't know yet.\"  I don't really actually know what to say about this movie? I can't think of anything clever, I can't think of anything moving. I guess I'm just kind of broken. Thanks Charlie Kaufman, for being the leading cause of my depression.     ",
      "the-400-blows": "10/10 I think people overlook how hard it is to be a kid. All kids at one point feel unwanted, unloved, or uncared for. It's universal, which is why this movie is so incredible. It takes something as simple as a broken household and makes it for everyone, something anyone can relate to.   The acting and score in particular are outstanding. The cinematography is gorgeous, and you can tell it has inspired many filmmakers today. Many aspects of this film also...     ",
      "damsels-in-distress": "5/10 imagine how much worse this movie would be if greta gerwig wasn't in it     ",
      "the-invitation-2015": "9/10 THE LAST SHOT OF THIS FILM IS HAUNTING ME     ",
      "enemy": "10/10 1000th MOVIE EVER!!! WITH LOGAN OF COURSE.  Seriously the scariest movie I've ever seen!!! Fucking Denis, man.     ",
      "silence": "9/10 Andrew Garfield and Adam Driver further prove they are two of the most convincing and diverse actors today. Unlike Hacksaw Ridge, in my opinion, the faith in this film was handled beautifully and very respectfully. I absolutely adored Silence.     ",
      "a-balloon-for-ben": "2/10 wait, what?     ",
      "the-house-of-the-devil": "8/10    GRETA GERWIG DID NOT DESERVE THAT     ",
      "wiener-dog": "9/10 ??????????     ",
      "gods-not-dead-2": "1/10 forgot to log this shit lmao     ",
      "10-things-i-hate-about-you": "10/10 \"The shit hath hitith the fan... ith\"     ",
      "her-story": "8/10 I fucking love women.     ",
      "mysterious-skin": "10/10 oh my god     ",
      "gods-not-dead": "1/10 \"If God were real he would give you a better iPhone.\"     ",
      "heaven-is-for-real": "1/10 what? why? I don't.. no.     ",
      "polytechnique": "10/10 \"If I have a boy, I'll teach him how to love. If I have a girl, I'll tell her the world is hers.\"Denis really knows how to make a bitch cry.     ",
      "i-killed-my-mother": "9/10 i love you xavier dolan, you beautiful brilliant boy.     ",
      "elle": "10/10    THE BEST GAY CHRISTMAS MOVIE     ",
      "nerve-2016": "8/10 logan and I are really tired but we love neon lighting and each other so this was a fun watch.     ",
      "blue-is-the-warmest-color": "10/10 it's back on Netflix!! I've waited too long!! it's been 84 years!!     ",
      "hidden-figures": "10/10 me before hidden figures : the moon landing is fake me after hidden figures : THE MOON LANDING IS REAL AND HAPPENED BECAUSE OF KATHERINE JOHNSON, DORTHY VAUGHAN, AND MARY JACKSON.     ",
      "palo-alto": "8/10 literally everyone in this movie is a piece of shit     ",
      "first-girl-i-loved": "9/10 \"It has lesbians, it's coming of age, it made me cry, and I love it.\" - Logan     ",
      "hard-candy": "8/10 I'm so proud of elliot page     ",
      "always-shine": "8/10    I LOVE WOMEN WHO MURDER.     ",
      "yoga-hosers": "3/10 this movie has stan lee in it     ",
      "norm-of-the-north": "1/10 \"Get fucked Norm.\" - Logan     ",
      "the-neon-demon": "7/10 i really wish i liked this movie. towards the end it really felt forced with aesthetic and climax. i hope elle fanning eats me though.     ",
      "megan-is-missing": "1/10 \"Shut your mouth or I'll make your forehead bigger.\"  \"I'm 1 foot taller than Megan but 1 foot shorter than her forehead.\"  \"As the killer gets closer, her forehead gets bigger.\"  \"If I took a shotgun to my forehead, half of it would still be there.\"  \"HOLY SHIT HER FOREHEAD RECEDES INTO HER ACTUAL FACE.\"  Watching this with Logan was the only good thing about this fucking movie. I love him and his beautiful hair.     ",
      "rogue-one-a-star-wars-story": "2/10 I LOVE AND WOULD DIE FOR DIEGO LUNA     ",
      "shame-2011": "9/10 fuck this movie     ",
      "drag-me-to-hell": "9/10 SAM RAIMI JUST DRAGGED MY ASS TO HELL!     ",
      "roman-holiday": "9/10    Audrey Hepburn is honestly the cutest person to ever grace the silver screen. I've only seen two of her films but she is slowly becoming one of my favorites.   The last scene in this movie kind of broke my heart. Reminded me a lot of La La Land.     ",
      "new-years-eve": " this movie fucks ass but y'all don't!! happy new years to my favorite people in the entire world. I love you all!!     ",
      "casablanca": "10/10 \"Of all the gin joints, in all the towns, in all the world, she walks into mine.\"     ",
      "drive-2011": "10/10    if ryan gosling kissed me like that I would have no problem with him brutally murdering people     ",
      "your-name": "10/10 This is one of the most original, frustrating, and fucking brilliant films I've ever seen. If this doesn't get a best animated film nomination I truly will give up on the academy. Please find and watch Your Name.     ",
      "sicario-2015": "9/10 Denis Villeneuve just became my favorite director. The things this man can do with a camera, I will never stop praising him.     ",
      "the-life-aquatic-with-steve-zissou": "9/10 \"I have an excuse, I'm part gay.\" \"Supposedly we all are.\"  Merry Christmas from your neighborhood bisexual, and a member of Team Zissou.     ",
      "jackie-2016": "10/10 I've never seen such beautiful camera work in my entire life. The best acting in a film I've seen this year, especially from the gorgeous Natalie Portman. The score was fucking brilliant. Jackie is perfect.     ",
      "the-boy-next-door-2015": "1/10 this movie is so bad that i literally forgot i watched it until my friend noticed i didn't log it and said \"hey didn't you watch the boy next door last night?\"     ",
      "batman-v-superman-dawn-of-justice": "8/10 okay jesse eisenberg can suck my dick but this movie is not bad at all     ",
      "blue-jasmine": "9/10 men are garbage directed by the garbage man     ",
      "nine-lives-2016": "1/10 I'm really not sure what to say     ",
      "singin-in-the-rain": "10/10 THANK YOU ROBERT FOR WATCHING THIS \"LA LA LAND WHO\" FILMÉ WITH ME!! this movie is just so happy and the ending left a big smile on my face!! i'm so happy i've finally seen it!!     ",
      "in-bruges": "9/10 \"I'm sorry for calling you an inanimate object. I was upset.\"  colin farrell is such a daddy. please, colin, carry me away from bruges in your strong irish arms.     ",
      "manchester-by-the-sea": "10/10 I kind of want to crawl into a ball and die     ",
      "black-swan": "9/10 beautiful art     ",
      "hacksaw-ridge": "8/10 a bit over the top with the religious themes, but a wonderful story with great acting towards the later two acts.     ",
      "american-honey": "10/10 The last 10 minutes of this film left me speechless, even now I can't breathe. I wasn't sure if Andrea Arnold could go higher than Fish Tank, but god did she do it. I cannot believe this film is real and people can experience it for themselves. Go watch it NOW     ",
      "to-die-for": "7/10 \"I think if you wanted a babysitter, you should marry Mary Poppins.\"  one day, I will scam men just as Suzanne Stone taught me.     ",
      "loving-2016": "9/10 \"Tell the judge I love my wife.\"  is michael shannon a real person? can he be my dad? can i fall in love? please?     ",
      "other-people": "6/10 I have a lot of problems with this movie, like the sometimes forced humor and weird scattered plot, but Molly Shannon gives a breathtakingly real performance.  Considering I have been in a situation with a family member who has cancer, her performance was realistic and heartbreaking.     ",
      "inherent-vice": "10/10 paul thomas anderson... just end my life. joaquin phoenix was god. i love everything about this movie.     ",
      "nightcrawler": "9/10 what she says : I'm fine.what she means : why didn't Jake gyllenhaal get an oscar nomination? when will the old crusty ass white men actually do something right for once? and look, I get that this was last year. but I keep looking back and almost crying because they gave meryl fucking streep a fucking nod for INTO THE WOODS? ARE YOU FUCKING KIDDING ME? I don't... I just... I do not understand. I want to assassinate everyone...     ",
      "birdman-or-the-unexpected-virtue-of-ignorance": "10/10 look i'm way too much of a bisexual to not talk about when naomi watts totally pulled a mulholland drive     ",
      "take-shelter": "10/10 probably the greatest ending i've seen in a long long time     ",
      "moana-2016": "9/10 I cannot stop smiling Fuck Me Up please!!     ",
      "nocturnal-animals": "5/10    JAKE MISSED OUT AT THE END WHEN AMY ADAMS SNATCHED ME BALD WITH THAT GREEN DRESS     ",
      "the-hunt-2012": "10/10 mads mikkelsen gives such a heartbreaking performance to a heartbreaking story. this movie literally broke me.     ",
      "snowpiercer": "9/10 chris evans cured me from being sick and brought me back to life. (tag yourself i am the fish)     ",
      "only-god-forgives": "9/10 considering that i hated The Neon Demon, I definitely expected to hate this.   I didn't. I want Ryan Gosling to punch me in the face.     ",
      "inside-llewyn-davis": "8/10 i would watch 2 hours of Oscar Isaac sleeping and give it a 4 star review     ",
      "50-50": "8/10 anna kendrick looks almost exactly like jgl's dog in this movie     ",
      "ratatouille": "10/10 definitely my favorite pixar film, if not favorite disney. always has a special place in my heart.     ",
      "funny-games-2007": "9/10 when tim roth just takes a bite of the baguette. me too guy     ",
      "weiner": "8/10 #freehuma2k16     ",
      "wild": "10/10 even better in its second viewing, gave me chills, made me cry, made me laugh. thank you for this movie.     ",
      "toy-story": "10/10 woody and buzz are ultra gay     ",
      "intruder-2016": "1/10 if this ain't the stupidest shit i've ever seen...     ",
      "the-tree-of-life-2011": "6/10 so, HOLY SHIT! I did it!     ",
      "fantastic-beasts-and-where-to-find-them": "4/10 Americans Are Fucking Stupid™ : The Movie     ",
      "the-edge-of-seventeen": "9/10 the fact that nadine ACTUALLY has acne... 4.5 stars     ",
      "bubble-boy": "6/10 BUBBLE BOY ENDED RACISM     ",
      "romeo-juliet-1996": "8/10 this and the great gatsby (2013) need to be appreciated so fuck off     ",
      "the-skin-i-live-in": " more fucked than america? nah     ",
      "prisoners": "10/10 so I saw this movie in theaters opening week and the reason me and my mom saw it is because we were in a huge fight and I bought us tickets to go and we ended up taking my grandma to see it the next day because my grandma was the reason we were fighting and um in conclusion this movie saved my family and my life so bless you     ",
      "the-wicker-man-2006": "2/10 if the entire 102 minute runtime of this movie consisted only of what happened in the last 30 minutes the film would improve GREATLY     ",
      "sausage-party": "8/10 holy shit there is a lot of gay in this movie     ",
      "before-the-flood-2016": "8/10 if you still fucking deny climate change after watching this, go fuck yourself.     ",
      "ghostbusters-2016": "9/10 i was going to give this a 4 star review but then i saw kate mckinnon again and gave in to THE LICK     ",
      "jesus-camp": "8/10 my mom started screaming at the tv when becky told the kids that they shouldn't read harry potter.     ",
      "toy-story-2": "10/10 this is the best toy story and i will defend it until i die     ",
      "blue-velvet": "9/10 on god, what the fuck just happened?     ",
      "the-girl-on-the-train-2016": "4/10 the best lifetime movie i've ever seen     ",
      "imagine-me-you": "9/10 GAYS KEEP MAKING ME CRY     ",
      "the-nice-guys": "8/10 \"i want that ass. does ryan gosling has a better ass than me?\" -my mother     ",
      "shaun-of-the-dead": "9/10 the fact that the brutal murdering of that old man was in sync with \"don't stop me now\" by queen is utterly breathtaking, truly masterful work.     ",
      "taxi-driver": "10/10 SAW THIS INCREDIBLE COCA-COLA COMMERICAL IN THEATERS AND HONESTLY I CANT BREATHE!!!     ",
      "the-others": "8/10    nicole kidman can take that rifle to my head anytime she likes     ",
      "the-accountant-2016": "9/10 JON BERNTHAL 💦😫 FUCK 💯💦 ME     ",
      "cinema-paradiso": "8/10 i am just a kid. i've only been into movies for about 8 months and i know i have found my calling, my passion, and my life. in 10 years, will i still be insane and watch a movie every single day? will i still go to the cinema with my best friend and my mom? will i still spend all of my money of DVDs, just dreaming of having my own collection?  i really hope so. cause this community,...     ",
      "castle-in-the-sky": "8/10 i would like to point out before i logged this it had a 3.9 so sorry @aestheists but god is real. :)     ",
      "upstream-color": "9/10 hahahaha what?     ",
      "sing-street": "9/10 I'M UGLY CRYING   \"It means that I'm stuck in this shithole full of morons and rapists and bullies, and I'm gonna deal with it, okay? It's just how life is. I'm gonna try and accept it and get on with it and make some art.\"     ",
      "amanda-knox": "7/10 everytime i watch a documentary about the criminal justice system i literally want to vomit     ",
      "the-green-inferno": "6/10 I love Eli Roth so much what an asshole     ",
      "s-de-sofia": "7/10 WHY DO THE GAYS ALWAYS HAVE TO SUFFER     ",
      "the-kings-of-summer": "9/10 i was sweating from the undeniable sexual tension between joe and patrick.     ",
      "the-human-centipede-3-final-sequence": " i've never seen this movie but if you turn the poster upside down it looks like a dinosaur.     ",
      "secretary": "9/10    i too would go on a hunger strike for james spader.     ",
      "punch-drunk-love": "9/10 angry, awkward, anxious, beautiful. punch-drunk love is all of these and makes me respect adam sandler (HA). (just a lil bit).     ",
      "500-days-of-summer": "9/10 this, eternal sunshine of the spotless mind, and before sunset are perfect representations of relationships. I love this movie after a couple watches because you start to understand who really had the control in the relationship.     ",
      "sideways": "8/10 who hurt alexander payne     ",
      "short-term-12-2013": "10/10 SINCE LETTERBOXD DOESNT DO TV SHOWS, CONGRATS RAMI MALEK FOR WINNING YOUR EMMY!!! I LOVE YOU BABY BOY!!!     ",
      "million-dollar-baby": "10/10 \"my darling, my blood.\"   fuck you clit eastwood. i can't stop crying.     ",
      "the-sisterhood-of-night": "7/10 THERE IS NO GAY IN THIS MOVIE!!! NONE!!! WHAT THE FUCK!!!     ",
      "somewhere": "10/10 i really miss my dad     ",
      "underworld-2003": "3/10 how do these keep getting made?     ",
      "cruel-intentions": "9/10 \"Eat me, Sebastian! It's okay for guys like you and Court to fuck everyone. But when I do it, I get dumped for innocent little twits like Cecile. God forbid, I exude confidence and enjoy sex. Do you think I relish the fact that I have to act like Mary Sunshine 24/7 so I can be considered a lady? I'm the Marcia fucking Brady of the Upper East Side, and sometimes I want to kill myself. So there's your psychoanalysis, Dr. Freud. Now tell me, are you in... or are you out?\"     ",
      "a-girl-walks-home-alone-at-night": "10/10 everything about this movie is perfect. but my personal favorites are - the cat- the disco ball scene- \"death\" by white lies- her haircut- the cat     ",
      "wet-hot-american-summer": "8/10 i believe we all owe a congrats to katie for owning her sexuality in this movie.     ",
      "the-hunting-ground-2015": "8/10 I AM SO ANGRY     ",
      "one-flew-over-the-cuckoos-nest": "9/10 jack nicholson looks way too hot in this movie     ",
      "spotlight": "9/10 zodiac but without murder     ",
      "twinsters": "9/10 AHHHHHH THESE GIRLS ARE SO CUTE!!! POP!!!     ",
      "the-houses-october-built": "5/10 I would do that exact same thing to those pretentious ass white people just because they call a haunting house a \"haunt\".     ",
      "gentlemen-prefer-blondes": "8/10 I love women     ",
      "the-overnight": "9/10 I want jason schwartzman to wave his big dick next to me.     ",
      "the-girl-in-the-photographs": "3/10 there are like 3 characters in this movie that remind me of jared leto.     ",
      "hush-2016": "8/10    HOW CAN SHE HEAR THE VIBRATIONS FROM THE FIRE ALARM BUT NOT HER FRIEND BEING MURDERED AGAINST A WINDOW?     ",
      "contracted": "4/10 I am never having sex. Ever.     ",
      "rango": "6/10 any movie that came out after 2009 that features animals is a \"discount fantastic mr. fox\".     ",
      "footloose-2011": "3/10 the fact that I saw this before the original makes me cry to this day.     ",
      "obvious-child": "8/10 jenny slate deserves 5 stars but I'm subtracting 1 for the countless poop/fart jokes.     ",
      "funny-games": "9/10    *dog appears*me - \"please god no\"     ",
      "the-place-beyond-the-pines": "5/10 why no gay?     ",
      "air-buddies": "8/10 rosebud is my feminist icon.     ",
      "a-clockwork-orange": "9/10 I want Stanley Kubrick to come back from the dead and explain this to me.     ",
      "ghost-world": "9/10 \"Dear Josh, we came by to fuck you, but you were not home. Therefore you are gay. Signed, Tiffany and Amber.\"     ",
      "rushmore": "10/10 WES ANDERSON WILL NEVER NOT IMPRESS ME     ",
      "melancholia": "9/10    I would like to hold hands with kirsten dunst as the world ends.     ",
      "the-secret-life-of-pets": "6/10 cute?     ",
      "alvin-and-the-chipmunks": "6/10 when I was little I swore alvin and the chipmunks invented christmas music     ",
      "shrek-2": "9/10 Shrek (2001) who?     ",
      "brooklyn": "8/10 SAOIRSE RONAN DESERVES MY WHOLE LIFE     ",
      "the-darjeeling-limited": "9/10 i would die for wes anderson     ",
      "juno": "10/10 I would die for elliot page     ",
      "the-careful-massacre-of-the-bourgeoisie": "10/10 i love watching rich snobby white kids get brutally murdered!!     ",
      "morgan-2016": "1/10 guys this movie is copying ex machina you cant tell me this doesnt look almost exactly like it     ",
      "the-giver": "4/10 I would give this a better review but I literally cannot and will not get over how wrong taylor swift looks in a wig and as a 14 year old???     ",
      "the-truman-show": "9/10 \"hey why do you like jim carrey?\"     ",
      "comet": "9/10 the reviews for this movie shocked me. this movie was beautiful, realistic, funny, and overall amazing.     ",
      "the-babadook": "9/10 my mom and I watched this two times in a row and we hated the kid both times.     ",
      "ferris-buellers-day-off": "10/10 can't believe this movie invented comedy     ",
      "children-of-men": "10/10 WHERE HAS THIS GORGEOUS MOVIE BEEN ALL MY LIFE?     ",
      "australian-psycho": "9/10 why did she apologize     ",
      "being-john-malkovich": "10/10 fuck craig, but one of the best endings i've ever seen.     ",
      "me-and-earl-and-the-dying-girl": "10/10 I just finished the book and book greg is fucking awful, movie greg is a literal angel. y'all are blessed.     ",
      "mustang-2015": "9/10 this is such a beautiful movie and i love being angry     ",
      "tangerine": "8/10 I love the power of girl friendship!!!!     ",
      "dont-breathe-2016": "8/10    lmao like seriously if the blind old man literally had body parts hanging from his window the police would still call him the victim??     ",
      "the-animal": "1/10 there is no movie that has made me want death more     ",
      "amelie": "10/10 when will anyone love melike that     ",
      "forrest-gump": "4/10 fuck forrest gump     ",
      "edge-of-tomorrow": "9/10 I LOVE TOM CRUISE AND IF YOU DO NOT I WILL FIGHT YOU     ",
      "iron-man-3": "6/10 fuck marvel (I say as I wear a marvel t-shirt).     ",
      "horror-2015": "1/10 I couldn't finish it. this is the only movie I couldn't finish     ",
      "jennys-wedding": "5/10 the chemistry between jenny and kitty is worse than straight people in Nicholas Sparks movies     ",
      "would-you-rather": "5/10 that's not fair     ",
      "knock-knock-2015": "7/10 where are their oscars     ",
      "bo-burnham-words-words-words": "8/10 4 stars for rant      ",
      "spirited-away": "10/10 I am in love with this movie     ",
      "kubo-and-the-two-strings": "10/10 OH!! MY!!! GOODNESS!! ALL THESE CHARACTERS OWN MY ASS     ",
      "under-the-skin-2013": "8/10 I really want her to seduce me like that     ",
      "the-diary-of-a-teenage-girl": "7/10 I will never get over how good Kristen Wiig is at literally everything     ",
      "closer": "8/10 natalie portman owns me     ",
      "the-purge": "6/10 rewatching this and not too bad     ",
      "like-crazy": "2/10 Fuck This Movie!!!!!     ",
      "21-jump-street": "10/10 I have zero shame giving this 5 stars     ",
      "the-cabin-in-the-woods": "9/10 first time I watched this when I was like 12 and I didn't appreciate it but I watched it again and holy fuck this movie is brilliant     ",
      "a-fistful-of-dollars": "7/10 why do they all have blue eyes     ",
      "et-the-extra-terrestrial": "10/10 so fucking magical     ",
      "american-history-x": "9/10 I WOULD DIE FOR EDWARD NORTON     ",
      "her": "10/10 it just really hurts. this movie will make you upset. a beautifully terrifying movie. not scary, just haunting. I love using that word and this movie fits it.     ",
      "the-kids-are-all-right": "5/10 I guess I really was expecting to like this movie but 2 1/2 stars for vampire weekend     ",
      "the-usual-suspects": "8/10    fucking kevin spacey am I right     ",
      "i-love-you-phillip-morris": "7/10 3 stars for ewan mcgregors blonde hair, a half star for how sad it made me     ",
      "shorts": "1/10 THE WORST MOVIE I HAVE EVER SEEN. AS A KID I HAD NIGHTMARES. THIS TRIGGERES ME TO THIS DAY. DONT WATCH THIS     ",
      "fury-2014": "8/10 so pretty but not really a plot??? idk I liked it a lot. acting was an A+     ",
      "fargo": "8/10 she is incredible and she did that     ",
      "dear-zachary-a-letter-to-a-son-about-his-father": "9/10    my mom recommended it to me by telling me what happened but still cried really hard and fuck shirley     ",
      "requiem-for-a-dream": "10/10 no shit i cried for 4 hours after watching this movie     ",
      "its-such-a-beautiful-day": "8/10 good but I need to watch it again. it didn't really impact me like I thought it would but id love to watch it again     ",
      "good-will-hunting": "9/10 real sad but real good     ",
      "full-metal-jacket": "8/10 I'm not giving it five stars is because the first half is so much better than the second half but I'm giving it 4 stars literally just because of how good the first half is     ",
      "jason-bourne": "3/10 just not good y'all I'm really tired of this bullshit     ",
      "the-fault-in-our-stars": "8/10 idk guys I'm weak once again     ",
      "song-of-the-sea": "10/10 perfect     ",
      "dead-poets-society": "8/10 pretty pretentious but I'm so pretentious I loved it     ",
      "matilda": "10/10 I'm weak     ",
      "10-cloverfield-lane": "8/10 made me shake when I came out of the theater and I literally almost threw up but y'all bless the writers for making this \"sequel\".     ",
      "frank-2014": "7/10 I'm pretentious as hell and this movie was too pretentious for me     ",
      "the-spectacular-now": "8/10    okay no but the sex scene in this movie gave me chills     "
   }
}