{
   "user": "jay",
   "reviews": {
      "the-proposal-2009": "4/10 need whatever drugs they had betty white on the set of this     ",
      "city-of-god": "8/10 it was those damn video games     ",
      "the-warriors": "8/10 other gangs: lets uber home from the club  me and the boys journey getting home from the club:     ",
      "videodrome": "8/10 popcorn bucket of james wood's stomach pussy would have gone so hard     ",
      "showgirls": "7/10 Donatella VERSAYCE 💜     ",
      "anatomy-of-a-fall": "8/10 currency exchange got the french listening to 46 cent     ",
      "madame-web": "2/10 how many pints can I drink before my showing of madame web? clearly not enough     ",
      "the-iron-claw-2023": "7/10 parental trauma final boss     ",
      "under-the-skin-2013": "8/10 hilarious when you think jonathan glazer probably had to explain to scarlett what a primark is     ",
      "this-is-spinal-tap": "7/10 getting the appeal of these reiner/guest movies now! it's just fuck it, get billy crystal in here as a mime for a bit     ",
      "easy-a": "6/10 emma stone fought god and won     ",
      "full-metal-jacket": "8/10 wild that people only talk about the training camp half of the film, and not the half where kubrick soundtracks the bird is the word from family guy     ",
      "con-air": "6/10 this would have made an epic fortnite collaboration     ",
      "rear-window": "9/10 sorry babe not tonight, my neighbour left his apartment three times in one night so I think he killed his wife     ",
      "the-graduate": "8/10 some college graduates don't want to make future defining decisions, they just want to meet hot milfs in your area     ",
      "misery": "8/10 when kathy bates wheels in that bbq I thought she was gonna cook her damn pig     ",
      "oppenheimer-2023": "9/10 anyone check if this passes the bechdel test     ",
      "saw-iii": "4/10 jigsaw be like ok tuesday im free but on wednesday im laying unconscious on a moldy bathroom floor     ",
      "salo-or-the-120-days-of-sodom": "7/10 don't hide subtext while showing me a gargantuan amount of shit from a butt and expect me not to focus more on the shit from a butt     ",
      "shivers": "5/10 most filmmakers find their niche a couple films in, but this is cronenberg, so naturally it's orgies and bugs from the start     ",
      "saw-ii": "5/10 back on my bullshit? oh honey i never left     ",
      "thelma-louise": "8/10 my aunt and her \"roommate\" on vacation thirty years ago     ",
      "my-neighbor-totoro": "8/10 *catbus appears* yeah my cat did this once     ",
      "in-the-mood-for-love": "9/10 he thought yearning didn't come with inherent suffering! he MAD!!     ",
      "the-football-factory": "5/10 day in the life of a true brexit geezer 🍺🍺🍺     ",
      "good-will-hunting": "8/10 therapists when robin williams dropped this performance: write that down write that down     ",
      "the-truman-show": "8/10 poor guy is gonna leave a world where everything revolved around him to learn about taxes     ",
      "stop-making-sense": "8/10 the only reason behind the tiny head and the massive suit is that he's four toddlers stacked on top of each other     ",
      "chicken-run-dawn-of-the-nugget": "5/10 remember what they took from you (fuckable rooster)     ",
      "john-wick-chapter-4": "8/10 how the fuck is he getting to all of these places     ",
      "doctor-who-the-church-on-ruby-road": " mr president, davina mccall has been hit by a christmas tree     ",
      "the-polar-express": "6/10 • there was an arguement with my family over watching this or the grinch. i lost  • when will kid tom hanks stop testing the girl you couldnt even keep a ticket safe  • the script reading for this was just tom hanks talking to himself alone     ",
      "deck-the-halls": "4/10 completely plausible as a scheme frank reynolds pulled over the holidays     ",
      "how-the-grinch-stole-christmas-2000": "7/10 2013 emo me at every single chance: hey mum did you know the girl who played cindy lou in the grinch is now in a rock band called the pretty reckless isnt that such an edgy fact     ",
      "cruel-intentions": "8/10 no one is surviving the nineties highschool photocopier cancellation     ",
      "the-nightmare-before-christmas": "8/10 the skeleton going through an identity crisis will not provide for you     ",
      "wonka": "6/10 me and my friends would have killed the hugh grant oompa loompa with hammers I can tell you that much     ",
      "five-nights-at-freddys": "4/10 four out of those five nights with freddy were fine     ",
      "come-and-see": "9/10 needed this after a month of almost exclusively watching selling sunset     ",
      "gremlins": "8/10 chris columbus was writing a pretty standard christmas film and two acts in he wrote who fucking cares! the gremlins kill literally everyone     ",
      "jingle-all-the-way": "6/10 one of the few christmas films that displays the reality of going outside on christmas like battle royale     ",
      "the-family-stone": "5/10    utterly insane to start homophobic debate at your first christmas with your boyfriends family. even more insane that one of his brothers reacts with \"she's the one for me\"     ",
      "doctor-who-the-giggle": " there's one thing about russell t. davies is that he loves a spare david tennant     ",
      "saltburn": "6/10 academy award winner emerald fennell ends her films like they're saw movies     ",
      "opening-night": "8/10 more tobacco was inhaled than oxygen on the set of this thing     ",
      "the-holiday": "6/10 the way they show cameron diaz experience english culture and its just her shouting mr brightside     ",
      "doctor-who-wild-blue-yonder": " well technically we got our multi-doctor story     ",
      "frances-ha": "8/10 why is she working without a profit mindset     ",
      "a-haunting-in-venice": "5/10 hercule poirot destroys faith believers with FACTS and LOGIC     ",
      "doctor-who-the-star-beast": " not even that far from the chibnal era in terms of writing but really shows how much of doctor who relies on energetic lead performances (something we have missed for years)     ",
      "gladiator-2000": "7/10 damn i was two days from retirement     ",
      "italianamerican": "8/10 post credit scenes have been trying to top the secret formula for catherine scorsese's sauce for decades     ",
      "thanksgiving-2023": "6/10 overstuffed!     ",
      "the-hunger-games-the-ballad-of-songbirds-snakes": "6/10 men will creative direct dystopian fortnite before going to therapy     ",
      "the-red-shoes": "8/10    she lived she served cunt then she died     ",
      "shiva-baby": "6/10 one of my favourite developments from short to feature is making the sugar daddy hot     ",
      "bottoms": "6/10 the epic highs and lows of high school football     ",
      "jennifers-body": "7/10 she should've been at the club...     ",
      "killer-klowns-from-outer-space": "6/10 killer klowns terrorising YOUR small town? more likely than you think!     ",
      "the-girl-with-the-dragon-tattoo-2011": "8/10 you could fit at least three more skargårds in this bad boy     ",
      "evil-dead-ii": "9/10 \"ok now lets take a silly one\"     ",
      "i-know-where-im-going": "8/10 introduced by thelma schoonmaker, who announced she is also joining letterboxd     ",
      "when-harry-met-sally": "8/10 no more tinder just carrie fisher and her rolodex picking your ideal mate     ",
      "monster-2023": "8/10    like i feel bad for the kids but there is no way mr hori deserved all that     ",
      "poor-things-2023": "9/10 mark ruffalo: stop giving me your toughest battles  god: you are my horniest soldier     ",
      "the-zone-of-interest": "8/10 Entire theatre was still, even the a24 ident didn't move     ",
      "killers-of-the-flower-moon": "8/10    everybody gangsta til marty brings out the true crime podcast quartet     ",
      "the-holdovers": "8/10 men were remembering the roman empire daily in the 1970s     ",
      "how-to-have-sex": "8/10 compulsory in-flight viewing on all flights during clubbing season. if you decline im chucking you out the plane     ",
      "priscilla": "7/10 every time jacob elordi stood next to a car i thought no way is he fitting in there     ",
      "maestro-2023": "6/10    lost my shit at the lydia tár tease in the postcredit scene     ",
      "all-of-us-strangers": "8/10 the american mind cannot comprehend this (the yorkshire accent)     ",
      "ferrari-2023": "5/10 adam driver this is your second strike one more and you will be banned from entering italy     ",
      "the-boy-and-the-heron": "7/10 mentally i'm here     ",
      "the-exorcist-believer": "3/10 the exorsisters     ",
      "the-killer-2023": "8/10 least sociopathic the smiths fan     ",
      "hit-man-2023": "7/10 basically the ‘removing girls glasses to reveal shes hot' trope but with glen powell     ",
      "the-royal-hotel": "6/10 always nice to see eivind from worst person in the world     ",
      "the-bikeriders": "7/10 norman reedus wasnt in the script he just showed up on set like that and they went with it     ",
      "taxi-driver": "8/10 bro look at my uber driver im so fucked bro     ",
      "gangs-of-new-york-2002": "7/10 new york city is scorsese's roman empire     ",
      "saw-x": "7/10 DO NOT order brain surgery from shein!     ",
      "cut": "4/10 a lot of people saying \"naurrrr\" in this one     ",
      "the-wonderful-story-of-henry-sugar": "5/10 fell asleep while watching to test whether i had the power to see with my eyes closed     ",
      "strange-way-of-life": "5/10 saint laurent are a bunch of losers for choosing to not have their name in the silly cowboy font     ",
      "no-one-will-save-you": "4/10    pulling the mental-health card to get out of being probed     ",
      "el-conde": "5/10 the greatest horror of all was the prospect that thatcher may still be alive     ",
      "point-break": "8/10 hate to see him leave...love to watch him go     ",
      "bend-it-like-beckham": "6/10 i prefer my sports films not to be about the game, but the lesbians that played     ",
      "saw-3d": "2/10 i was gonna say something funny about how the blood literally looks like strawberry milk but chester from linkin park shows up for a trap and im sad as hell     ",
      "saw-vi": "4/10 youre goddamn right i booked release day tickets for jigsaw im well and truely back on my bullshit     ",
      "gran-turismo": "5/10 literally me if nissan scouted people who are fucking sick at coconut mall     ",
      "past-lives": "8/10 found a version without subtitles, to get the full arthur experience     ",
      "28-days-later": "8/10 if i was in that situation first thing i wouldve done is poo in buckingham palace     ",
      "teenage-mutant-ninja-turtles-mutant-mayhem": "7/10 me and the homies heading out to get pizzaza     ",
      "saw-v": "2/10 shoutout to my boy agent strahm for talking to himself plot revelations because without him im sure many people would have no idea wtf is going on  (also i rate these so low you wouldnt think this is my one of my favourite series')     ",
      "saw-iv": "3/10 jigsaw: dies in the previous film  also jigsaw: you thought it was over     ",
      "the-princess-bride": "8/10 \"have you ever considered piracy?\" way ahead of you     ",
      "talk-to-me-2022": "7/10 what that hand do     ",
      "meg-2-the-trench": "2/10 *BANG BANG BANG* THE WATER IS SAFE SEND JASON STATHAM *BANG BANG BANG*     ",
      "dogville": "8/10 someone stole my fucking house. you cant have shit in dogville     ",
      "passages-2023": "7/10 bisexuals when they play both sides so that they always come out on top     ",
      "persona": "8/10 sorry for trauma dumping     ",
      "moneyball": "7/10 no wonder he wasnt taken seriously mf was called \"mr beane\"     ",
      "12-angry-men": "9/10 its just like jury duty     ",
      "they-cloned-tyrone": "7/10 if a film drops on barbenheimer weekend and theres no one around to see it, does it make a sound     ",
      "barbie": "7/10 i bring a sort of \"existential crisis\" vibe to the dance party that the other barbies dont really like     ",
      "in-the-loop": "7/10 of all the impacts david lynch has made on cinema peter capaldi using \"eraserhead baby\" as an insult sure is up there  other insults used by scottish people which ive adopted into my vocab include; love actually, humpty numpty, nazi julie andrews, little bo cock jockey, fetus boy     ",
      "theater-camp-2023": "6/10 molly is everything, hes just ben     ",
      "sicario-2015": "8/10 there are no wolves inside of me     ",
      "dragon-ball-super-super-hero": "6/10 i owe you an apology dragon ball, i wasnt really familiar with your game     ",
      "mission-impossible-dead-reckoning-part-one": "8/10 \"if there's a nuclear bomb i need to know about it\" real dialogue from tom cruise finding out about oppenheimer taking imax screens     ",
      "mrs-harris-goes-to-paris": "7/10 do i have THREADS??? the only THREADS i know are mrs harris and her sowing needles!!!     ",
      "legally-blonde-2-red-white-blonde": "5/10 cutting edge political satire     ",
      "insidious-the-red-door": "5/10    there is a moment an hour in when you realise rose byrne probably isnt going to be in this much     ",
      "scrapper-2023": "8/10 when im in a ‘best british debut feature' competition and my opponent is called charlotte     ",
      "freddy-vs-jason": "6/10 if you like shots of people being thrown into things then boy do i have the film for you     ",
      "marcel-the-shell-with-shoes-on-2021": "8/10 those shells were treating that divorce like it was the blitz     ",
      "blackberry-2023": "8/10 D - Demonstrate valueE - Engage financiallyN - Nurturing dependenceN - Neglect emotionallyI - Ice hockey team acquisition S - Separate entirely     ",
      "stoker": "7/10 wentworth miller: just take it easy on the transitions, its all there in the script  park chan-wook: haha yeah dont worry man     ",
      "after-hours": "8/10 so down bad im completing side quests     ",
      "the-matrix": "9/10 when i say this film is ahead of its time i mean it was 1 year before linkin park     ",
      "insidious": "5/10 just throw the whole damn kid away lol     ",
      "the-flash": "3/10 dc about to become two-time winners of oscars fan favourite movie moment with \"the flash puts a baby in the microwave\"     ",
      "spice-world": "8/10 i have never been prouder to be british     ",
      "speed-2-cruise-control": "3/10 imagine my disappointment when willem dafoe brings his jar of leeches and its not even part of his villain scheme     ",
      "bound": "8/10 these gays are trying to murder me!     ",
      "total-recall": "8/10 i love films that pretend that arnold is your regular average joe despite appearing twice the size of most humans     ",
      "pride-prejudice": "8/10 wishing we started calling each other by our surnames only again so i can live my pride and prejudice fantasy through being referred to by ‘mr bennett'     ",
      "spider-man-across-the-spider-verse": "7/10 there can be 100 spider-people in a spider-society and 99 of them don't believe in you but just one does     ",
      "cube": "6/10 if i was in the cube id say \"ok guys lets think outside the box\"     ",
      "the-others": "7/10 love insane women walking around a creepy house at night hearing shit, gotta be one of my favourite genders!     ",
      "withnail-i": "9/10 this is, at its purest, two londoners simply surviving the countryside     ",
      "the-boogeyman": "5/10 i shouldnt have smoked that shit now im seeing top 10 boogie woogies     ",
      "reality-2023": "7/10 i bring a sort of \"leak government documents\" vibe to the interrogation that the fbi agents in my house dont really like     ",
      "beau-is-afraid": "7/10 the unemployed friend at 2pm on a tuesday     ",
      "in-our-day": "6/10 at least half of the runtime is just talking about a cat     ",
      "cobweb-2023-1": "7/10 his life a movie fr!     ",
      "the-taste-of-things": "9/10 maybe it's just the build up of hangover and exhaustion but I welled up on multiple occasions     ",
      "asteroid-city": "7/10 Storm Asteroid City , They Can't Stop All Of Us     ",
      "kidnapped-2023": "5/10 thats one way to get rid of my annoying son i havent tried     ",
      "kubi": "6/10 succession with samurai (half of them are gay)     ",
      "fallen-leaves-2023": "8/10 babe wake up new fav romcom just dropped     ",
      "club-zero": "4/10 she ate (consciously)     ",
      "layer-cake": "7/10 absolutely the type of film to be introducing minor characters called ‘crazy larry' 1 hour in     ",
      "the-new-boy": "6/10 these kids were praying to jesus when cate blanchett was right there     ",
      "from-dusk-till-dawn": "7/10 tarantino may have method acted this one a little too hard     ",
      "how-to-blow-up-a-pipeline": "8/10 who up blowing their pipeline     ",
      "the-collector-2009": "4/10 the collector:  👁     👁       👄     ",
      "clock-2023": "5/10 dianna agron still cannot defeat the pregnancy allegations     ",
      "enys-men": "6/10 penys men     ",
      "the-king-of-comedy": "8/10 this shit keeps jimmy fallon waking up in a cold sweat at night     ",
      "polite-society": "5/10 would absolutely rip if it had half the budget of the films its inspired by!     ",
      "evil-dead-rise": "8/10    do NOT pass the goth kid the aux! they will start playing century old readings of the necronomicon ex-mortis book of the dead!     ",
      "best-in-show": "7/10 what the dog doin     ",
      "sick-of-myself": "8/10 me: this pill aint hitting  two minutes later: *starts hallucinating anders danielsen lie*     ",
      "inception": "8/10 snap back to reality     ",
      "memento": "8/10 unreliable narrator? bro he doesnt even know whats going on     ",
      "john-wick": "7/10    as a fan of brooklyn 99 it was especially satisfying to see the dude that plays the vulture getting sideswiped by a moving car     ",
      "air-2023": "7/10 and is this \"michael jordan\" in the room with us right now?     ",
      "the-hole-in-the-ground-2019": "6/10    no amount of \"i love my son\" will get me diving into the 50ft rural sinkhole, he's the earth's problem now     ",
      "the-super-mario-bros-movie": "6/10 so dedicated to the source material and still they ignored mario's trademark dump truck ass     ",
      "magic-mike-xxl": "8/10 her: he hasnt texted me back, hes probably cheating  me and the boys on one last trip to the myrtle beach male stripping convention:     ",
      "magic-mike": "5/10 hate when im trying to admire the peak physical male form and soderbergh keeps trying to shove \"plot\" and \"character arcs\" in my face     ",
      "evil-dead": "8/10 yes...ha ha ha...YES! - sickos     ",
      "clue": "8/10 too political, unfollowed     ",
      "dungeons-dragons-honor-among-thieves": "6/10 do NOT pass the dungeons and dragons fan the aux, they'll just start playing bardcore     ",
      "murder-mystery-2": "3/10 netflix exec: everyone is going to love our set piece by the arc de triomphe  intern: hey guys you wont believe what john wick gets up to this time     ",
      "capsules-2023": " though the format shift can be jarring initially, Capsules breaks out the chaotic claustrophobia of the isolation survival format and throws you into a drug induced reality where four students escape from a deadly bad trip. its backed up by some wretch-worthy practical effects and natural locations that are dying to be filmed, the lovely 70-minute runtime will breeze by before you know it. out today on amazon!     ",
      "halloween": "5/10 john carpenter's halloween if no one washed or cut their hair in years     ",
      "rye-lane": "8/10 if he doesnt wave at boats 🚩🚩🚩     ",
      "true-lies": " \"surely he wont ride a HORSE in there?\"\"surely he WONT ride a HORSE in THERE?\"\"SURELY he WONT ride a HORSE in THERE?\"     ",
      "bridesmaids": "7/10 violently throwing up in expensive dresses is an easy recipe for an original screenplay nomination     ",
      "john-wick-chapter-3-parabellum": "8/10 if john wick comes for me do NOT put a bounty on him. that was on ME. he caught ME slipping     ",
      "the-bling-ring": "7/10 if this was made 10 years later and starred rachel sennott you all wouldve eaten this up     ",
      "speed": "7/10 everybody gangsta til they gotta drive the bus at the consistent speed of plus 50mph     ",
      "scream-vi": "8/10    these serial killer nepo babies are getting out of hand     ",
      "luther-the-fallen-sun": "5/10 gonna start calling him midris elba the amount of 2.5s this man produces     ",
      "fall-2022": "6/10 had to grind for this view     ",
      "scream-2022": "6/10 dewey gay af for falling asleep when gale's ass out like that     ",
      "sanctuary-2022": "7/10 you know a film is gonna hit when the premise is christopher abbott being controlled by women     ",
      "10-things-i-hate-about-you": "7/10 heath ledger: *dances down steps with giant leaps*  christopher nolan: that him. thats our joker     ",
      "serial-mom": "8/10 get beverley sutphin on milf manor     ",
      "cocaine-bear": "3/10 petah the bear is here     ",
      "ant-man-and-the-wasp-quantumania": "3/10 certainly the worst head ive ever received     ",
      "blue-jean": "9/10 has anyone been by maggie thatchers grave lately? just to check     ",
      "puss-in-boots-the-last-wish": "8/10 yeah this is great and all but would it kill john mulaney to you know, voice act     ",
      "skinamarink": "6/10 fisher-price™ paranormal activity     ",
      "the-hunger-games-catching-fire": "7/10 the virgin gale: probably would rat you out to the capitol, cant paint his face like a rock  the chad peeta: lies to the capitol for you, can paint his face to look like a rock     ",
      "titanic-1997": "9/10 leftie snowflake boat DESTROYED by republican iceberg     ",
      "avatar-the-way-of-water": " james cameron postponing this for the past 5 years is the equivalent of 14 year old me lying to my teacher about the essay due last week which i \"left at home\" when in fact i havent even fucking started it     ",
      "birth-2004": "8/10 bored af might show up to some rich widows house to tell her im her reincarnated husband and see what happens     ",
      "pendas-fen": "7/10 yeah im fighting demons (homosexual urges)     ",
      "knock-at-the-cabin": "5/10 coincidentally works as an inadvertent prelude to gerard butler's plane     ",
      "sex-and-the-city-2": "2/10 good thing the sequel got greenlit i would have to tell my kids this was dune part two     ",
      "escape-from-new-york": "7/10 what is this, some kind of suicide squad?     ",
      "the-devil-wears-prada": "7/10 its clever but its not clever enough to credit stanley tucci as \"stanley gucci\" which would have topped every joke in this movie     ",
      "jeanne-dielman-23-quai-du-commerce-1080-bruxelles": "8/10 dear lord what a sad little life jeanne     ",
      "causeway": "7/10 oh she served alright!     ",
      "eo": "8/10 the donkey was a paid actor     ",
      "terrifier-2": "6/10 art the clown signing his name on the mirror in red like hes just lost a lip sync on rupauls drag race     ",
      "terrifier-2016": "3/10 all the neighbours while art the clown brutally murders everyone who enters the abandoned building: mustve been the wind!     ",
      "zoolander": "7/10 youre balenciaga! now its h&m! balenciaga! h&m!     ",
      "starsky-hutch": "6/10 feels like a gta v dlc, from snoop dogg giving side quests to smashing up a car on a golf course     ",
      "boom-1968": "6/10 old hollywood dramas was just locking 3 to 4 esteemed actors in a villa with only booze and filming what shit they did     ",
      "sick-2022": "7/10 the coughs are coming from inside the house!     ",
      "m3gan": "5/10 LET M3GAN SAY FUCK     ",
      "rrr": "8/10 two tickets to barbie please     ",
      "fyre-2019": " off topic but i was reading out the documentary bio to my friend and when i said \"now-incarcerated ja rule\" they replied with \"yo i know fyre was a mess but burning them to death is a bit harsh\"     ",
      "rope": "8/10 those gays knew it was over when the uninvited wine aunt who does horoscopes showed up     ",
      "austin-powers-in-goldmember": "4/10 do you think beyonce claims this or has she wiped it from her memory     ",
      "glass-onion": "7/10 the biggest mystery to hit the greek islands since sophie sheridan invited her three potential fathers to her wedding     ",
      "romy-and-micheles-high-school-reunion": "9/10 romy and michelle in the corner at the high school reunion: they dont know we invented post-its     ",
      "cliffhanger": "8/10 if i had a pound for every final battle on an upside down helicopter stuck halfway down a cliff, id have two pounds. which isnt a lot but its weird its happened twice     ",
      "knives-out-2019": "8/10 me on a date: i love a good murder mystery  chris evans trying to impress me: i've been a suspect in five cases     ",
      "barbarian-2022": "6/10 sucking on my titties like you wanted me calling me all the time like blondie     ",
      "home-alone-2-lost-in-new-york": "6/10 the mcalister parents are one more missing child case away from going full mccann and cashing in that book deal     ",
      "the-muppet-christmas-carol": "7/10 one taught me love = ghost of xmas pastone taught me patience = ghost of xmas presentone taught me pain = ghost of xmas future  ariana wasnt singing about exes she was singing about the ghosts of christmas spirit     ",
      "beast-2022-1": "4/10 someone clearly had left over cgi lions from the 2019 lion king     ",
      "the-fabelmans": "7/10 i knew spielberg in high school. he was not nearly as stylish and i stole his lunch money     ",
      "happiness": "8/10 love actually for the post nut clarity experience     ",
      "top-gun-maverick": "8/10 dads are finally allowed to clap when the plane lands     ",
      "your-christmas-or-mine": "5/10    very few christmas romcoms have been brave enough to show a dog inadvertently get shot in the head     ",
      "the-princess-2022": "5/10 coming from someone who has a princess diana calendar in his room, its very much time the industry let this woman rest     ",
      "amsterdam-2022": "3/10 david o'russell flexes how many people will still work with him in hollywood despite how much of a detestable cunt he is     ",
      "last-christmas-2019": "4/10    is this man who gave you his heart in a life saving operation in the room with us right now?     ",
      "bones-and-all": "8/10    me and the bad bitch i pulled by eating people     ",
      "troll-2022": "4/10 clearly no one paid the troll toll     ",
      "tar-2022": "10/10 lydia tár has fallen down the stage at the berliner philharmoniker!     ",
      "roald-dahls-matilda-the-musical": "6/10 the person at fault? conservative funding cuts to education     ",
      "disenchanted": "3/10 hopelessly waiting for amy adams to exit her flop era like fry's dead dog in futurama     ",
      "aftersun": "9/10 cheers sons crying now     ",
      "stutz": "7/10 men will literally watch a 90 minute session between jonah hill and his therapist in LA before going to therapy     ",
      "bros": "3/10 get billy back on the streets     ",
      "black-panther-wakanda-forever": "6/10    shuri's character motivation revolving around the development of a life saving medicine gives another strange layer to the on-set anti-vax claims     ",
      "the-wonder": "6/10 look at how she may or may not have ate that!     ",
      "scream": "8/10    gale weathers setting up her camera immediately after surviving a serial killer attack: STORYTIME! I ALMOST DIED [No Clickbait] [Gone WRONG]     ",
      "the-craft": "6/10 need some of the cocaine skeet ulrich and neve campbell's agent was snorting in 1996     ",
      "saw": "8/10    sure cancer may be killing john kramer but lets not act like lying face down on that germy ass bathroom floor for a good 7 hours helped him at all     ",
      "deep-blue-sea": "5/10 mad that spielberg did not consider giving the shark god-like abilities to turn people into plasticine rag dolls when creating jaws     ",
      "the-omen": "7/10 what a lovely picturesque family, i sure hope nothing involving the bastard child of satan happens to them!     ",
      "et-the-extra-terrestrial": "8/10 the movie magic fades a bit when you think about the intense missing persons case on ET's home planet     ",
      "lyle-lyle-crocodile": "4/10 even the crocodile sounds gay     ",
      "pearl-2022": "7/10 shes crazy but shes free!     ",
      "isle-of-dogs-2018": " im probably behind everyone else here but i just realised isle of dogs said fast is i love dogs wes anderson your talent never ceases to amaze me     ",
      "halloween-ends": "5/10 loved pensioner michael myers living in the sewers like master splinter     ",
      "bardo-false-chronicle-of-a-handful-of-truths": "5/10 its good, but if you were to put a gun to my head and force me to watch bardo again, id say shoot me     ",
      "guillermo-del-toros-pinocchio": "8/10 all rise for the anti-fascist pinocchio     ",
      "my-policeman": "6/10 i beg of one day we get an emma corrin performance where they dont play an unhappy newlywed     ",
      "the-stranger-2022": "7/10 aussie police took a little too much inspiration from chris hansen's ‘to catch a predator' with this one     ",
      "decision-to-leave": "7/10 \"we love a bad girl dont we\"\"yeah but not a murder suspect, hae-jun\"     ",
      "lady-chatterleys-lover-2022": "8/10 people from a century ago are so brave, you could die from the common cold and theyre out here sucking and fucking on dirt mounds     ",
      "the-menu-2022": "4/10    even service workers get their own midsommar     ",
      "the-banshees-of-inisherin": "8/10 colm be like \"me and the bestie\"  10 minutes later \"cant stand her fake arse!\"     ",
      "the-fly-1986": "10/10 if you say jeff goldblum is daddy but hesitate when someone brings up the fly you aint a real Freak™     ",
      "women-talking": "8/10    decision to leave     ",
      "triangle-of-sadness": "5/10 i wonder what shape ruben östlund puts in the title of his film next? i sure hope its not as one dimensional as this one     ",
      "the-whale-2022": "6/10 and id endure it again, just to clap for brendan fraser one last time     ",
      "the-good-nurse": "8/10 all pale british actors get a chance to play a creepy dude called cullen     ",
      "the-son-2022": "4/10 ok florian lets leave the generational rich people trauma to the succession writers     ",
      "allelujah": "3/10 when the nhs gets sold, this movie will be solely responsible     ",
      "living-2022": "7/10    its like breaking bad but instead of building a meth empire he builds a childrens play park     ",
      "catherine-called-birdy": "6/10 a period drama     ",
      "holy-spider": "6/10 decent enough to warrant its existence but nothing a true crime podcast on the subject couldnt get across     ",
      "medusa-deluxe": "9/10    just when i already think its already great, it has a fucking cast dance routine over the credits     ",
      "the-estate-2022": "2/10 at least we can recast logan roy with kathleen turner if brian cox croaks!     ",
      "white-noise-2022": "6/10 adam driver standing in the corner at the party: they dont know im a leading expert on hitler studies     ",
      "hocus-pocus-2": "5/10 \"you attract what you fear\" aaaaah hannah waddingham milf witch aaaaah 🤪     ",
      "blonde-2022": "4/10 bold and brash? more like, belongs in the trash!     ",
      "do-revenge": "5/10    eleanor: you took everything from medrea: i dont even know who you are     ",
      "dont-worry-darling": "4/10 yes i do the cooking yes i do the cleaning yes i keep the nana real sweet for your eating     ",
      "divergent": "3/10 joining dauntless is how i imagine auditioning to be a part of the jackass crew is     ",
      "see-how-they-run-2022": "5/10 glass onion you cannot come quickly enough     ",
      "robocop": "8/10 never have i seen so many men with awful hairlines in such a short space of time     ",
      "bodies-bodies-bodies": "6/10 big problems with the (lee) paceing     ",
      "shes-all-that": "5/10 kieran culkin got his starting playing a smarmy child brat and 23 years later he has not played a different role since, complete dedication to the bit     ",
      "fantastic-mr-fox": "9/10 even in animation george clooney wont stop assembling teams of specifically skilled diverse groups for elaborate heists     ",
      "shrek-the-third": "6/10 im joining millions of mourners around the world in paying tribute to His Majesty King Harold. united in our loss - we give thanks for extraordinary service to far far away, our thoughts are with the royal family at this time.     ",
      "pinocchio-2022": "3/10 the kids acting was pretty wooden     ",
      "i-came-by": "4/10 gotta be the biggest fear of a modern filmmaker to make a perfectly okay film with a talented well-known cast for it to be dumped on netflix and no one give a shit     ",
      "camp-rock": "4/10 broke: gaga and cooperwoke: lovato and jonas     ",
      "jackass-forever": "8/10 this is \"boys time\" in its most humblest of forms     ",
      "official-competition": "8/10 hope antonio banderas acted like this on the shrek 2 rehearsals     ",
      "orphan-first-kill": "7/10 she came for murder, she stayed for dilfs     ",
      "the-lighthouse-2019": "9/10 the perfect film for pirating on instagram     ",
      "she-hulk-attorney-at-law": " its a good thing better call saul has ended, otherwise saul would have been smashing down the courtroom door as soon as jennifer walters went barefoot     ",
      "nope": "7/10 getting my shit sucked by the space moth     ",
      "day-shift-2022": "5/10 its snorebin' time     ",
      "lightyear-2022": "5/10 i suppose this was also christopher nolan's favourite film as a child in 1995     ",
      "forgotten-silver": "7/10 popstar: never stop never stopping for film students     ",
      "clueless": "8/10 young cinephilles 🤝 40 year old mothers  paul rudd     ",
      "the-darjeeling-limited": "8/10 this is a nightmare blunt rotation     ",
      "they-them-2022-1": "3/10 another strike for the 'is p!nk gay' mandela effect is her song being used twice in the conversion camp horror     ",
      "prey-2022": "7/10 \"does your constant dread over a fictional dogs safety effect your overall enjoyment of the movie?\"  \"it does, and im tired of pretending its not\"     ",
      "minions-the-rise-of-gru": "6/10 i may have laughed a little too hard at the joke where wild knuckles doesnt realise his enormous house is destroyed until he opens the door and made a child cry     ",
      "justin-bieber-never-say-never": "2/10 another sin to add to scooter brauns list of crimes     ",
      "prisoners": "8/10 hugh jackman: where is my daughter  paul: i dano     ",
      "the-twilight-saga-breaking-dawn-part-2": "2/10 jacob a whole nonce waiting 7 years for edward and bella's daughter to be of age like: ⏱👀👀⏱👀     ",
      "fire-of-love-2022": "7/10 telling my girl \"i can rock your world\" then taking her on 30 years of geological volcanic expeditions     ",
      "deep-impact": "6/10 things armageddon (1998) did right:destroying paris  things deep impact (1998) did wrong:not destroying paris     ",
      "she-will": "5/10 this will make she willion dollars at the box office     ",
      "the-gray-man-2022": "4/10 rege jean page you have to have been cast as bond because you cannot have left a leading role in the massively popular bridgerton to be man in suit #23     ",
      "a-nightmare-on-elm-street-part-2-freddys-revenge": "7/10 you cant catch me gay thoughts!     ",
      "fire-island-2022": "6/10 netflix punching drywall when they realise all they had to do to get a hit jane austen adaptation was make all the characters gay men     ",
      "persuasion-2022": "3/10 me (never read persuasion) trying to get laid: wow this is nothing like persuasion     ",
      "after-2019": "2/10    replace the lead with a tall skinny irish girl and this is just a sally rooney tv adaptation     ",
      "thor-love-and-thunder": "3/10 christian took the money and bale'd     ",
      "high-school-musical-3-senior-year": " storytime i was in the dvd aisle and some kid sees zac efron on the cover of whatever sleezy teen comedy hes been in recently and says to its mum \"thats the boy from the greatest showman!\" and i dont know how long it will take me to get over the fact calling zac troy bolton from high school musical is now out of date. like i know hes actually got a career now but am i ready to let go? absolutely fucking not     ",
      "eternals": "5/10 youre all gonna watch me disappear into the sun     ",
      "the-black-phone": "6/10 all the dead kids on the black phone watching me accidentally trip on my own chain breaking my neck 😐😐😐😐     ",
      "smiley-face": "8/10 me, stoned: wait is this fucking play about us?     ",
      "hannah-montana-the-movie": "6/10 hannah montana is the yassification of miley cyrus     ",
      "jurassic-world-dominion": "3/10 clearly blew all the dinosaur budget on bringing back sam neill, jeff goldblum and laura dern     ",
      "popstar-never-stop-never-stopping": "6/10 the whole tangent of the 3rd band member retiring to live on a farm is the motivation daniel day lewis needed for phantom thread     ",
      "crimes-of-the-future-2022": "6/10 mr cronenberg took the term 'rearrange my guts' way too literally     ",
      "blood-in-the-water-2022": "2/10 the tagline is \"SAW MEETS JAWS\" of course im going to fucking watch this     ",
      "chip-n-dale-rescue-rangers": "6/10 expected to see yoshi on main street with all the other cartoons and dale to call out his tax fraud     ",
      "spiderhead": "4/10 you mean to tell me a spider gave me this head?     ",
      "the-green-inferno": "4/10 AMERICAN TRAVELLERS MIND YA DAMN BUSINESS CHALLENGE     ",
      "hustle-2022": "6/10 howie bling uses his basketball knowledge for good alternate ending     ",
      "paddington-2": "8/10 \"are you ready to learn how to be sequels as good if not better than the original?\"  the empire strikes back gulped.  aliens shuddered.  the dark knight nodded.  the godfather 2 blinked nervously.  \"yes paddington 2 dir. paul king\" they said in unison.     ",
      "benedetta": "8/10 bendetta said \"im kinda like a prettier jesus\"     ",
      "some-kind-of-heaven": "8/10 \"there are often no children\" no wonder its some kind of heaven     ",
      "men-2022": "5/10    all that for another 'close-up shot of woman covered in blood smiling' ending? fuck you!     ",
      "morbius": "1/10 this was so bad i wanna give you a zero. but thats not possible. so ill give you a one     ",
      "doctor-strange-in-the-multiverse-of-madness": "5/10 the multiverse in other movies: anyone can be anything and sometimes appear completely different  dr strange: his hair is a little different i guess     ",
      "armageddon": "7/10 michael bay adding an extra $3,000,000 to the budget to create a realistic annihilation of paris? completely worth the money     ",
      "hairspray-2007": "6/10 the humans that dont enjoy musicals will be the first to go out in the next wave of natural selection     ",
      "jackass-45": "7/10 they actually did it. they made a good covid movie.     ",
      "the-unbearable-weight-of-massive-talent": "4/10 the unbearable weight of massive disappointment     ",
      "conversations-with-friends": " when im in a worst irish accent competition and im against joe alwyn     ",
      "senior-year-2022": "4/10 if i was in a coma for 20 years and woke up in euphoria high i would ask them to put me back     ",
      "the-social-network": "9/10 No man I'll just talk about the Facebook movie all day shit man you have to be so interested in the shit I have to say about the Facebook movie fuck dude I just watched it a year and a half ago fuck Jesse Eisenberg man he fucked over Spider-man crazy Winklevoss twins rowing Trent Resin Or did the soundtrack fuck this guy who invented Facebook I don't like dying I can't think of who the fuck invented Facebook All I can think is who played the guy who invented Facebook who the fuck invented Facebook  MARK ZUCKERBERG.     ",
      "the-staircase-2022-1": "    casting call: \"closeted gay man\"  casting director: \"i know just the guy\"  casting director: *calls colin firth*     ",
      "jackass-number-two": "6/10 enriching my cinematic palette tonight     ",
      "dogtooth": "8/10 yorgos' family absolutely did not have live laugh love signs in their house     ",
      "everything-everywhere-all-at-once": "6/10 damn daniels!     ",
      "the-package-2018": "3/10 its times like these i really understand why netflix is constantly losing money     ",
      "shes-the-man": "6/10 amanda bynes method acting to play a man is leagues above anything jared leto could accomplish     ",
      "x-2022": "6/10 a24 in the studio like: yeah this script includes naked old people, release it     ",
      "tour-de-pharmacy": "8/10 thinking of how many 60+ year old people i can show this to and trick into thinking this is a real doc     ",
      "pet-sematary": "6/10 bet those lorry drivers had a great roadkill point system going on     ",
      "doctor-who-legend-of-the-sea-devils": "2/10 not another bbc show with will-they-wont-they lesbians under the water, im getting war flashbacks     ",
      "sonic-the-hedgehog-2": "5/10 there is a scene when sonic snowboards, to which i thought \"this is absurd!\", but then i remembered the film is subtly setting up a live action Mario & Sonic at the Olympic Winter Games     ",
      "death-on-the-nile-2022": "4/10 and here comes kenneth branagh reviving ensemble murder mysteries- no wait- its RIAN JOHNSON with a steel chair!     ",
      "class-action-park": "7/10 sorry doc, no amount of \"this water slide killed people!\" will stop me from wanting to go on that water slide     ",
      "high-school-musical-2": "8/10 \"t as in troy?\"  \"no, t as in talking to ghosts\"     ",
      "omer-the-tourist-in-star-trek": "6/10 literally nothing worth seeing in theatres right now so i paid to see a HD restoration of this     ",
      "high-school-musical": "6/10 curse this film for giving me unrealistic expectations of new years eve parties dueting the start of something new and getting wasted on sprite     ",
      "moon-knight-2022": " theres been a mistake, moonknight you guys won best picture     ",
      "fresh-2022": "6/10    its not the being farmed for your human meat, its the friends you make along the way     ",
      "the-bubble-2022": " tried watching this the other day. did not make it past the israel palestine joke 5 minutes in     ",
      "the-worst-person-in-the-world": "8/10    aksel: he wont treat you like i do baby  aksel: babe please dont text eivind back  aksel: *500 missed calls*  eivind: daddy big dick just landed in oslo     ",
      "drive-my-car": "9/10 maybe a 3 hour slowburn was not the smartest choice after staying up to 5am for that shitshow of an oscars     ",
      "the-naked-gun-from-the-files-of-police-squad": "7/10 strange that the crown forgot such an important part of the queens history, when she was almost assassinated by hypnotism at a baseball game     ",
      "olivia-rodrigo-driving-home-2-u-a-sour-film": " drive my car for people who dont have 3 hours to spare     ",
      "coda-2021": "5/10 and everybody waved     ",
      "gateways-grind": "8/10 sandi toksvig repainting and restoring the iconic green door of gateways club will be placed in lesbian history text     ",
      "the-dark-knight-rises": "6/10 doctor: i recommend you dont go skiing anytime soon  bruce wayne in literally the next scene: TEEHEE ZIPLINE GO BZZZZZZZZ     ",
      "deep-water-2022": "5/10 it wasnt that deep     ",
      "swimfan": "6/10 someone died in that pool, someone CAME in that pool, and this town is so cheap they STILL host all the swimming competitions in that same pool     ",
      "windfall": "4/10 the pandemic serving as an excuse to let directors make single location films with the substance of short films i made in my family home as a kid     ",
      "charli-xcx-alone-together": "6/10 never get on charli xcx' bad side. she has a weaponised army of gay people at her fingertips like nuclear launch codes     ",
      "crash": "8/10 charli xcx stans be like holy shit     ",
      "leprechaun": "5/10 lets have some fun this beat is sickyoure gonna get killed by a pogo stick     ",
      "the-adam-project": "4/10 humanity has been condemned to yearly ryan reynolds and shawn levy projects     ",
      "turning-red": "6/10 no matter how good you think your relationship is going youre never going to be fucked as hard as disney is fucking pixar     ",
      "nobody-2021": "7/10 christopher lloyd: call an ambulance! call an ambulance!  *pulls out a shotgun from his blanket*  christopher lloyd: but not for me     ",
      "batman-robin": "5/10 for the first time in 2 years i tested positive for coronavirus conveniently the day the batman released, so im taking the next best thing     ",
      "face-off": "8/10 its the thrill of wearing another mans skin     ",
      "avp-alien-vs-predator": "6/10 sexual tension between the predator and a human woman was not on my bingo card     ",
      "austin-powers-the-spy-who-shagged-me": "5/10 strange how i found this so much funnier when i was 8 and laughed more at sheer stupity and madness rather than sex jokes, still a fun watch though  drevilpunchingthekkk.gif     ",
      "the-power-of-the-dog": "7/10 she served kirsten cunst     ",
      "nightmare-alley-2021": "7/10 did anyone try the chicken? i thought the chicken was lovely!     ",
      "predator-2": "5/10 treating this film like a slasher whodunnit and trying to guess who the predator is makes the film infinitely more fun     ",
      "the-addams-family": "7/10 mortitia and gomez: we saw you from across the bar and we really dig your vibe     ",
      "the-princess-diaries-2-royal-engagement": "5/10 this film has FIVE (5) hiding in/coming out the closet jokes     ",
      "american-psycho": "8/10 as a graphic designer i too start vigorously sweating at the sight of copperplate gothic typography on a business card     ",
      "texas-chainsaw-massacre": "3/10 stan covid-cautious leatherface, not entering that bus party before putting on a face-mask     ",
      "marry-me-2022": "6/10 so down bad i cant stop seeing her in vitamix commercials     ",
      "the-hunger-games": "6/10 id like to see cinna in the rupaul werkroom     ",
      "licorice-pizza": "8/10 \"i can fix him\" says girl who is worse     ",
      "tall-girl-2": "2/10 one day some of you will realise netflix wont stop making these because hate watching gives some of their strongest viewing figures! not me though i will continue to be part of the problem     ",
      "austin-powers-international-man-of-mystery": "7/10 mike myers playing both the protagonist and antagonist:  i can be your angle....or yuor devil     ",
      "the-tinder-swindler": "6/10 when he asks for $250,000 after dating for 4 months: 🚩🚩🚩🚩🚩🚩🚩     ",
      "jackass-3d": "5/10 me after the two disclaimers warning the viewer to not participate in the stunts performed: you overestimate my will to live     ",
      "cha-cha-real-smooth": "7/10 if nothing this sundance festival has proved dakota johnson can elevate a performance based on whether she plays a milf or not     ",
      "alice-2022": "4/10 i dont know what this film is. i could see this film and not understand a thing. sorry to this film.     ",
      "emily-the-criminal": "7/10 you wouldnt steal a tv, you wouldnt steal a car     ",
      "am-i-ok": "3/10 if nothing we get dakota johnson replying to \"boobs in mouth?\"     ",
      "sharp-stick": "5/10 lena dunham's new nightmare     ",
      "after-yang": "9/10 the future is robots programmed to introduce children to mitski     ",
      "encanto": "7/10 bruno could survive in the walls with rats because as disney has constantly proven, those rats make a mean soup     ",
      "little-women-2019": " so was main period bitch keira kightley too tall to be a little woman whats up with that     ",
      "scream-4": "7/10 typographically stepped up when 5cream could not     ",
      "scream-3": "5/10 syndey prescott: my life a movie fr     ",
      "the-matrix-resurrections": "8/10    i love being in the world where spider-man is too scared to kill any villains but lana wachowski shows 200 people hurl themselves out of skyscrapers onto concrete     ",
      "scream-2": "7/10    laurie metcalf: my son was not a killer, he was from the wrong side of tracks     ",
      "the-tragedy-of-macbeth": "8/10 \"i dreamt of the three weird sisters\" bro thats haim     ",
      "the-mask-1994": "6/10 the energy i will be channelling this year is how jim carrey acts when he plays a green fella     ",
      "harry-potter-20th-anniversary-return-to-hogwarts": " jk rowling in this is the awful grandma you no longer invite to christmas but have to facetime briefly because sadly she is the reason why everyone exists     ",
      "fish-tank": "8/10 keeping up the trend of each film i watch this month to involve pissing     ",
      "spider-man-no-way-home": "6/10    damn, now there's no MAY home!     ",
      "ghostbusters": "8/10 fellas, is it gay to bust some slime with your bros?     ",
      "death-to-2021": "1/10 makes the satire in adam mckay's don't look up sound like animal farm     ",
      "wild-child": "6/10 did more for transatlantic relationships than the second world war     ",
      "the-boss-baby": "3/10 ACADEMY AWARD NOMINATED BOSS BABY     ",
      "the-harder-they-fall-2021": "7/10 the bigger they come the harder i fall (for jonathan majors)     ",
      "the-inbetweeners-2": "5/10 fundamentally this is a bad film but few films have memorable moments such as \"getting shit in the face on a water slide\"     ",
      "paddington": "8/10 put some respect on nicole kidman's name for being the original owner of that horrific wig toni collette wore in velvet buzzsaw     ",
      "spider-man-into-the-spider-verse": " i aint seen this and as much as i think homecoming is one of the best mcu films and as much i think tom holland is great and NOT to let 205 comic book stan jay jump out...............miles morales shouldve been the new live action spider-man  thank you for attending my tedxtalk     ",
      "chitty-chitty-bang-bang": "8/10 so the childless society is meant to be a bad thing???     ",
      "a-christmas-carol-2009": "5/10 stop letting robert zemeckis make animated movies! cheers sons traumatised     ",
      "dont-look-up-2021": "3/10 this isnt the same man that spearheaded succession into being made surely     ",
      "the-amazing-spider-man": "5/10 \"directed by marc webb\" feels like a punchline. funniest moment in a marvel movie honestly     ",
      "home-alone": "8/10 my love for this film was reignited by A Quiet Place directly paying homage to the great criminal marv merchants by emily blunt stamping on a rusty nail on a staircase, the true spirit of christmas     ",
      "the-santa-clause": "6/10 tim allen: there is no such thing as THE santa claus!?  elves: ITS THE TITULAR ROLE     ",
      "the-last-duel-2021": "7/10 and they say chivalry is dead     ",
      "22-jump-street": "6/10 channing tatum is the college frat himbo that made it     ",
      "21-jump-street": "7/10 fellas, is it gay to ask your bro to prom? to tell your bro to pretend to give him a blow job? to tell him you cherish him? to stick your fingers in his mouth?     ",
      "escape-room-tournament-of-champions": "4/10 these are way more difficult than jigsaws games. sure ill saw off my own foot but riddles? guess im dead!     ",
      "spider-man-2": "9/10 who up doc'ing their ock     ",
      "the-wicker-man-2006": "2/10 you didnt see bigfoot you saw nicolas cage in a bear costume     ",
      "west-side-story-2021": "8/10 they deserve this for thinking they can skip the talking stage     ",
      "moana-2016": "8/10 cursed review dwayne johnson singing youre welcome turned me on     ",
      "enchanted": "6/10 pip the chipmunk would fucking batter alvin and the chipmunks     ",
      "boiling-point-2021": "8/10 undercooked gems     ",
      "love-actually": "6/10 can we please fire the poster designer because, as someone who had not seen this before, was honestly expecting hugh grant to get with liam neeson, keira knightley to find love with martine mckutcheon and bill nighy to fall for rowan atkinson. needless to say i was baited     ",
      "house-of-gucci": "4/10 patrizia: can i have a drink please  maurizio: do you know who i am? im maurizio gucci  patrizia: ok maurizio gucci can i have a drink please     ",
      "the-humans": "7/10 vanity fair actors roundtable gone wrong     ",
      "ghostbusters-afterlife": "3/10 remember that key plot point of the first ghostbusters where they plan to scam stupid people out of money which cheap tricks, haha yeah     ",
      "love-hard": "4/10 so im supposed to feel bad for someone that got catfished? in this day and age?     ",
      "tick-tick-boom-2021": "6/10 i dont think andrew garfield had to railroad this musical biopic with a rant \"im not in spider-man: no way home\" for 2 hours, but a lovely voice regardless     ",
      "all-too-well-the-short-film": " dylan o'brien: hey man can we meet? ive got a new role i need to study and prepare for  jake gyllenhaal: sure bro, why me in particular?  dylan o'brien: no reason     ",
      "the-spongebob-squarepants-movie": "8/10 when princess mindy remembered all the sea creatures names, shes just like lady di     ",
      "tremors": "7/10 pity timothee wasnt there to teach them the sandwalk     ",
      "fast-furious-presents-hobbs-shaw": "6/10 do you think hobbs and shaw ever explored eachothers bodies     ",
      "the-guilty-2021": "5/10 helpless injured person: please sir i fell off my bike and someone stole my laptop and ran me over with their car  jake gyllenhaal, a 911 operator:     ",
      "hocus-pocus": "7/10 so down bad im gonna light the virginity candle     ",
      "bride-of-chucky": "6/10 she was fearless and crazier than him     ",
      "halloween-kills": "4/10 \"this isnt about you laurie\" men wont let women own shit     ",
      "dune-2021": " i dont know anything about dune and at this point im too afraid to ask     ",
      "spider-man": "8/10 mark zuckerberg count yourself lucky eduardo didnt become a goblin-dressed super villain after being ousted from the company he created     ",
      "lamb-2021": "6/10 how did this get the cannes originality award its just cottage core stuart little     ",
      "king-richard": "5/10 gotta keep an eye out for serena     ",
      "the-lost-daughter-2021": "8/10 has this woman never watched a conjuring movie? put the creepy doll BACK     ",
      "adaptation": "8/10 girlfriend didnt realise both brothers were the same actor for 40 minutes     ",
      "cmon-cmon": "9/10 this man needs a therapist!     ",
      "the-french-dispatch": " wes anderson: my next feature will star a recent best actress winner :) guess who it is :)  everyone: is it frances mcdormand  frances mcdormand, a known frequent collaboration of wes anderson: its me :)  everyone: *pretends to be shocked*     ",
      "cow-2021": "7/10 spot the gay farmer that played kali uchis and angel olsen in the milking parlour     ",
      "passing-2021": "6/10 i didnt think ana de armas in no time die would be beaten for least screentime for a major actor but alexander skarsgard takes it!     ",
      "titane": "9/10 this is just the tlc documentary about the person that fucks their car     ",
      "last-night-in-soho": "4/10 so im supposed to believe a girl from cornwall whos been to london once can run street to street without using citymapper     ",
      "the-feast-2021": "5/10 weirdest episode of come dine with me ive ever seen     ",
      "the-velvet-underground-2021": "7/10 i could have put my life savings on john waters appearing in a documentary like this and if i did i would be a much much richer man     ",
      "the-souvenir-part-ii": "5/10 honor swinton byrne: mother can have £10000  tilda swinton: yes dear  richard ayoade: *duel wields cigarettes*     ",
      "red-rocket-2021": "8/10 \"im ok with predatory behaviour and grooming minors, but i draw the line at pretending to be in the military\"     ",
      "spencer-2021": "9/10 kristen stewart is again accepted into a family of blood sucking demons, this time with horrific consequences!     ",
      "bad-assistant": "7/10 Bad Assistant feels like an early Bojack Horseman episode brought to life when, after receiving the best news of his career, Jason Schwartzman and his assistant find 'Sexual Jay' dead upstairs. Jason Schwartzman's charisma propels the short and Paige Klone grounds both characters in the surrealness of the situation, their confrontations flow naturally as Paige has previous experience as Jason's assistant, and the true-to-life influence (dead body aside) lifts the short to new ground. The 25 minute run-time is worth...     ",
      "casino-royale-2006": "8/10 judi dench: did you and vesper break up?  bond: nah, shes broke and im up     ",
      "dumplin": "7/10 lady bird if lady bird herself wasnt annoying     ",
      "no-time-to-die-2021": "6/10 im a fan of my mom, im a fan of handwritten letters, im a fan of classic movies, im a fan of poorly executed end of the world schemes, im a fan of chamomile tea,     ",
      "venom-let-there-be-carnage": "5/10 when venom and carnage touch tongues 😛     ",
      "diana-the-musical": "3/10 the same production value as a musical challenge on rupauls drag race     ",
      "mamma-mia-here-we-go-again": "7/10 \"are you ready to learn how to be the most iconic female musicians in the history of pop?\"  florence and the machine gulped.  marina and the diamonds shuddered.  \"yes donna and the dynamos\" they said in unison.     ",
      "squid-game": " no but anything that involves playing a game where you die if you lose is literally my crack     ",
      "shrek": "7/10 spending this morning watching the only royal wedding worth my time     ",
      "malignant-2021": "8/10    and they were wombmates     ",
      "bergman-island-2021": "8/10 the beach that turns you into mia wasikowska     ",
      "hes-all-that": "1/10 temporarily shutting down one of the largest testing centres in the peak of the pandemic to film a scene that could have been literally anywhere, dare i say worth it???     ",
      "sex-and-the-city": "5/10 carrie bradshaw: *throws her phone into the water*  lorde, penning solar power: write that down write that down     ",
      "candyman": "8/10 candyman's catchphrase really should have been \"i am beesed to meet you\"     ",
      "pig-2021": "8/10 babe 2: nick in the city     ",
      "cinderella-2021": "1/10 camila cabello: *starts singing another million to one reprise*  me: youve sang us this song many times  camila: and you will hear it AGAIN     ",
      "shang-chi-and-the-legend-of-the-ten-rings": "6/10 writer: so the villains motivation is being desperately in the mood for love  casting director: boy do i have an actor for you     ",
      "candyman-2021": "6/10 [holding hands with yahya abdul-mateen ii]  me: babe your hands are so cold  yahya: thats me hook     ",
      "normal-people-2020": " what zero affection does to a mf     ",
      "jaws": "8/10 im putting in a formal request for the bio of this film to be changed from the shark terrorizing the townsfolk to the shark minds his own damn business but the police need something to blame for the humans own stupidity     ",
      "the-swimming-pool": "6/10    its like sims 3 when you put your sims in the pool with no ladder and they just keep swimming until they eventually drown     ",
      "the-green-knight": " filmgoers in england want one thing and its fucking disgusting (its the green knight to be released in theatres already)     ",
      "spiral-from-the-book-of-saw": " saw spiral postponed to may 2021 cheers sons crying     ",
      "chungking-express": "8/10 this is not my beautiful house? this is not my beautiful towel? this is not my beautiful giant garfield?     ",
      "free-guy": "4/10 if an npc started acting up i would uninstall and refund the whole game. i paid for the main character experience not you     ",
      "el-camino-a-breaking-bad-movie": "7/10 i love having a semi-popular letterboxd account that my family dont know about it makes me feel like im heisenberg     ",
      "the-kissing-booth-3": "1/10 it was only a kiss how did it end up like this     ",
      "the-kissing-booth-2": "1/10 AND EVERYBODY CLAPPED     ",
      "the-kissing-booth": "1/10 the film equivalent of steve buscemi wearing a snapback, skating into school and saying \"how do you do, fellow kids?\"     ",
      "the-suicide-squad": "6/10    so glad they killed captain boomerang before harley quinn could make an ‘ok boomer!' joke     ",
      "call-me-by-your-name": "8/10 \"i saw her naked once, great body\" i want that twink obliterated     ",
      "midsommar": " western travellers dont go to a tribe/ritual environment and expect not to die challenge ??     ",
      "the-phone-call": "7/10 someone get sally hawkins a massage for carrying this whole short! she will always understand the brief whether she's a hotline counsellor or falling for a sexy fish man, and her performance just about gets you past the confused (definitely manipulative?) storytelling.  watched on argo     ",
      "pleasure-2021": "8/10 the best movie about swedish girls and orgasms since midsommar     ",
      "daughter-2019": "6/10 adore the use of handheld cameras in stop-motion (no wonder this got itself an oscar nomination) and this is sure to inspire a lot of people with dreams of working on animation. hopefully next time this style can be paired with equal attention to the writing as the story falls short compared to how good it looks.  watched on argo     ",
      "the-fabric-of-you": "6/10 reminiscent of fantastic mr fox, if mr fox was a tailor mouse that had homosexual feelings towards a fellow gentleman mouse. its impossible to ignore the comparisons to wes anderson's style of animation in the fabric of you, but its also impossible to not appreciate every detail that's cared for, and it makes for a very touching tail indeed.  watched on argo     ",
      "old-2021": "3/10 lets go to the beach-each lets go change our age  honestly the comedy of year, feels like every member of the cast was given a different interpretation of what the beach actually does mentally and physically. expecting a drinking game to develop as a companion to the film, ‘take a shot everytime someone introduces themselves with their profession'.     ",
      "jackass-the-movie": "6/10 still yet to see spike jonze create a body of work as good as this     ",
      "marguerite-2017": "7/10 marguerite gives new life to the phrase 'being born in the wrong generation', as we watch an elderly woman form a connection with her nurse, giving her closure of a lifetime of desires. i can't imagine how painful it must be for elderly gay men and woman watching the world be so accepting to a feeling they had to suppress to live in peace, and i have immense privilege to exist in an era where I can live my life...     ",
      "about-time": "7/10 if this film got one thing accurate its moving from cornwall/devon to london and trying to appreciate the everyday while you spend £6.80 on lunch from pret     ",
      "space-jam-a-new-legacy": "2/10 so i want the looney tunes to cover, i want the looney tunes halftime, i want lebron points and rebounds  it's the dumbest fuckin' bet I ever heard of  i disagree, i disagree gary     ",
      "freeze-2020": "7/10 freeze takes the viewer on a rollercoaster of fear for running out of time, parental pressure and post-relationship trauma. irregular storytelling keeps the short interesting and a host of quirky characters in vibrant set design stand apart from a crowd of medical thrillers. subtlety isn't something to be found in freeze which lends itself nicely to the runtime, though I'd love to see a feature version of this one day with more time to pack an emotional punch.  watch on argo     ",
      "the-fault-in-our-stars": "4/10 what if we accidently kissed 🤔🤭 in the anne frank house 😂😳🙈     ",
      "the-princess-diaries": "7/10 this was the blueprint for the episode of the crown season 4 when the queen teaches diana how to be a royal     ",
      "fear-street-1666": "6/10 witch, bitch, twitchmotherfucking right this is 1666     ",
      "black-widow-2021": "6/10 considering this film was 6 years in development, they really thought they could get away with russian the script     ",
      "flushed-away": "6/10 what really transcends this from other animated comedies is the joke that england are capable of reaching a world cup final     ",
      "fear-street-1978": "7/10 looking summercamp right in the eye     ",
      "no-sudden-move": "6/10    typical soderburgh, everyone mumbles about money then boom, surprise matt damon     ",
      "barb-star-go-to-vista-del-mar": "7/10 this is what under the silver lake thinks it is     ",
      "fear-street-1994": "7/10 queer horror in a evildeadian strangerthingsist riverdalistic screamian wescravenist cobainian kind of way     ",
      "cruella": "6/10 disney finally introduced its best character, a fashion gay that will follow emma stone into a life of crime     ",
      "kikis-delivery-service": "8/10 jeff bezos after copying kiki's next day delivery: i am that very witch     ",
      "the-underground-railroad-2021": " how do i break it to barry jenkins i stopped watching because i was more hooked on too hot to handle     ",
      "luca-2021": "7/10 how does luca guadagnino sleep at night knowing the best film about self identity discovery in one italian summer was from pixar in 2021     ",
      "the-amusement-park": "7/10 elderly attendees at disneyworld plummet 150%     ",
      "in-the-heights": "4/10 was the villain gentrification or was it lin manuel miranda     ",
      "chicago": "8/10 if i killed my husband, i didnt do it because i did. no i didnt❤️     ",
      "the-conjuring-the-devil-made-me-do-it": "5/10    the final fight is lorraine warren standing infront of her angry husband saying \"babe look at me! this isnt you!\"     ",
      "thirst-2009": "7/10 i can excuse drinking blood during sex but i draw the line at licking feet     ",
      "after-love-2020": "8/10 cher asked \"do you believe in life after love?\" and this film answered     ",
      "miss-americana": "7/10 when brendon urie appeared i honestly got jumpscared     ",
      "tampopo": "9/10 gordon ramsay never taught me to do that to an egg yolk     ",
      "first-cow": "8/10 cute date ideas: stealing milk from toby jones with your boyfriend (hes a baker)     ",
      "ichi-the-killer": "8/10 uncut gems: our title sequence is inside a rectum  ichi the killer's cum pool title card: you are like a baby, watch this     ",
      "spider-man-far-from-home": " mj: woah whos that guy spider-man is fighting? hes kinda hot  peter: goo.gl/exWsZo     ",
      "as-the-gods-will": "7/10 takashi miike said he wanted to make saw in a high school with a giant porcelain cat and no one stopped him     ",
      "atonement": "8/10    and they would have been happily married too, if it wasnt for that meddling kid     ",
      "army-of-the-dead-2021": "6/10 evidently clear suicide squad should have been the dceu movie zack snyder directed     ",
      "death-becomes-her": "8/10 this film is looking camp right in the eye     ",
      "the-final-destination": "3/10 literally got characters credited as 'racist' and 'racist wife'     ",
      "the-woman-in-the-window-2021": "4/10 gaslight, gatekeep, gary oldman     ",
      "oxygen-2021": "7/10 tell me how im supposed to breathe with no air     ",
      "mainstream-2020": "5/10 something poetic about a film where andrew garfield says FUCK COLDPLAY to be released on a day coldplay release a single     ",
      "oldboy": "10/10 oh dae-su: licks lee woo-jins feettarantino: god i wish that were me     ",
      "mom-and-dad-2017": "3/10 despite all my rage i am still just a nicholas cage     ",
      "the-wind-rises": "8/10 pearl harbour: origins     ",
      "they-live": "8/10 im trying to work out if the horror channel showing this at the end of christmas season was intentional  C O N S U M E     ",
      "nomadland": "8/10 the loneliest people shit the hardest     ",
      "the-father-2020": "8/10 merely existing past the age of 50 is getting less and less appealing     ",
      "django-unchained": "10/10 tarantino briefing his cast to say the n-word every sentence: some of y'all about to be real mad at me, but it must be said     ",
      "final-destination-3": "5/10 me on roller coaster tycoon making rides engineered to kill all the people in the theme park     ",
      "soul-2020": "9/10 i dont know about you! but im feeling 22!     ",
      "despicable-me": "5/10 phoebe bridgers 🤝 gru  \"if i could give you the moon i would give you the moon\"     ",
      "final-destination-2": "5/10 ive been caught speeding three times and even i would maybe fucking use my brakes if a log truck crashed in front of me     ",
      "american-mary": "7/10 i personally love it in revenge movies when the protagonist gets their revenge without any involvement of the police, but thats just me!     ",
      "uncut-gems": "8/10 razzie redeemer winner adam sandler     ",
      "follow-me-2020": "2/10 films where himbos have to play silly little games for their lives are like crack to me so ill be watching this monthly     ",
      "american-gangster": "8/10 ridley scott: here is the story of a rags to riches boss through illegal trade with a law enforcement hell bent on taking him down  me: we've heard this story before  ridley: AND YOU'LL HEAR IT AGAIN     ",
      "pulp-fiction": "10/10 \"how did they get away with copying direct line this hard\" - my 12 year old sister after the winston wolf scene     ",
      "final-destination": "7/10 i would have got off that plane the second i heard the crying baby, im sure the grim reaper would understand     ",
      "shaun-of-the-dead": "9/10 wright and pegg intentionally parodied kill bill with the kill phil sequence in the same year kill bill was produced. explain this athiests??     ",
      "jigsaw-2017": " this looks like shit but fuck im gonna love every second     ",
      "kung-fury": "4/10 decent for its youtube-era, but probably about time we stop letting \"parody\" be an excuse for something thats not very good     ",
      "surge-2020": "7/10 ben whishaw: im going to become the joker     ",
      "godzilla-vs-kong": "5/10 whats a kong to a god     ",
      "a-star-is-born-1954": "8/10 prefer this story with actors than singers in the remakes yet nothing here was as funny as bradley cooper pissing himself at the grammys     ",
      "snatch": "7/10 irish brad pitt is so fucking hard to understand even the netflix subtitles gave up     ",
      "hot-rod": "7/10 rip stanley kubrick you would have loved hot rod     ",
      "censor-2021": "7/10 niamh algar is the next film industry it girl! speak it into existence!     ",
      "zack-snyders-justice-league": "5/10 #ReleaseTheJokerSaysSocietyCut     ",
      "puss-in-boots": "4/10 i was convinced matt lucas played humpty dumpty and was gonna take that to my grave purely because he looks like an egg     ",
      "yes-day": "4/10 youtuber families you will be dealt with for this.     ",
      "chernobyl": " the scientists when chernobyl is burning down and microwaving everyone in a 30 miles radius: everything is fine     ",
      "david-attenborough-a-life-on-our-planet": "6/10 david attenborough has recorded jigsaw style messages for after his death so when the earth is uninhabitable a clip will be sent to everyone of david saying \"i told you so\"     ",
      "scott-pilgrim-vs-the-world": "9/10 hello ramona and knives shouldve dated goodbye     ",
      "twilight-2008": "4/10 my favourite of the \"oh anna kendrick is in this?\" cinematic universe     ",
      "hostel": "5/10 this tastes disgusting, but ill do it for you jay hernandez     ",
      "wandavision": " as far as shows that feature a coven of witches go  this didnt end with stevie nicks singing seven wonders did it     ",
      "two-of-us-2019": "7/10 be gay do crime     ",
      "emma-2020": "7/10 even in the rare occasion a period romance doesnt star keira they managed to squeeze the name 'knightley' in there     ",
      "ratatouille": "8/10 closing gusto's due to a rat problem must have caused a roDENT in their bank account     ",
      "wrong-turn-2021": "5/10 someone gets crushed by a tree log, something i personally have been missing from horror sequels since final destination 2     ",
      "john-wick-chapter-2": "7/10 john is one wicc bih  is this meme dead yet     ",
      "star-wars-the-rise-of-skywalker": "4/10    i can finally relate with star wars because i to have a grandparent who only tries to reconnect with me when its convenient for them     ",
      "i-care-a-lot": "6/10 ladies, is it girlboss to trap the elderly in facilities and profit from selling their assets?     ",
      "ammonite": "5/10 the idea of francis lee having a tantrum when the portrait of a lady on fire trailer drops midway through shooting this was honestly the only thing that kept me going     ",
      "star-wars-the-last-jedi": " STEP THE FUCK UP KYLO     ",
      "a-glitch-in-the-matrix-2021": "5/10 me: i am ready to be proven simulation theory is real  film: here are clips of elon musk interviews and rick and morty     ",
      "samurai-cop": "2/10 if you translate ‘japanese sword' to japanese in google translate it reads ‘katana' its true i did it     ",
      "pvt-chat": "6/10 julia fox and the acid guy from good time? what is this, a safdie brothers cross over?     ",
      "star-wars-the-force-awakens": "8/10 Kylo Ren chuckled. \"You mean the Chaos Emeralds?\"     ",
      "malcolm-marie": "6/10 zendaya is marie-chee     ",
      "the-dig-2021": "6/10 what other boring shit must carey mulligan pretend to be interested in to convince the academy to let her into the oscars     ",
      "crazy-stupid-love": "6/10 its good, but in the right hands the steve carrell and ryan gosling plot couldve paid off with romance like all the boys ive loved before and im sad the opportunity was missed     ",
      "return-of-the-jedi": "7/10 palpatine: *starts electrocuting luke*  vader: IVE ABANDONED MY BOY     ",
      "hostel-part-iii": "1/10 the smirking rich bald guy they keep cutting to whenever someone is being tortured i like to headcanon as jeff bezos     ",
      "the-empire-strikes-back": "10/10 han and leia: luke we need you to help fight the empire  luke: im off doing hot girl shit     ",
      "booksmart": "7/10 olivia didnt have to wilde out this hard     ",
      "star-wars-episode-iii-revenge-of-the-sith": "4/10 anakin skywalker: im playing both sides so that i always come out on top     ",
      "star-wars-episode-ii-attack-of-the-clones": "3/10 padme: *falls out of ship*  anakin: no! I have to go after her-  *realises she's fallen into a pile of sand*  anakin: guess she'll die     ",
      "star-wars-episode-i-the-phantom-menace": "2/10 i guess you are my little pod-champ     ",
      "euphoria-fck-anyone-whos-not-a-sea-blob": " jules: i have done nothing wrong ever in my life  me: i know this and i love you     ",
      "oceans-eleven-2001": "8/10    disappointed to learn \"the footage we've been watching isn't live\" twist wasn't invented by saw 2     ",
      "escape-room-2019": "5/10 rich people think theyre slick spending billions building death games when jigsaw and his metal scraps got the same effect for much cheaper     ",
      "the-collection": "5/10 basically saw 2 if jigsaw was fucking jacked     ",
      "wounds": "2/10 armie hammer: *starts biting dakota johnson's neck*  me: oh no     ",
      "promising-young-woman": "5/10    she sure had a lot of dependance in the cops considering its implied the cops didnt believe her friends r*pe case     ",
      "pieces-of-a-woman": "6/10 kirby: full loaded     ",
      "okja": "7/10 me, a meat eater: wow i fucking hate meat eaters     ",
      "wonder-woman-1984": "3/10 somehow that black and white imagine video isnt the worst thing gal gadot is responsible for this year     ",
      "audition": "8/10 i don't think i really have to question why this is in tarantino's top 20     ",
      "death-to-2020": "3/10 honestly the more charlie brooker makes stuff for netflix the less interesting, clever and entertaining his social commentary gets     ",
      "brahms-the-boy-ii": "2/10 i love my dead, porcelain son     ",
      "coco-2017": "8/10 for the first 30 minutes before they went to the land of the dead i thought it was a coming out allegory     ",
      "over-the-hedge": "4/10 i blame this film for my childhood habit of eating bark because of how it made the bark look delicious     ",
      "the-cat-returns": "7/10 haru: i wouldnt marry a cat  baron humbert von gikkingen: hey  haru: forget what i said     ",
      "charlie-and-the-chocolate-factory": "6/10 girls asking for a lanky 6'11 skinny gamer? you dont want a boyfriend you want mike teevee     ",
      "the-personal-history-of-david-copperfield": "7/10 \"where are the lobsters? who wants lobster? lobster?\" finally someone to appreciate willem dafoe's lobster     ",
      "black-narcissus-2020": " saint bored     ",
      "scrooged": "7/10 need a fairy ghost of christmas present to beat jeff bezos into paying his employees more     ",
      "phantom-thread": "8/10    reynolds: *gets down on one knee*  alma: omg, its finally happening  reynolds: *falls over*  alma: the poison is kicking in     ",
      "the-midnight-sky": "4/10 interstolen     ",
      "fred-claus": "5/10 weirdly pro-communist ??     ",
      "catch-me-if-you-can-2002": "8/10    christopher: walken  tom hanks: your dad fell down the stairs and died  christopher: fallen     ",
      "ariana-grande-excuse-me-i-love-you": " when two aris (grande and aster) support eachother to maximise their joint slay     ",
      "the-killing-of-a-sacred-deer": "8/10 colin farrell: Friendship ended with MARTIN MCDONAGHNow YORGAS LANTHIMOSis mybest friend     ",
      "bone-tomahawk": "7/10 ethical cannibalism is eating white settlers invading native american land     ",
      "falling-down": "7/10 michael douglas: im going to become the joker     ",
      "the-prom-2020": "4/10 james corden took back the first brick thrown at stonewall     ",
      "euphoria-trouble-dont-last-always": " therapy: expensive  pancakes with ali: free     ",
      "ma-raineys-black-bottom": "7/10 a one, a two, dont step on his shoe     ",
      "mank": "7/10 mank: *writes citizen kane*  orson: welle welle welle whats all this then     ",
      "rec": "7/10 cant rec-ommend it enough     ",
      "hillbilly-elegy": "2/10 you either die an oscar snubbee or you live long enough to see yourself win a razzie     ",
      "lovers-rock-2020": "8/10 i saw slowthai with the girl who plays martha at a music festival in barcelona last year, glad shes doing well :^)     ",
      "happiest-season": "6/10    of course everyone assumed kristen stewart stole the necklace. be gay do crime     ",
      "mayhem-2017": "6/10 \"the cdc is optimistic they can contain the virus immediately through mandated quarantines, and the nation will be virus-free by the end of the year\" how can a 2017 film be so topical     ",
      "good-morning": "8/10    iana: more movies need to end with sharting     ",
      "run-2020": "6/10    sarah paulson: *watches phantom thread once*     ",
      "the-quake": "5/10 we watched without english subtitles so i had no idea what was happening but hey i had fun     ",
      "hellbound-hellraiser-ii": "5/10    skinned naked woman climbing out a mattress had greased up naked danny devito climbing out a sofa energy     ",
      "hellraiser": "7/10 ALRIGHT PINHEAD YOUR TIME IS UP     ",
      "still-walking": " tried doing work with this in the background, needless to say i didnt get shit done     ",
      "possessor": "8/10 its like that one bit in always sunny when danny devito keeps trying to kill himself but he cant     ",
      "the-hills-have-eyes": "6/10 i miss when horrors were just reaction shots and over dramatic zooms     ",
      "sequin-in-a-blue-room": "7/10 felt seen when the teacher started analysing twilight     ",
      "a-clockwork-orange": "9/10 couldnt concentrate on what the film meant spent the whole time thinking young malcom mcdowell looks so much like evans peters     ",
      "shithouse": "7/10 shithouse by cooper raiff based on the life of cooper raiff starring cooper raiff directed by cooper raiff produced by cooper raiff in collaboration with cooper raiff and cooper raiff     ",
      "breathless": " the secret ingredient is crime     ",
      "shiva-baby-2020": "9/10 the most stressful jewish movie since uncut gems     ",
      "on-the-rocks-2020": "5/10 sofia coppola and noah baumbach take alternate years to make films about ‘ordinary' people who live in giant new york apartments and fly constantly like its free     ",
      "the-curious-case-of-benjamin-button": "6/10 will you still love me when im no longer young and beautiful     ",
      "cinema-paradiso": "8/10    alfredo rolling in that coffin after hearing toto came back to giancaldo     ",
      "under-the-silver-lake": " going by the synopsis alone is this paper towns (2015) for people with taste     ",
      "the-skin-i-live-in": "7/10 robert ledgard: you have the softest skin  vera cruz: ✨drink water✨     ",
      "barking-dogs-never-bite": "8/10    bong movies are just people hiding in basements     ",
      "eddie-the-eagle": "7/10 cheers mums crying     ",
      "borat-subsequent-moviefilm": "7/10 the last 10 minutes of this is the equivalent of a saw movie twist     ",
      "heathers": "8/10    jason and veronica: *leave bodies naked and in the woods, make no effort in making the murders look like suicides*  the police: this is a suicide     ",
      "dazed-and-confused": "8/10 love how this movie demonstrates how cultish american highschool is yet makes me feel so jealous i wasnt part of it     ",
      "roald-dahls-the-witches": "4/10 a24's the vvitches     ",
      "the-uninvited-2009": "4/10    dare i say does the fight club twist better than fight club     ",
      "the-twilight-saga-breaking-dawn-part-1": "2/10 this is basically body horror     ",
      "borat-cultural-learnings-of-america-for-make-benefit-glorious-nation-of-kazakhstan": "7/10 borat shitting at the trump hotel was ahead of it's time     ",
      "the-trial-of-the-chicago-7": "6/10 *credits roll*me: well that was awfuljeremy strong, crying: what?me: i said lawful. lots of law     ",
      "saint-maud": "8/10 theres some mauds in this house     ",
      "hubie-halloween": "3/10 my mum after watching uncut gems: adam sandler could not have had a more difficult to understand voice  adam sandler: bet     ",
      "sweeney-todd-the-demon-barber-of-fleet-street-2007": "7/10 i like ya cut g     ",
      "enola-holmes": "6/10 the virgin benedict cumberbatch sherlock  THE CHAD HENRY CAVILL SHERLOCK     ",
      "antebellum": "3/10 lionsgate choosing to release this in 2020 instead of saw spiral is a personal attack on myself     ",
      "the-devil-all-the-time": "5/10 narrator: as the thoughts came, he wasnt sure if he was going backwards or forwards   christopher nolan: haha, nice     ",
      "youve-got-mail": "6/10 im thinking of sending things     ",
      "im-thinking-of-ending-things": "8/10 life gave charlie kaufman plemons and he made plemonade     ",
      "tenet": " nolan worried about his film having cinemas open to be released to when robert pattinson is just happy he doesnt have to leave his house for the press tour     ",
      "the-peanut-butter-falcon": "8/10 shia labeouf  *gets his ass handed to him in a fight*  shia laskinny     ",
      "re-animator": "8/10 really defines the term 'giving head'     ",
      "the-dark-knight": "9/10 ‪id be lying if i said tdk wasnt great but honestly heaths performance makes up like 2 of those 4.5 stars‬     ",
      "interstellar": "8/10 christopher nolan should make a superhero movie. imagine how good that would be     ",
      "spree-2020": "6/10 they had the opportunity to call this bad influencer and they fucked it     ",
      "babyteeth": "8/10 girl really fell in love with james franco in spring breakers     ",
      "an-american-pickle": "6/10 and then he turns himself into a pickle and says \"im pickle seth\"  it was, without a doubt, the funniest shit ive ever seen     ",
      "buried": "5/10 he shouldve thought outside the box     ",
      "mission-impossible-fallout": "8/10 tom cruise is just training for when he eventually ditches scientology and he has to spend the rest of his life running from scientologists. they cant catch him if hes parkouring around skyscrapers at 60mph     ",
      "palm-springs-2020": "8/10 everyday i wake up     ",
      "this-is-the-end": "6/10 \"Jay's an inspiration.\"\"What do you think, Jay?\"\"So, let me lay this on you, Jay.\"\"You know Jay? I don't think I've ever actually met you.\"\"You're Jay, right?\"\"Jay. He's a sweetheart.\"\"Oh, thank God, Jay.\"\"Can we get Jay some water, please?\"\"Jay, I didn't even know you were in town. Good to see you.\"  this film feels like a warm hug     ",
      "scarface-1983": "8/10 hi everyone anthony montano here, miami's biggest drug lord     ",
      "the-place-beyond-the-pines": "7/10 relating to ben mendelsohn because i too after looking at ryan gosling for a total of 5 seconds offered him a place to stay, hired him and told him a life-threatening secret     ",
      "eurovision-song-contest-the-story-of-fire-saga": "3/10 why would you release this (a movie with a really bad abba - waterloo cover) and mamma mia: here we go again (a movie with a really good abba - waterloo cover) to netflix on the same day     ",
      "the-defiant-ones-2017": " jimmy iovines career was real interesting but its a pet peeve of mine hearing success stories starting with a massive fuck off stroke of luck? like iovine just happened to be an engineer when john lennon was recording an album, its like me bumping into robert eggers and him saying yeah you can create ALL the marketing materials for the northman     ",
      "her": "7/10 extra star for never seeing scarlett johanssons face     ",
      "da-5-bloods": "8/10 nothing gets a film party going better than a bong hit and a spike lee joint     ",
      "zodiac": "7/10 on behalf of all poster designers we are NOT serial killers and we WILL creep you out in our basements if you wrongly accuse us     ",
      "if-beale-street-could-talk": "8/10 gonna trick my racist grandma into watching this saying its an eastenders spin-off about ian beale     ",
      "boyz-n-the-hood": "8/10 the hood was so rough to cuba gooding jr he aged 30 years in the space of 7     ",
      "straight-outta-compton": "8/10 mum can we have straight outta compton  we have straight outta compton at home  home: bohemian rhapsody     ",
      "lady-bird": "8/10 so its mothers day in the uk and i saw this with my mum in my small ass local theatre that never gets busy showing something like this (throwback to the opening of moonlight last year and only 4 people showed up) but the screen was full of mothers and daughters seeing the movie together and im glad this really good movie has brought people together thanks greta     ",
      "13th": " UPDATE: thank you all for your orders, we raised an amazing £350 over the weekend and split it over 6 charities, more information is available on my instagram  i havent watched this yet but i got an important message and this is an appropriate film to post it with  all profits from my print store over this weekend will be donated to minnesota freedom fund, an organisation that pay prison bails for the people protesting police brutality, the corrupt justice system and george floyds murder, alternatively you can donate via the link below if you can  black lives matter  store: jaybennett.bigcartel.com/minnesota freedom fund: minnesotafreedomfund.org/     ",
      "a-florida-melancholy": " i never had the pleasure to meet eli hayes personally but i know how widely loved he was on this platform and by its community, the news of his passing hit me deeply this morning. i cant recommend watching his short enough to remember what a great talent we lost today and letting his work continue to inspire while hes absent from this world.     ",
      "cats-2019": "3/10 uncat gems     ",
      "nimic": " i bumped into yorgos lanthimos after uncut gems at london film festival and i wish i saw this sooner so i could have asked him, personally, what the fuck is wrong with you     ",
      "let-the-right-one-in": "10/10 do not let her in, understand me? just ignore her     ",
      "capone-2020": "5/10 caponelyim mr caponelyi have nobodyfor my own     ",
      "tigertail": "6/10 so the intern autofilled the box saying where the majority of netflix's marketing budget was going and it went to the wrong netflix original called tiger____ right     ",
      "the-lodge-2019": "7/10 if these (step)mothers dealing with cults and asshole kids dont start staying away from open fireplaces     ",
      "you-were-never-really-here": "8/10 im joaquin on sunshine     ",
      "baskin-2015": "5/10 disappointed this wasnt the carole baskin tiger king standalone i was awaiting, but alas     ",
      "bad-trip-2021": "5/10 spielberg better hold off releasing his west side story remake because this is the only love story about a guy chasing a girl called maria i need this year     ",
      "long-shot-2019": "7/10 the first scene in the neo-nazi group is seth rogan's blackkklansman     ",
      "day-of-the-dead": "8/10 something about I'M RUNNING THIS MONKEY FARM NOW FRANKENSTEIN AND I WANNA KNOW WHAT THE FUCK YOU'RE DOING WITH MY TIME can be so personal     ",
      "28-weeks-later": "6/10 imogen poots should have been hollywoods next star, the pootential she had     ",
      "sacerdotisa": " friendship ended with full length features. now supporting and hyping up my friends short films is my best friend (unrelated i also did the poster😌)  www.youtube.com/watch?v=bCCRX-HastY     ",
      "waiting-2020-1": " she literally never misses     ",
      "akira": "7/10 *to the tune of hips dont lie* akira akira     ",
      "the-weeknd-after-hours": " same fucking reason everybody else is here, see the fucking weeknd perform     ",
      "there-will-be-blood": "10/10    i hope paul thomas anderson wrote in the script \"closing scene, bowling alley, daniel STRIKES eli\" and lightly chuckled to himself while playing wii bowling     ",
      "the-adventures-of-sharkboy-and-lavagirl": "3/10 Ｉ ｄｉｄ ｎＡＵＧＨＴｔ！ Ｍｉｓｔｅｒ Ｅｌｅｃｔｉｃ ｓｅｎｄ ｈｉｍ ｔｏ ｔｈｅ ｐｒｉｎｃｉｐａｌ＇ｓ ｏｆｆｉｃｅ ａｎｄ ｈａｖｅ ｈｉｍ ＥＸｐｅｌＬｅｄ！﻿     ",
      "steve-jobs": "7/10 hope the launch event went well for him!  tags:[watched on macbook] [reviewed on iphone 8]     ",
      "the-platform": "7/10 snowpisser     ",
      "the-hunt-2020": "2/10 the closest were gonna get to glenn howerton as patrick bateman i guess     ",
      "sonic-the-hedgehog": " releasing this after detective pikachu is like fox releasing dark pheonix a month after endgame     ",
      "parasite-2019": "9/10 parasite is my minimalist architecture porn mmm yes unplastered grey stone walls mahogany floor and impractical enormous glass panels fuck my shit up     ",
      "quarantine": "3/10 the film kinda hits harder now you know     ",
      "sorry-to-bother-you": "7/10    good to see bojack is still getting work     ",
      "color-out-of-space": "7/10 WHAT IF IT WAS PURPLEEEEE     ",
      "the-invisible-man-2020": "7/10 was sweet to see the invisible man take his son out trick or treating, though i wasnt huge on the divorce subplot     ",
      "guns-akimbo": "3/10 not once references the twenty one pilots song 'guns for hands' i cant help but feel this was based on     ",
      "oceans-eight": "6/10 everyone acting like theres no conflict but there was a clear conflict from the producers desperately trying to stop cate blanchett causing a giant lesbian orgy     ",
      "oceans-thirteen": "6/10 stole billions of dollars, an entire cabinet of diamonds and all matt damon won was his dads approval     ",
      "oceans-twelve": "4/10 between the events of oceans 11 and oceans 12 brad pitt dicovered the matrix movies and immediately bought a trench coat     ",
      "t2-trainspotting": "5/10 fuckin love bein fae scotland nae other place in the world like it everything about the place is amazin, fae the normal cunts tea the junkies everybody knows wit a good laugh is, its just wan big coutry fulla patter     ",
      "logan-lucky": "8/10 the bang brothers were lucky to only lose their senses to smell to the scarlet fever. jo march lost her sister     ",
      "scent-of-a-woman": "6/10 al pacino be like: i may be blind but i can see wealth privilege     ",
      "funny-games": "8/10 funny games but instead of paul and peter asking for eggs its the safdie brothers     ",
      "good-time": "7/10 im literally out of breath from watching this     ",
      "assassins-creed": "3/10 distinguishably lacked the only thing i remember from playing assassins creed: hiding in haystacks     ",
      "snowpiercer": "7/10 if the capitalists get a train what did the communists get? a boat? id like to see that story     ",
      "goldman-v-silverman": " DAYMAN  FIGHTER OF THE NIGHTMAN     ",
      "the-two-popes": "4/10 nominating the two popes for so much is just an ad campaign so people watch the two popes to find out what its being nominated for. yeah ill bite     ",
      "memories-of-murder": "8/10 not sure how so many detectives cinema-wide get away with simply not doing their jobs     ",
      "eighth-grade": "8/10 cant help but feel like the safdie brothers broke into the editing suite with all the uncomfortable close-ups and pulsating basslines     ",
      "blackkklansman": "8/10 kkk member: you undercover or something? you sure ask a lot of questions  adam driver: 🗿     ",
      "heat-1995": "8/10 robert de niro i too am a lonely graphic designer who would very much like to be whisked off for an all expenses paid getaway to new zealand     ",
      "in-bruges": "7/10 not looking forward to when i have to kill colin farrell in the race war     ",
      "wrong-turn-6-last-resort": "1/10 midsommar wants what this rural incest cult focused on killing their new members significant other has     ",
      "rocketman-2019": "6/10 is it the gay 80s musician cinematic universe or the manager john reid is a snake cinematic universe     ",
      "shrek-2": "7/10 the way the passing of the infinity gauntlet in avengers endgame has NOTHING on the passing of the fairy godmothers wand     ",
      "mean-streets": "6/10 i think what theyre trying to say is its the people that made the streets mean     ",
      "ready-or-not-2019": "7/10    when florence pugh said \"marriage is an economic proposition\" in little women she didnt factor satanic ritual into the equation     ",
      "casino": "8/10 im not close with my grandparents because joe pesci set an unrealistic expectation for old people     ",
      "honey-boy": "7/10 youll be glad to know this coming of age movie features many pool sequences     ",
      "marriage-story-2019": "9/10    the second time in his career adam driver has screamed at his co-star \"do not compare me to my father\"     ",
      "game-night": "7/10 well, when life gives you plemons     ",
      "the-irishman-2019": "8/10 joe pesci says \"lets go girls\" and i couldnt stop thinking about shania twains i feel like a woman for the remaining 2 hours and 40 minutes     ",
      "let-it-snow-2019": "4/10 jacob batalon is just working his way around every actor whos portrayed spider-man, andrew garfield youre next     ",
      "the-departed": "8/10    jack nicholson: \"i know you colin, id never give you up\"matt damon:jack nicholson: \".....let you down....run arou-\"matt damon: *shoots*     ",
      "the-big-short": "5/10 on screen talent £5,000production costs £1200black tar for ryan goslings hair £5,000,000lighting £100score £40  someone who is good at the economy please help me budget my film please     ",
      "goodfellas": "9/10 a certain somethin' which may or may not have fallen off a certain truck, huh? and the certain somebody that we know thinks they saw that certain someone pick it up and take it back to that certain bar which may or may not be the place that we happen to be or not be talkin' to a couple of certain somebodies right this very second     ",
      "portrait-of-a-lady-on-fire": "9/10 sets the unrealistic expectation my friends will surprise me one day with not only a beautiful painting of myself, but also they are being paid to spend time with me     ",
      "vice-2018": "5/10 dick cheney: im having heart surgery  jesse plemons: ill be here when you wake up  *dick cheney wakes up after the surgery*  dick cheney: where is he?  lynne cheney: who do you think gave you the heart?     ",
      "doctor-sleep": "7/10 you say you see a bright light when youre dying if i dont get ewan mcgregor and his death cat then i aint going     ",
      "chef": "7/10 sets the unrealistic expectation twitter beef could propel my career into motion, im 4 years in and so far its a no show     ",
      "the-wolf-of-wall-street": "8/10 it's called brand recognition and maybe if you had a fucking business that you were passionate about then you would know what it takes to run a fucking business but you DON'T     ",
      "the-laundromat-2019": "3/10 just because steven soderbergh can make 4 films a year on his iphone x doesnt mean he should     ",
      "blade-runner": "6/10 i must need glasses because i cant see the hype  i dont see it     ",
      "the-last-black-man-in-san-francisco": "8/10 i heard you paint houses     ",
      "zombieland-double-tap": "4/10 bold of this film to take such an anti-clown stance after the spooky clown autumn we just had, but i respect it     ",
      "bad-education-2019": "7/10    this one goes out for every gay student who wanted to fuck their english teacher     ",
      "the-king-2019": "6/10 must a movie be good? is it not enough to see robert pattinson mock timothee's penis size almost to the point of tears?     ",
      "la-la-land": "7/10    Unlike most films in the past year, I didn't let other peoples love for this effect my expectations for when I got around to watching the film, so I set my expectations low enough resulting in an enjoyable nostalgic experience from La La Land.  Since Hollywood likes to lick its own ass once in a while, this film is bound to sweep the Oscars this year, in which Emma Stone, the soundtrack and Damien Chazelle (who unsurprisingly made every shot...     ",
      "waves-2019": "5/10 im already trying not to think of the meme potential to watching a teenager trash his room and punch a wall after getting a bad text what makes you think playing tyler the creator over it will help     ",
      "a-beautiful-day-in-the-neighborhood": "6/10 therapy: expensive  tom hanks as mr rogers breaking the forth wall asking how you deal with anger: free (or the cost of a cinema ticket )     ",
      "ford-v-ferrari": "6/10 i hate to say i hope i dont sound ridiculous i dont know who Le Mans is. he could be walking down the street, i wouldnt know a thing. sorry to Le Mans.     ",
      "dirty-grandpa": "3/10 as soon as robert deniro said ‘dead wife' in that way every italian american says ‘dead wife' my mind drifted to how good this could have been if deniro was replaced by danny devito  ( also ! thank you letterboxd for giving my the /jay username)     ",
      "us-2019": " me: 🎶i dont want a lot for christmas~🎶  jordan peele: ok ill just take back that trailer i just dropped ungrateful BITCH     ",
      "the-souvenir": " cant believe tilda swintons daughter grew up to be greta gerwig     ",
      "hustlers-2019": "7/10 one day, lorene scafaria was walking outside and saw a boy crying. she said to him \"one day you'll make a critically acclaimed true story about business partners screwing each other over told entirely in one long flashback\".  that boy grew up to be david fincher.     ",
      "ad-astra-2019": "6/10 nasas next targeted recruitment program: daddy issues     ",
      "the-death-life-of-john-f-donovan": " kit harrington begging xavier dolan to release john f donovan so he has something else to put in his showreel to seperate the game of thrones clips     ",
      "tall-girl": "1/10 size 13 nikes, she walked in the club like nobodys business     ",
      "nightcrawler": "8/10 me, applying makeup, picking my best outfit and decorating my own crime scene before im murdered: gotta look good for jake     ",
      "once-upon-a-time-in-hollywood": " brad pitts yeehaw accent is giving me gorlami war flashbacks  also i made a poster for this film with the few stills released because sometimes you gotta take shit into your own hands     ",
      "it-chapter-two": "3/10 skarsgard and hader? call it a double bill     ",
      "the-lord-of-the-rings-the-fellowship-of-the-ring": "10/10 before we go on a 9 hour quest to dispose of some cheap jewellery anyone wanna admit they got a crush on me     ",
      "the-worlds-end": "7/10    what does edgar wright have against weatherspoons that he made a movie that compares them to an alien network     ",
      "the-nice-guys": "8/10 im jonathon with the gay towel     ",
      "the-purge-anarchy": "5/10 a rare fraction in time before lakeith stanfield had bone structure     ",
      "yesterday-2019": "4/10 stop being original > plagiarise > get PRAISED for plagiarism > profit?     ",
      "drive-2011": "8/10 car salesman ryan gosling: *slaps roof of car* this bad boy can fit so many goddamn criminals in it     ",
      "green-room": "8/10 now the letterboxd drama has died down, who wants to **** some ****s     ",
      "jojo-rabbit": " Wes Anderson's Inglorious Bastards     ",
      "the-kings-man": " i dont know about yall but theres gonna a lot of confused old people in the audience expecting this to be a sequel to The Kings Speech (2011)     ",
      "before-sunrise": "9/10 sadboy ethan hawke: Hmm ur arty huh  UR ARTSY HUH  im artsy :(     ",
      "the-big-sick": "8/10 if anyones wondering why i didnt go into film criticism a sufficient answer is about 10 minutes from the climax of the film i asked myself \"hey the female lead has been absent from the film for a long time\". i JUST realised why it was called the big sick     ",
      "princess-mononoke": "8/10 call it what it is. treeson     ",
      "battle-royale": "9/10 did anyone try the chicken and sweetcorn soup? i thought the chicken and sweetcorn soup was lovely     ",
      "anima-2019": "7/10 #AnimaArmy     ",
      "lost-in-translation": "8/10 The Last White Man in Tokyo     ",
      "childs-play-2019": "5/10 i dont think the world is ready to see aubrey plaza play a mom     ",
      "black-mirror-striking-vipers": " if youre gay in the game, youre gay for real     ",
      "murder-mystery": "2/10 i dont know about about a murder but luke evan's agent is clearly trying to kill his career     ",
      "knock-knock-2015": "2/10 thats enough bad career decisions, keanu reeves     ",
      "gone-girl": "8/10 nick dunne likes adam sandler movies thats enough to know hes an asshole     ",
      "black-mirror-smithereens": " wouldve been better if it ended with uber driver andrew scott turning to his passenger saying \"ay so youre still gonna give me 5 stars right?\"     ",
      "ma-2019": "4/10    so are we just gonna forget how the teenagers just left ashleigh in that burning building or are we too busy thinking about the phallic dick shot     ",
      "jonas-brothers-chasing-happiness": "6/10 jonas brothers getting their own documentary over the real star of camp rock? call it what it is. sexism     ",
      "charlies-angels-full-throttle": "4/10 its comforting justin theroux's hairline hasnt gotten better or worse in 17 years hes always been a walking mcdonalds M     ",
      "black-mirror-rachel-jack-and-ashley-too": " miley cyrus playing a pop star that leads a double life? its too poetic     ",
      "the-doors": " not rating it as i watched it drunk on a beach in cannes but i recall saying \"oh so its basically bohemian rhapsody\" which got me a lot of glares     ",
      "always-be-my-maybe-2019": "6/10 im sure it took keanu a lot of effort not to cause a mass shoot out in that neon lit restaurant     ",
      "lobservateur": "10/10 brave of cannes film festival to think its relevant without giving this the palme d'or     ",
      "mr-beans-holiday": "5/10 \"students, are you ready to learn how to be professional directors?\"  christopher nolan gulped.  quentin tarantino shuddered.  david fincher nodded.  wes anderson blinked nervously.  \"yes carson clay from mr beans holiday\" they said in unison.     ",
      "matthias-maxime": "8/10 two bros chilling on a waterbed five feet apart cause theyre not gay     ",
      "trainspotting": "8/10 ye ever wanty just tie yer arm up nice and cosy and then just fucking get right inty the heroin and blow yersel up tae fuck     ",
      "memoirs-of-a-geisha": "7/10    miss geisha? miss geisha??? oh my god she fuckin dead     ",
      "enemy": "8/10 enemy producer 1: whats better than 1 jake gyllenhaalenemy producer 2: 2 jake gyllenhaals?enemy producer 1: greg you are a fucking genius     ",
      "pokemon-detective-pikachu": " maybe pikachu will crack the case of Why In Gods Name is the director of shark tale still working in the industry     ",
      "johnny-english-reborn": "4/10 ironically rosamund pike and daniel kaluuya both asked for new Agents after this     ",
      "wine-country": "4/10 a fine addition to the \"amy poehler falling down steep hills\" multimedia universe     ",
      "tolkien-2019": "4/10 youre tolk-ien the piss right     ",
      "extremely-wicked-shockingly-evil-and-vile": "5/10 the war on attractive people starts now     ",
      "spf-18": "1/10 at this point im pretty sure keanu reeves just accepts to being in films to get him out the house     ",
      "no-country-for-old-men": "7/10 how many times do we have to teach you this lesson, old men     ",
      "avengers-endgame": " hayden christensen 🤝 thanos  retiring to live on a farm     ",
      "charlies-angels": "5/10    sam rockwell looks like such a nice guy even after the villain plot twist they really gave him red tinted glasses because even after declaring world domination he still looks like such a nice guy     ",
      "limitless": "6/10 me after landing the fuel meter exactly on £30     ",
      "hell-or-high-water": "6/10 ok girl were still gonna need a supercut of how many times a character depressingly sighs, puts on and straightens their cowboy hats     ",
      "homecoming-a-film-by-beyonce": "8/10 looking forward to beyonce: far from home     ",
      "annihilation": " early award season 2019 predictions alex garlands gonna come through with another masterpiece which is ignored and robbed by everyone  yes im still bitter     ",
      "batman-v-superman-dawn-of-justice": "3/10 batman: when i see lexcorp employees, i FLOOR it     ",
      "hellboy-2019": "2/10 pushing forward the conspiracy of ed skrein not leaving the project in 2017 over the whitewashing scandal, man has foreseeing powers and knows when to jump ship     ",
      "the-perfect-date-2019": "4/10 girls you dont need to pay noah centurian to be pretentious in an art gallery just get a tinder account in a city and hundreds of softboys will do it for free     ",
      "whiplash-2014": "10/10 everytime i consider learning the drums jk simmons walks into my house, breaks my chairs and calls me a whining weeping shitsack     ",
      "the-addams-family-2019": " yes i know were all distracted by how unattractive oscar isaacs character is but its directed by the guy that brought us shrek 2 lets not be too quick to judge     ",
      "rosemarys-baby": "9/10 fuck off rosemary im not going to your fucking baby shower     ",
      "dumbo-2019": "6/10 bold of disney to make a film where the villain circus' goal is buying smaller circus' to ever grow to their gigantic corporate machine. dont know where ive heard that before     ",
      "unicorn-store": "6/10 i briely liked it !     ",
      "step-brothers": "5/10 will ferrell is the kid john c reillys parents told the teacher cant sit next to their son because hes a bad influence     ",
      "joker-2019": " todd phillips cast joaquin as the joker specifically to make me look like a fool after laughing at everyone crushing on leto. maybe the society was in me all along     ",
      "widows-2018": "8/10 elizabeth debicki:me: you got a problem?elizabeth:              whatme: i mean, you so tall you MUST got a problemelizabeth: IM JUST SITTING HERE     ",
      "five-feet-apart": "4/10 to build further upon the \"cuz theyre not gay\" joke a few dozen have said i couldnt help but notice the header image includes a hot tub. someone did this on purpose and i will not rest until i find out who     ",
      "a-quiet-place-2018": "8/10 me in the cinema: *eats one piece of popcorn*the entire audience: THE FUCK YOU SO LOUD FOR     ",
      "get-out-2017": "9/10 hot fuzz: who are youget out: im you but stronger     ",
      "spring-breakers": "4/10 selena gomez: dont worry guys, i have a plan[selena gomez has left the game]     ",
      "the-lobster": "8/10 this is playing tonight on the main movie channel for valentines night and i recommended it to my work collegues and parents as a quirky romcom i cant wait for them to thank me!     ",
      "triple-frontier": "6/10 hollywood has taken The Chain - Fleetwood Mac hostage and wont let it go until we start to like ben affleck again     ",
      "inside-llewyn-davis": "8/10 cursed review id like to be inside llewyn davis     ",
      "the-front-runner": "4/10 jk simmons shouting over a jazz soundtrack should never be this boring     ",
      "green-book": "5/10 mrs obama ive done it, ive stopped racism  thank you tony lip, now i am free to roam this earth     ",
      "hereditary": "9/10 very bold of A24 to give an extended commercial for ancestry.co.uk a worldwide release. a studio taking risks!     ",
      "the-greatest-showman": "7/10 im conflicted my dudes, because this is a musical done right, but its a shame its taken the route of a biography/muscial.   while pt barnum was a real person, hes written different to benefit the tone of a musical. you could say this is the same as ed wood where the title character is portrayed far more cartoonish than ed wood really was, but in contrast to the greatest showman, ed wood still follows the lows and highs of the...     ",
      "skin-2018-1": "1/10 cant believe they made a short film from \"what tattoo you want\" \"literally just fuck me up fam\"     ",
      "the-hunger-games-mockingjay-part-1": "4/10 after i really enjoyed catching fire they decided to call the next installment mockingJay because the film serves as a direct personal insult to me for having faith in this series     ",
      "louder-than-bombs": "6/10 im so used to seeing jesse eisenberg with short often curly hair that anytime he goes into \"anything slightly long but not quite american ultra\" territory he just reminds me of danny devito wearing a toupee in always sunny     ",
      "hunt-for-the-wilderpeople": "8/10 20 minutes in: hey its basically Up (2009) without the emotional distress! fun!  1 hour in: oh no     ",
      "death-proof": "9/10 yo peter quills dad really was a dick     ",
      "juliet-naked": "6/10 the moral of the story is dont just say youd risk it all for ethan hawke you gotta ACT on it     ",
      "vox-lux": " i havent watched this but whoever changed the description to \"we live in a society\" please show your location i have some questions     ",
      "serenity-2019": "2/10 theres a reason matthew mcconaughey and anne hathaway work in interstellar but dont here in serenity and its because you have to put them in space as theyre too powerful a duo for earth     ",
      "skate-kitchen": "7/10 janay: hey come skating with usme, someone who has never skated once in their life: sure     ",
      "alita-battle-angel": "5/10 james cameron: we cant call a christoph waltz daisuke, whats another sci-fi name but doesnt sound like its from japanese literature  janitor interrupting the meeting with his dyson vacuum: where do you want me to clean sir?  james camerson: PERFECT     ",
      "velvet-buzzsaw": "4/10 dan gilroy: jake. play it subtle.jake: subtle yes.  jake 5 seconds later: NOW LET ME DESTROY YOUR GALLERY BULLshit BULLshit DERIVATIVE     ",
      "suspiria-2018": " and for the witches next trick, they will (hopefully) make that garbage poster disappear     ",
      "happy-death-day-2u": "6/10 tree: dies for the 394th time  the universe: its rewind time     ",
      "isnt-it-romantic-2019": "4/10 ill never forget the day adam devine walked onto set and announced he had killed love     ",
      "blade-runner-2049": "8/10 blade runner (1982) you aint my shit but thank you for being the first step in producing one of the best wide release movies of 2017     ",
      "a-cinderella-story": "3/10 the real magic of this story is how a high school chad transforms into an art college sadboy that puts ethan hawke to shame     ",
      "high-flying-bird": " android users:  steven soderbergh: iphones have better cameras tho :)     ",
      "wildlife-2018": "7/10 excited to hear jake gyllenhaal was playing another of his classic swingers, disappointed to learn he literally just plays golf     ",
      "polar-2019": "2/10 \"When a retiring assassin realizes that he is the target of a hit, he winds up back in the game going head to head with a gang of younger, ruthless killers.\"  ✅ I've watched this film before     ",
      "before-midnight": "8/10 me at ethan and julie as they fall out of love over romanticised nostalgia and refusal to accept change: your fantasies can never be quenched, can they     ",
      "se7en": "10/10 WOOOOOOO WHATTHE FUCK KEVIN SPACEY     ",
      "first-reformed": "8/10 ethan hawke. call it thirst reformed     ",
      "escape-room-2017": "2/10 yall dont understand how HARD it is finding the wikipedia page for this film considering there have been 3 films with the same title in the last 2 years like cant yall making saw rip-offs use a LITTLE originality     ",
      "conversations-with-a-killer-the-ted-bundy-tapes": " everyone finding ted bundy hot on twitter (?): oh we love a bad boy  me: yeah, not a fucking serial killer though, chris     ",
      "baby-driver": "9/10 edgar wright is solely responsible for the 6 car pile up i caused on the way home from the cinema     ",
      "hot-fuzz": "9/10 \"british people have no culture\"     ",
      "bohemian-rhapsody": "6/10 bryan singer: ok now freddie says \"formulas are boring!\" to queens label!  literally everyone on set: whos gonna tell him     ",
      "glass-2019": "5/10 lady gaga: if there were 100 people in the room-  m night shyamalan: this is a superhero movie set in the real world this has never been done before in the history of cinema     ",
      "at-eternitys-gate": "7/10 willem dafoe could literally slice his own ear off and the academy still would give best actor to a british actor that spent 10 hours in prosthetics to scream as a famous politician     ",
      "truth-or-dare-2018": "2/10 if you didnt think the writing could be that bad the demon really pulled the primary school shit \"i DARE you to tell a TRUTH\" after i asked for dare and laughed while i confess to farting in assembly  also in an earlier scene violett beane gets a dare to smash lucy hales hand up with a hammer and lucy hale without missing a beat gives up her hand but when lucy hale gets the dare to fuck violett beanes boyfriend that shes been cheating on anyway she storms out ????? moral of the story dont sacrifice your hand to FAKES     ",
      "the-favourite": " yorgos has moved on from colin farrell to make horrible histories: the motion picture     ",
      "mary-queen-of-scots-2018": " 2018 is the year of period bitches doing the absolute most     ",
      "holmes-watson": "1/10 is no one going to mention that the credited director is etan cohen which leads me to two conclusions. either this is an ethan coen imposter trying to tarnish his film making legacy or the real ethan cohen directed this trainwreck and desperately didnt want his name attached and thought removing the H would be enough to clown us     ",
      "dunkirk-2017": "8/10 whats that noise its me shitting meself everytime a bullet hits the side of tom hardys metal plane     ",
      "tag-2018": "6/10 jeremy renner isnt running from john hamm and hannibal burress hes actually running from his avengers and mission impossible contracts     ",
      "welcome-to-marwen": "3/10 steve carrell modeling his little dolls: do you think a depressed person could make this?     ",
      "black-mirror-bandersnatch": " charlie brooker really gave himself the ultimate safety net because if a critic says \"actually i didnt feel we had much control-\" he can play a reverse uno card and be like j̸̖̾u̷͚͐s̷͚̆t̸͖͂ ̶̧͛l̴͇͌i̶̟̕k̵̽͜e̷̛͕ ̴̬̔s̵̹̈o̵̜͝c̴̦͝i̷͕̕e̵͙͑t̷̻̅ý̷͓     ",
      "bird-box": "6/10 blind people thriving in this apocalypse environment be like: How The Turntables     ",
      "raiders-of-the-lost-ark": "9/10 indiana jones is the headline of the man who was stabbed in the chest and didnt call the hospital because he didnt want to bother anyone     ",
      "the-grand-budapest-hotel": "8/10    willem dafoe: this bitch empty  jeff goldblum: thats my cat-  willem dafoe: yₑₑₑT     ",
      "john-mulaney-new-in-town": " 2012 john mulaney: oceans 11 wouldnt work with women!  2018: [THE GANG MAKES OCEANS 11 WITH WOMEN]     ",
      "aquaman-2018": "4/10 the concept i tweeted 2 years ago came true this really is james wan smacking warner bros executives out the editing suite with a broom james is like \"this location transition is only 15 seconds long, lets add some soft ethereal synth samples to help connote the transition of time passing-\" while a warner bros exec does a line of cocaine spins a roulette wheel and shouts \"PITBULL REMIXING TOTO\"     ",
      "happy-death-day": "4/10 edge of tomorrow: can i copy your homework?  groundhog day: sure but dont make it too obvious  happy death day: *ctrl+c ctrl+v*     ",
      "roma-2018": "9/10 alfonso cuaron before writing roma: i guess i support mens rights  alfonso cuaron 2 pages into writing: mens rights to shut the fuck up!     ",
      "first-man": " ryan goosling and damien gazelle bout to expose the moon landing as the one big hoax it is     ",
      "design-1969": " Aight this isn't a shitpost you'd usually expect from me (you can tell bc I'm using punctuation!). If you've followed me here for a while on Instagram you'd probably know I'm a graphic designer with a passion for film posters which I do in my spare time. In early September I entered a competition ran by the UK Film Distribution Agency to create a mock poster for a pre-released film and last week it was revealed I won which is...     ",
      "it-follows": "8/10 \"For 19-year-old Jay, fall should be about school, boys and weekends out at the lake. \" each 19 year old jay to their own i Guess.....? some 19 year old jays long to be followed by a supernatural entity     ",
      "mid90s": " jonah hill: *puts on glasses*  the academy: ah yes, the critcally acclaimed artisté jonah hill, please sit with us while we discuss and critique filmé  jonah hill: *removes glasses*  the academy: oh god no, its comedy actor jonah hill asking for his supporting actor oscar for 21 jump street. go back to riding off the success of superbad, you disgust me     ",
      "the-house-that-jack-built-2018": " if one more of you sadistic directors films a kid dismembering a bird im calling the rscpa     ",
      "scooby-doo-2-monsters-unleashed": "3/10 it scooby dooby doo be like that sometimes     ",
      "the-twilight-saga-new-moon": "3/10 thom yorke only scored suspiria to try to make us forget his soundtrack credit on twilight new moon and lets be real , no one is ever forgetting that     ",
      "creed-ii": "7/10 Creed 3: Adonis fights Ksi and the Paul brothers     ",
      "searching-2018": "8/10 baloney fudge and mustard! my life is being ruined by the internet!     ",
      "the-princess-switch": "2/10 honestly? up there with double armie hammer in the social network     ",
      "maze-runner-the-death-cure": "6/10 we only gave mid-2010 young adult sci-fi so much shit because we were unaware of the damage jk rowling would cause     ",
      "fantastic-beasts-the-crimes-of-grindelwald": " eddie redmayne doesnt actually speak his lines he just breathes them out ˡᶦᵏᵉ ᵗʰᶦˢ ᵘʰʰʰʰᵈᵘᵐᵇˡᵉᵇᵒʳᵉ ᶦ ᵈᵒⁿᵗ ᵈᵒ ˢᶦᵈᵉˢ     ",
      "logan-2017": "9/10 Producer #1: how to we make the film betterProducer #2: two hugh jackmans?Producer #1: dave youre a fucking genius     ",
      "tangerine": "7/10 sean baker: i shot this critcally acclaimed film on 3 iphones its a great accomplishment of modern cinema  sean bakers grandma probably: ...you always on that damn phone     ",
      "the-grinch": "4/10 Pharrell Williams staggers out of the narration booth, gasping for a drink. \"Please, I can't do this anymore, let my wife and kids go...\"  Illumination Entertainment at first decline the musician's requests, however looking at Pharrell's shriveled vocal cords, maybe it was time for some fresh meat.  The studio's eyes turn green with small dollar signs. \"Draw up contracts for Tyler the Creator and Brockhampton\". Pharrell is dragged away, weeping, yet thankful he no longer has to produce 8 soundtracks in a week.     ",
      "a-star-is-born-2018": " why are gaga stans and queen stans fighting over which will be the best musical drama when we all know the biopic with michael shannon as elvis presley is the supreme     ",
      "the-nutcracker-and-the-four-realms": "3/10 its official were renaming no nut november to no nutcracker november because this really wasnt all that     ",
      "ready-player-one": "6/10 tye \"no one cared who i was til i put on the mask\" sheridan     ",
      "tully-2018": "7/10 charlize theron in her most emotionally demanding and draining role since survivng a post apocalyptic wasteland; being a Mother     ",
      "machete-kills": "3/10 lady gaga after accepting her oscar for a star is born: its such an honour to be awarded this for my first acting role!  interviewer: were you not in machete kills?  gaga:  interviewer:  [gaga signals security and the interviewer is dragged away]  gaga: anyway, im so grateful-     ",
      "the-witch-2015": "8/10 sometimes i remember this is a directors first movie and that modern horror isnt a complete shitfest  then i remember unfriended 2 is happening  fuck me     ",
      "ben-is-back": " lucas hedges isnt just aiming for the oscar hes aiming for all 5 nomination slots     ",
      "halloween-2018": " michael myers is the epitome of \"im a bad bitch you cant kill me\"     ",
      "oldboy-2013": "2/10 one star for you only, rami malek     ",
      "monsters-vs-aliens": "4/10 yall ever think about how many of our world leaders would be capable of playing axel f on a yamaha should aliens ever decide to invade? bet theresa may cant even play a keyboard, were fucked     ",
      "manchester-by-the-sea": "8/10 you ever only cry once a day to flex on lucas hedges     ",
      "the-amazing-spider-man-2": "4/10 gwen stacey snapped     ",
      "billionaire-boys-club-2018": " not to get edgy for a second, but considering the title and a certain cast member, im surprised this wasnt christopher plummered     ",
      "harry-potter-and-the-half-blood-prince": "6/10    dumbledore: dont worry guys, i have a plan[dumbledore has left the game]     ",
      "halloween-ii": "4/10    academy award winner octavia spencer: *dies after 10 seconds of screentime*me: and that is my cue to leave     ",
      "bad-times-at-the-el-royale": "7/10 drew goddard: 3 tablespoons of non-linear story telling  a splash of one way mirrors  and just a dash of chris hemsworth shirtless [proceeds to pour the entire glass in on purpose, overpowering the rest of the ingredients] nice     ",
      "halloween-1978": "10/10 jamie lee curtis: AAAAAAAAH  michael myers, walking as slow as possible after her: why ah you running?     ",
      "avengers-infinity-war": " you know in primary school when if one kid acted like a little shit they kept the whole class behind and the teacher was like \"none of you are going to lunch until we get to the bottom of this\"? thats the only way were finding out who the asshole is. this is a case for the fbi     ",
      "a-grand-day-out": " bold of damien chazelle to rip off wallace and gromit but okay     ",
      "apostle-2018": "7/10 hey hey thank fuck organised religious cults are only in fiction ha ha right *sweats*     ",
      "grease": "6/10    my mum: what ruins grease is the car flying in the climax  me: what really ruins grease is sandy submitting into what a boring big bird looking jock finds attractive after he treats her like dirt to look cool in front of his wet wipe friends     ",
      "venom-2018": " imma be real with you chief with the amount of comic book movies that get announced but never materialise im shocked this was even made but hey, im down with tom hardy tentacle porn     ",
      "unfriended-dark-web": " people who have seen this, does jake paul die, if yes, is it worth the ticket cost?     ",
      "johnny-english-strikes-again": "4/10 one day, johnny english walked out the mi7 headquarters. outside he saw a poor kid playing with a toy gun, johnny gave him his pistol and said \"kid, youll grow up to be someone very important.\"  that kid grew up to be james bond     ",
      "the-hateful-eight": "8/10 i do question why all of tarantulas films have to end in brutual explicit violence but ITS SO MUCH FUN, JAN     ",
      "hold-the-dark": "6/10 everytime jeremy saulnier wants to direct a new feature i like to think he throws darts at a globe and roles a dice to decide which group of people he wants to get revenge on next and where  \"so in my next feature we will be brutally murdering *rolls dice* furries in *spins globe* alaska\"     ",
      "what-we-do-in-the-shadows": "8/10 spaghetti? basghettidead? delicioushotel? triviago     ",
      "terminator-salvation": "3/10 @ hollywood please free sam worthington. he was the biggest star of 2009 and we havent seen him in 7 years. you cant keep someone locked in a studio for that long not letting him out without making 9 avatar sequels its illegal     ",
      "how-to-talk-to-girls-at-parties": "5/10 did i accidentally click on a montage of 2016 fandom edits with the 20 different transitions in 6 seconds and a garbage taylor swift remix' because i honestly cant tell the difference     ",
      "life-itself-2018": "2/10 surprised to see oscar isaac hit his expiry date so early     ",
      "the-predator": " if i see any of you thirsting over the predator...     ",
      "mary-poppins-returns": " me: i think im finally off my mamma mia bullshit  colin firth, julie walters and meryl streep starring in another musical:  me: surprise bitch thought youd seen the last of me?     ",
      "the-help": "8/10 letterboxd reviews: UGH WIG !!!emma stone: *sweating*     ",
      "mother-2017": " so if the rumours are true  a good jennifer lawrence movie exists     ",
      "slice-2018": "3/10 well this was a pizza shit lmao post review     ",
      "justice-league": " another borderline watchable dceu movie according to the star graph?  pretends to be shocked     ",
      "the-conjuring-2": "6/10 the neighbours while the house was literally being torn apart by the spirit world while 8 people screamed in terror: yall hear sum'n?     ",
      "sierra-burgess-is-a-loser": "4/10 noah centurian is the product of a young adult romcom actor that was born too late for camp rock but gained fame at just the right time to swerve the riverdale influx     ",
      "inside-2007": "7/10 mother! if jennifer lawrence was THAT bitch     ",
      "the-nun-2018": " everyones missing vera farmiga in a conjuring movie so much tmdb went ahead and put her in the header image anyway, she may not be in the film but shes in our hearts     ",
      "shark-tale": "4/10 gay vegetarian lenny the shark was a character ahead of his time     ",
      "tooth-fairy-2010": "2/10 the rock creeping into rooms to steal teeth and replace it with a dollar     ",
      "raw-2016": "9/10 did anyone try the finger? i thought the finger was lovely     ",
      "sharp-objects": " amy adams: if the academy wont appreciate me, the emmys will     ",
      "stuart-little": " \"you ever think how sick it is that mr and mrs little out of all the children at the orphanage chose a mouse with a lifespan of approx 3 years? a fucking mouse. did it ever cross the parents minds how shit it made some of those orphans feel\" - ella     ",
      "night-at-the-museum": "6/10 all those museum waxworks coming to life yet the most unrealistic thing in the movie is ben stiller working a night shift and researching during the day time when im barely functional after 7 hours sleep     ",
      "sky-high-2005": " agent: kurt youve been offered a role in a new superhero movie  kurt russell: is it sky high 2  agent: no its guardians--  kurt: you can keep it     ",
      "slender-man": " bit late to be honest, the only white man with tentacles ill be watching this october is tom hardy sorry     ",
      "one-direction-this-is-us": " martin scorsese creatively was in a bad place during late 2012, but was lucky enough to appear in this landmark of documentary filmmaking in 2013, some rumours say it later inspired him to make the award sweeping wolf of wall street. one direction really connect with everyone     ",
      "the-hobbit-the-desolation-of-smaug": "7/10 gandalf takes up most of the space on the poster yet all he does is straight up dip from the quest unannounced just before the forest because he doesnt fuck with giant spiders. even in middle earth ian mckellan gives us relatable content     ",
      "sicario-day-of-the-soldado": "4/10 Feel like pure shit just want him (denis villeneuve) back x     ",
      "the-darkest-minds": " this looks like so much of a dumpster fire amandla is already i-dont-feel-so-gooding out of the film     ",
      "tusk-2014": "3/10 reverse the shape of water     ",
      "mission-impossible-ghost-protocol": "7/10 brandt: ethan, i need you to take out the driver 3 cars ahead, you may need to ditch the carethan: its cool, ill put it in CRUISE controlbrandt:ethan:brandt:ethan: fine ill pull over     ",
      "mission-impossible-rogue-nation": "7/10 Millennials HATE HIM! This 56 year old man can catch up to a moving plane and hang onto it's wing while it takes off and I'm sat at my desk with BACK PAINS! Learn The Truth Here >>>>     ",
      "boy-erased": " if were giving lady bird characters spin offs, im curious to see the kyle scheible movie where he uncovers government conspiracies and disrespects women     ",
      "mamma-mia": "6/10 WHEN COLIN FIRTH GETS SHOT IN THE EYE     ",
      "the-guernsey-literary-potato-peel-pie-society": "5/10 most of this movie was shot in a neighbouring village 5 minutes from me and i can confirm the film really encapsulates how boring life is in the south west     ",
      "the-book-of-henry": "2/10 colin treverrow didnt leave star wars episode ix over creative differences kathleen kennedy just saw the book of henry and started steaming from her ears     ",
      "mission-impossible": "6/10 if only i could tear off my cgi mask only to reveal i was tom cruise the whole time     ",
      "the-strange-thing-about-the-johnsons": "6/10 imagine youre dating ari aster and he says \"i want to start a family with you\" after seeing this and hereditary you know id bolt the fuck out of the front door before the paimon possesses my unborn children     ",
      "daredevil": "3/10 ben affleck: this is so sad, alexa play despa--  ً﻿  alexa: Ş̸̡̖̦̫͉̯̤̄̆͋͗̎̅̔͘͜͜͠ͅḨ̵̮̲̭̟̳̫͚̇̈́͑͘Ǘ̷͓̣̺̪̝̣̞̻̹̊͗͘ͅF̸̼̦͠F̸̩̙͉̼̮̃͆L̷̙̲̮̦̘̥̺̳̟̞̘͙̈́̎̏ͅI̴͎̐̃̎̄̎̔̎͊͛͑͂͋̔̔̚Ṋ̸͙̘̟͖̖̮̮̇̓̉̅͋̃͑̈́͆̂͘ͅG̵̡̡̨̗͇͚̟̲̣̜͑̔̐̎͐͑̓̈́̌̍͝͠ ̷͖̯̲̪̥͎̙̲̥͇͔̖͑̃̃̈́̅̇͌̋̀̒̄̚͝S̶̼͕̘͑͊͋̾Ǫ̴̠͔̗̫̎̈́̋̕N̴̛̖͎͈̝̋̎̔̓͌͂̀̎͝͝͝G̸̨̬̮͓̐̓͌̄̽͋̉̈́͂́̓̚͝ͅS̵̩̱̳͉̀̿̃̔̑ ̶̧̞̻̦̝͎̪͍̩͈͈̪̦͎̠̉͛͐̈̀͐́͂Ḃ̸̪̠̺͓͖͍̰̤̭̮̭͕͙̼͓̀̀̓̓͝͠Ý̴̡̡͓͕̝͎̪̙̭̙̤̝͚̬̿͌̓̒̑ ̴̯̣̥̫̈͠Ē̷̡͔̝̯͚̘͎̦̻͊̄̌̈́́͗̊̏̐́V̴̨̢̗̖̯̥͍̣̠̦̬̺͑̉͐̈̌̈́͋̓̍͆̆͗͌̓͜ͅȂ̵̧̰̞͙̦͓͒͆̎̽̐͐̇͝N̸̢͕̫̦̼̪͎͕̍͐͜Ḙ̶̺͉̪͈̜̟̩͑̄͗̇̔̈́̽̋͘͘̚͝ͅŞ̷̲͖̉̎̕͘ͅC̴͕͔̦͈̖̜̬̟͙̻̺̫͛̃͌̌̅̕Ȩ̴̩̂̿͆̽͊̾̓͋̔͘N̸̛̥͔͖̮͗̉̋́̃̈́C̵͉̖̜̭͙̤̗͉̖̊̊̈̍̃̕͘̕͝E̴̢̧͈̯̣̎͛̓̒  ً﻿  ben affleck: wha-  ً﻿  alexa: W̸̟̳̬̬̘̘̎Ä̵̟̪́̓̐̿͜ͅK̵̪̭̘̯͈͕̼̻̟̹͖͐̏͒̐͂͛͠E̴͇͇̮͕͈̘̜̝̥̪̠͌͊̊̉̆̅̐́̀̿̽͑̌͝ͅͅ ̶̙̬͖͍̥̥͙̟̼̯̝̏̀͒̈́͒̎͒͛̒͜M̸̨̖͔̞̈́͑͌̐̆̈̓͋̑͘E̴̞̗̐̇̋̋͊͂͒̋̒̏͋̋ ̸̧̰͖̹̋́̿̎̽̀͝Ű̶̲̖̗̺̈̆P̷̧̹͇͈̬͍͉͎̟̾̍̄͗̋̑͑̀̓̂̐͜ ̷̢̡̡͕͕̦̗̱̣̭̱̝̮̼̊̊͐̑͋͂Ỉ̷̠̰̫̺͙̗̹̻͚̠̮͓̫̊̈́̉͌͒̐̎́̏̀̇͝Ṋ̸̛̖̱͈͚̉͒͋̏͂͋̇̿̔̓̑͝͝ͅŠ̷̨̧̨͖̳̙̰̠̼͉̾̎͒ͅȈ̴̡̮͎͎̰̫̞͉̲͕̯̣̺̽̑̿̈̽̂͌̊̑͘D̷̫̤̪̹̦͈͒͐̏É̸̛̼̥̏̈́     ",
      "halloween-the-curse-of-michael-myers": "3/10 if your 2018 halloween sequel doesnt include paul rudd, you can keep it     ",
      "lean-on-pete": "7/10 bojack putting in the WORK this year, theres no chance bread poot can snubb him at the next oscars     ",
      "the-karate-kid-2010": "4/10 mum: honey quick! the babies kicking!unborn karate kid: *roundhouse kicks his dad and straight up floors him*dad, bleeding from his nose: hes gonna be such a little fighter     ",
      "tau-2018": "5/10 does ed skrein only accept roles if he gets to perform sci-fi experiments on someone strapped to an operating table     ",
      "beautiful-boy-2018": " amazon studios have recognised my 2 weaknesses • a focus on a soft father/son relationship • michael scotts struggle for happiness     ",
      "brokeback-mountain": "8/10 according the worlds leading food critics, the best thing to put ranch dressing on is jake gyllenhaal     ",
      "it-2017": "7/10 PENNYWISE GOT SOME FUCKIN MOOOVES     ",
      "the-cabin-in-the-woods": "6/10 further proof chris hemsworth is on the jock spectrum     ",
      "78-52": "7/10 it took alfred hitchcock 52 cuts to create the iconic shower scene but it took tobey mcguire 156 takes to catch the lunch tray in spider-man (2002) whos the real hero of cinema     ",
      "solo-a-star-wars-story": " lord and millar had a scene with han and lando fucking and thats what kathleen kennedy calls \"creative differences\"     ",
      "three-billboards-outside-ebbing-missouri": " me and my one movie going friend have planned to go into a city and watch this and ive been looking forward it to weeks but after hearing a certain line (especially in context with the shit in hollywood today) im ..... on edge  also i was thinking of reactivating my twitter but award season twitter is the worst so see yall in march     ",
      "bumblebee": " an aging member of a team of heroes running from the government goes into hiding, finds a teenage girl that emotionally repairs him and gives him a reason to live and fight again? *checks ive seen this before*     ",
      "jurassic-world-fallen-kingdom": "5/10 hi guys it's jeff goldblum here :) sorry i was gone for a few days i was kidnapped by universal and forced to star in fallen kingdom (im fine so dont worry) so yeah :/     ",
      "marjorie-prime": "6/10 the poster dont feel so good...     ",
      "the-green-mile": "8/10 tom hanks 2nd best performance after his work in carly rae jepsens i really like you music video     ",
      "jason-x": "1/10 jokes on the writers thinking every teenager in 400 years would be heterosexual     ",
      "spain-1939": " ive reached it for a while but thank you all so much for 1000 followers, i deadass thot my peak was like 400 so thank you for putting up with my bullshitim going barcelona for the week (and seeing haim + tyler nice) ill likely be inactive for most of the time, hope you all have a good week ! <3     ",
      "the-sisters-brothers": " seeing jake gyllenhaal in cowboy attire again is queerbait     ",
      "fahrenheit-451-2018": "4/10 after blade runner 2049 flopped denis villeneuve cursed us to a year of hollywood producing dystopian movies that have a discount version of the br2049 aesthetic but literally nothing else     ",
      "harry-potter-and-the-philosophers-stone": "6/10 *fluffy wakes up*harry: GET YOUR DOG BITCHhagrid: it dont biteharry: YES IT DO G-     ",
      "the-beguiled-2017": "6/10 can i have 5 more of these little blonde bitches?: a motion picture     ",
      "terminal-2018": " ive already been let down by 1 \"margot robbie killing people in ultra-stylized neon\" film, hollywood, you cant fool me again     ",
      "revenge-2017": "7/10 who KNEW you could write a satisfying rape-revenge flick without forcing the viewer through 75 minutes of torture first. i spit on your grave clearly didnt!     ",
      "thor-the-dark-world": "4/10 kevin feige: our dear friend lady sif has passed away  lady sif: stop acting like im dead  kevin feige: sometimes we still hear her voice     ",
      "foxcatcher": "6/10 i really tried to take this seriously but for the past month ive been binging the office and for the whole time i thought john du pont was a wacky character michael scott was playing     ",
      "the-strangers-prey-at-night": "5/10 ☑ neon lighting☑ synth score☒ ryan gosling  conclusion: if youre gonna have that much neon and synth why not throw in ryan gosling     ",
      "anon": "3/10 i have reason to believe the entire reason this film came into existence was the director had a garage full of the wigs amanda seyfried wore in in time     ",
      "dirty-computer": " the letterboxd admins better update the edited description on this as quick as they updated that phantom thread one. its shocking a description can be edited to that     ",
      "captain-america-civil-war": "6/10    avengers 4 best have a plan for hawkman because right now i cant see a reason to why he wasnt bumped off early here     ",
      "the-mist": "8/10 frank darabont is an highly underrated director who has 3 fantastic films under his belt, the first and best season of the walking dead and hollywood needs to stop pretending hes dead  c h a n g e m y m i n d     ",
      "ant-man": "5/10 the only other thing ive seen paul rudd in is celery man and needless to say this was a serious downgrade to celery man     ",
      "the-last-vampire-on-earth": " The true feeling of watching a B-movie can only be obtained after giving it ½ a star rating on IMDb, Letterboxd, and still feeling unsatisfied. You can't, you won't give it higher because you religiously stick to your rating scheme rules like the pretentious fuck you are, but you can't help but know you've had a far better time watching this than anything from [insert critically acclaimed director to spark controversy]. Maybe that's just me and the fake film buff persona that my existence revolves around.  Read more of me trying to put my shitty opinions into poorly written thinkpieces. I'll stick to shitposting.     ",
      "the-bad-batch": "5/10 im a bad batch you cant kill me     ",
      "white-chicks": "6/10 the intertwining plotlines?white people saying the n word?unlikable male characters?sounds like the perfect tarantino film to me  on god when will you all realise this is a joke     ",
      "what-women-want": "2/10 this must be set in an alternate reality because in this world women dont want mel gibson     ",
      "house-of-1000-corpses": "6/10    dwight from the office is sown onto the body of a fish at one point at the entire scene i was hoping it was another one of jims elaborate pranks     ",
      "joseph-and-the-amazing-technicolor-dreamcoat": " i have war flashbacks everytime this poster shows up on letterboxd because this was our year 6 school production and i was cast a white egyptian pharaoh  your problematic fav? its me     ",
      "gifted-2017": "6/10 this was cute watching a superhero actor take the role of a soft father but do i really need it when i can watch Logan (2017) instead     ",
      "cats-dogs-the-revenge-of-kitty-galore": "1/10 legend has it this heavily inspired wes anderson while drafting the first script for isle of dogs     ",
      "would-you-rather": "4/10 so this is what rich people be doing when theyre not buying get out of jail free cards and finding other ways to dodge tax     ",
      "the-silent-child": "6/10 An ambiguous imagining of the Matilda story. I feel this would have accomplished its task better of promoting the normalization of sign language by being a documentary with dramatised segments, which may have excused the exhausting looping soundtrack and bland camera work, but solid performances and strong morale tug at heart strings and give the short a lasting impression.     ",
      "pride-and-prejudice-and-zombies": "4/10 lily james starts the movie only wanting to fight and couldnt care less about men and she ends still fighting but caring a little about men  poor character development     ",
      "scooby-doo-meets-batman": " marvel calling infinity war is the biggest crossover event in history... kevin feige clearly hasnt seen this     ",
      "unsane": "7/10    at this point its safe to assume matt damon shows up on random movie sets unprompted asking for cameos and no one can get rid of him  please leave us alone matt     ",
      "seabiscuit": "6/10 i mean its ok but all i got out of this was context for bojack horseman season 2 and 3, the only horse ill ever care about     ",
      "pacific-rim": "6/10 i like to think this is guillermo del toro's money making scheme and he stole all the profits and funded the shape of water all by himself     ",
      "the-snowman-2017": "2/10 who hated this movie more me or thomas alfredson     ",
      "paranormal-activity-2": "4/10 ghosts banging pots and pans in the kitchen: I DIDNT GET NO SLEEP CUZ OF YALL. YALL NOT GONNA GET NO SLEEP CUZ OF ME     ",
      "the-thing-2011": "5/10 someone give mary elizabeth winstead a back massage it must have been hard carrying this movie     ",
      "the-void-2016": "5/10 script $200sound design $450camera work $800practical creature effects $153,600likeable characters $50  someone who is good at the economy please help me budget this. my family is dying     ",
      "the-cat-in-the-hat-2003": "2/10 the best wes anderson movie wes anderson never made     ",
      "ex-machina-2015": "9/10 Oscar Isaac saying he programmed the robot to be hetero. 2/10 unrealistic.     ",
      "irreplaceable-you": "5/10 gugu mbatha-raw needs to give her arms a rest after carrying netflix originals these past few months     ",
      "the-shape-of-water": "8/10 nothing but respect for MY aquaman     ",
      "thank-you": " i was going to save this until i got a bit further past 400 bc after posting this im gonna dip back into 399 but thank you so much for 400 followers <3 its been a pleasure talking with fellow cinephiles and have fun watching the oscars tonight  shameless promo:instagram - yajpegsc - jaay_bennett  (love you all but special thanks to avtan, issy, baby, trudie, andrea, hannah, elle driver, sami, con, jose, adrianbalboa, liamkelsall, kyra, nad, yazz, jeremy, alan, ally and sree for putting up with my shit reviews for an extra long time)     ",
      "the-open-house": "2/10 netflix: waste our subscribers time 2k18     ",
      "darkest-hour": "6/10 they left the intern to move the nominee lists and he tripped on the way and 'gary oldmans prosthetic chin' for hair and makeup got mixed up in the best actor category apparently?     ",
      "hanna": "6/10 what exactly makes tom hollander more hollander than tom holland save review     ",
      "ralph-breaks-the-internet": " ready player one has been found dead in miami     ",
      "dredd": "7/10 me spacing out one hour into the movie: does karl urban call his costume department his urban outfitters     ",
      "fantastic-beasts-and-where-to-find-them": "4/10 harry potter begs jk rowling to kill it. jk rowling refuses, keeping it alive.     ",
      "the-strangers": "2/10 my quest in life is to find out why the horror community love this film so much  it aint all that     ",
      "the-host-2013": "3/10 im so thankful we live in the reality that saoirse ronans career survived this hot hot mess she just needed to pay rent     ",
      "mute-2018": "2/10 me last year: netflix are giving filmmakers creative freedom to do what they want without boundries and its on its way to becoming the future of cinema  me now, after bright, paradox and mute: netflix original films is a garbage dump of stuff no one wants     ",
      "wolf-creek": "3/10 bonus points for a torture porn flick actually making an effort to introduce and spend time with our characters (the bar really is that low) but its been 50 out of 90 minutes and we just met our antagonist google search is time refundable  (real half assed review hours who tf up)     ",
      "black-panther": "7/10 cursed review what is it with marvel calling their most fuckable characters erik now everytime someone says they want erik to raw them i gotta ask which one     ",
      "batman-begins": "6/10 nolan to the concept artist for batman begins: i want monorails covering gotham city  nolan to the artist for the dark knight: so the monorails were a bad idea...     ",
      "this-means-war": "4/10 this exact predicament was solved in the opening 10 minutes of saw 3d and its both more enjoyable, equally less time consuming, and has a more satisfying conclusion     ",
      "bridget-joness-baby": "5/10 fuck off bridget, im not going to your fucking baby shower     ",
      "hellraiser-hellworld": "2/10 this tastes disgusting, but ill eat it for you twink henry cavill     ",
      "the-1517-to-paris": "2/10 at this point i think its safe to assume clint eastwood shares \"how many likes for our troops?!🇺🇸🇺🇸🤔👍\" posts on his facebook and bases all his movies off them     ",
      "in-time": "4/10 hes justin timeberlake     ",
      "when-we-first-met": "3/10 2014: what about groundhog day but sci-fiwarner bros: great idea!  2017: what about groundhog day but horrorblumhouse: nice!  2018: what about groundhog day but lovenetflix: ...2018: without the charm of about timenetflix: PERFECT     ",
      "the-thing": "10/10 cursed review 80s kurt russell could give me the thing     ",
      "inglourious-basterds": "9/10 wouldve been 5 stars if it wasnt for that hideous mike myers cameo     ",
      "hellraiser-judgment": "2/10 clive barker: so here i have a screenplay for a hellraiser remake--gary j tuncliff: what if se7en but with demons     ",
      "fifty-shades-freed": " i was flicking through reviews of this and a minute later i had a nosebleed that lasted 20 minutes. this film is cursed. i havent seen it yet i already have a reason to hate it     ",
      "circle-2015": "6/10    when the matt damon in suburbicon lookin homophobe says they should vote off the lesbian and everyone kills him instead is a big ass fuckin mood     ",
      "alien-covenant": "7/10 100 years into the future and white people have not stopped colonizing     ",
      "the-cloverfield-paradox": "5/10 netflix producers: \"this script wont sell, throw it on the repurposed cloverfield sequel pile in the back\"     ",
      "17-again": "5/10 when will this be confirmed canon in the high school musical extended cinematic universe. how you gonna give zac efron a basketball without letting him break into getcha head in the game     ",
      "moon": "8/10    which of you from film twitter is responsible for copy+pasting sam rockwell it was fuckin one of yas     ",
      "insidious-the-last-key": "5/10 this week on buzzfeed unsolved     ",
      "victor-crowley": "3/10 almost all of this take place in a crashed plane lit in neon red is this a closet nicolas winding refn film     ",
      "i-know-jake-gyllenhaal-is-going-to-fuck-my-girlfriend": " girl watching nightcrawler: wow hes kinda hot  straight male youtuber: [STORYTIME] MY GIRLFRIEND IS CHEATING ON ME WITH SOME D-LIST ACTOR?? [GONE SEXUAL]     ",
      "the-room": "2/10 TOP TEN ANIME BETRAYALS  seriously though playstation2 cut scenes feel more human than tommy wiseau     ",
      "a-ghost-story-2017": "9/10 friendboyfriendgirlfrienddepression  only depression never ends     ",
      "lincoln": "6/10 the truth is ive never seen anything with daniel day lewis nor seen him in real life and yall talk about him like hes a 80 year old veterern who somehow keeps coming back from the dead for an oscar and my first thoughts after seeing him at the globes? hes lowkey hot     ",
      "black-mirror-hang-the-dj": " this reminds me of is those supermarket-value copies of name brand foods and like yeah they save you £1.39 but if you want the premium flavour you want the name brand. yes you guessed it the name brand is San Junipero     ",
      "sharknado-2-the-second-one": "1/10 not to make my love of bad movies sound pretentious but the numero uno rule of so-good-theyre-bad-movies is the director must be completely delusional to what they are creating, people making a genuine effort to make something great and falling flat on their face, thats what makes your tommy wiseaus, your neil breens and your amir shervans. sharknado is self aware and tries to be a funny-bad movie from the first frame killing any humour i can get from it,...     ",
      "ingrid-goes-west": "7/10 ingrid goes west is the first film focusing on obsession in the internet age that does it right, where previous attempts have obviously been written by an out of touch adult, screenwriters matt spicer and david brandon capsulate the terrifying aspects of social media in a smart take on a stalker movie, a dark comedy which handles itself seriously when it needs to be.  its nice to see aubrey plaza make a role her own again as much as she...     ",
      "guardians-of-the-galaxy-vol-2": "8/10 ʸᵉᵃʰ ᶜᵃᶰ ᶦ ᵍᵉᵗ ᵘʰʰʰʰʰʰʰʰʰʰʰʰʰʰʰʰʰʰʰʰʰ MORE FATHER/CHILD RELATIONSHIP SUPERHERO MOVIES     ",
      "a-nightmare-on-elm-street": "8/10 call me a horror shill for giving this such a high rating all you want but as far as im concerned the only bad thing about this is that it kickstarted johnny depps career     ",
      "black-mirror-the-national-anthem": "    cant believe our ex prime minister, david cameron, actually fucked that pig     ",
      "black-mirror-uss-callister": " are we gonna keep acting like jesse plemons isnt a clone of matt damon? 2018 is the year of the truth     ",
      "elves": "2/10 \"i need to know the connection between the elves and the nazis!\" ah yes, that iconic christmas line     ",
      "elf": "5/10 id never watched this before now and honestly of all the christmas movies this is the one dory accounts and pop culture hype up the most? eh  the main drive of elf is a lot of fish out of water humour with a light anti-commercialism message however it remains fun through the first act, its a shame it runs out of steam after the store sequence     ",
      "krampus": "8/10 i know for a fact in a few years this will be every edgy kids favourite christmas film  i know this bc i am an edgy kid     ",
      "the-wolverine": "5/10 re-title this wolverine: gap year because this white girl spends his summer saving the wildlife and having irrelevant experiences in japan     ",
      "vile": "3/10 this has been a go to bad-horror-film-to-watch-while-i-fall-asleep for me for years now and i was curious to what the directors been up to, turns out he ended up making wind river, glow tf UP  (i dug taylor sheridans bullshit before it was cool)     ",
      "bright": "3/10 \"im making a suicide squad of directors and screenwriters\"  [viola davis flips open files to reveal david ayer and max landis]  \"the worst of the worst\"     ",
      "free-fire": "6/10 dont blink for 90 minutes i looked away from the film once and lost track of where every character was     ",
      "the-robbery": "6/10 throwback to the cinema tent at reading festival when the shopkeeper brought out the crossbow and the entire tent fucking lost it     ",
      "kingsman-the-golden-circle": "3/10    all im saying is if they can bring back colin firth from being shot in the eye then they can bring back sofia boutella and thats my tea for the day     ",
      "hostel-part-ii": "4/10 the tagline on letterboxd is \"americans, they have no imagination\" and i cant tell if thats a plot point reference or shade at eli roth. either way it works     ",
      "murder-on-the-orient-express-2017": "5/10    how do you expect me to care about the characters motivations to catch the murderer when its johnny depp that dies first     ",
      "the-disaster-artist": " my biggest complaint is not letting tommy wiseau play himself to add to the irony because hed be terrible at that too     ",
      "wonder-2017": "6/10 does stephen chbosky feed off the tears of emotional teenagers and dory accounts saying \"omg this trailer made me cry!! 😭😭😭\"     ",
      "dead-snow-2-red-vs-dead": "5/10 SURE YOU GOT THE DEAD PART BUT WHERE WAS THE SNOW  THERE WAS NO SNOW     ",
      "arrival-2016": "10/10 CinemaSins just came out with a 16 minute long video called everything wrong with Arrival which is confusing because there is nothing wrong with Arrival     ",
      "the-death-of-stalin": "7/10 While with minor story altering this could have been the perfect framework for a Tarantino movie (not to mention this feels like Russian Reservior Dogs), Armando Iannucci was the best man for the job with the witty tone they aimed for.   The biggest flaws I found were the two tones of polictal satire and the beginning scenes in Stalin's Russia pre-death clashing dramatically, the scenes of concert and the soviet army murdering civilians intercutting made for a tough time of...     ",
      "friday-the-13th-part-viii-jason-takes-manhattan": "3/10 For a movie called 'Jason Takes Manhattan' he sure spends barely any time actually in Manhattan     ",
      "dawn-of-the-dead-2004": "5/10 Realistically this isn't an awful remake and Zack Snyder and James Gunn make a pretty good team, the only difference between the theatrical and the directors cut I watched was Zack in person saying this version is his vision but the only change was an extra 2 minute long sex scene.     ",
      "reservoir-dogs": "8/10 Like most turantulatino films I'll watch them a 2nd time regardless due to the unlinear narative and because I enjoy this type of shit anyway, but while I understand this is Tortillatino's first movie, the long scenes he's perfected over the years lacked the intensity from his following 7 movies. That being said I found myself drawn to the screen beyond the 'Mr. Orange' title card and as meh as I was on the first half of the movie the...     ",
      "incredibles-2": " this is basically more proof disney pixar are kinda out of ideas but you know ill be fighting 12 year olds to see the best nostalgia trip im ever gonna watch     ",
      "return-to-oz": "6/10 you know what i love in my sequel to the happiest and most beloved musical of all time? misery     ",
      "rec-genesis": "4/10 \"its me, the childrens entertainer, sponge john\"  \"not spongebob?\"  \"well you see there was a copyright problem\"     ",
      "thor-ragnarok": "7/10 i put off writing this for a few days because the last 2 thor movies have been so forgettable i forgot the entire film almost immediately and so far that hasnt happened yet so there you go     ",
      "scary-or-die": "1/10 so this is what chad from high school musical is doing now huh     ",
      "the-shining": "10/10 i went to an 11pm showing of this at the cinema and half way through, spaced out, knowing i had work in 6 hours, realised jack nicholson back in the day couldve played a pretty good grinch who stole christmas     ",
      "the-divide": "5/10 so this is what 10 cloverfield lane borrowed inspiration from i would say ripped off but 10 cloverfield lane is so so much better     ",
      "the-conjuring": "5/10 look me dead in the eyes and tell me james wan doesnt have a puppet fetish     ",
      "boyhood": "3/10 Boyhood honestly is the best documentation of life because halfway through you really just want it to end. I appreciate the effort though.     ",
      "the-hills-have-eyes-2006": "4/10 i could review this but instead im going to take a shower because thats what the movie made me want to do more than anything     ",
      "leatherface": "3/10 oh boy another origin story no one asked for  full review: goo.gl/eKpchs     ",
      "psycho": "9/10    marion: im taking a showernorman: without me? ;) :P xx     ",
      "the-evil-dead": "8/10 80s bruce campbell call it the evil dad     ",
      "deathgasm": "4/10 just makes me think how fucked wed be if the chosen saviors of the demon apocalypse were teenage bring me the horizon stans     ",
      "it-1990": "5/10 pennywise showing up to get the adults when they think its gone is a metaphor for my depression     ",
      "x-men-apocalypse": "5/10 does moira mactaggert have a point in these movies other than to show charles xavier might not be gay because you cant fool me     ",
      "the-dark-tower": "4/10 SO WHERES MY FANTASY REALM WHERE IDRIS ELBA IS MY DAD     ",
      "mad-max-2": "9/10 the road warrior: who are youfury road: im you but very slightly stronger     ",
      "death-wish-2018": " as long as this is as nonsensical, hilarious, insane and needlessly violent as the original 5 b-movies, then i am 100% fine with this     ",
      "13-sins": "5/10 when i say how dumb character motivations can take you immediately out the movie, the final scene of this is my villain origin story     ",
      "i-spit-on-your-grave-iii-vengeance-is-mine": "3/10 probably someone in the theatre after watching this: BUT NOT ALL MEN-     ",
      "nerve-2016": "4/10 Listen I'm here for thriller stories about playing for money/your life but literally every single thing annoyed me in this movie. Watch 13: Game of Death or 13 Sins instead.     ",
      "youre-next": "8/10 WE WERE ROOTING FOR YOU, ADAM WINGARD. WE WERE ALL ROOTING FOR YOU.     ",
      "death-note-2017": "1/10 • cant believe a discount final destination exists  • heres to peoples careers ending clink clink bitch  • adam wingard having the biggest downgrade in director history, youre next showed so much hope     ",
      "cabin-fever": "6/10 im never drinking water again in my entire life     ",
      "the-belko-experiment": "4/10 *james gunn writing a movie* but how can put my pal michael rooker in this     ",
      "aliens": "10/10 james cameron: i want to copy alien beat for beathollywood suits: ...james cameron: with gunshollywood suits and me: [THUNDEROUS APPLAUSE]     ",
      "atomic-blonde": "7/10 its comforting to know, be it past or future, charlize theron would happily kick me and other men in the jaw     ",
      "the-devils-rejects": "8/10 i already showered once today and this watching this made me want to shower again     ",
      "31-2016": "3/10 every rob zombie film it gets more and more apparent why sheri moon zombie doesnt get acting work outside her husbands movies  aside from that i watched this at 2am and the shakey camera work made me sick     ",
      "martyrs-2015": "1/10 did i watch this in 4D because it really did feel like torture watching this tragic american remake     ",
      "the-circle-2017": "3/10 friend i watched this with: remember the scene with the kayaks?me, spacing out: w h i c h o n e     ",
      "the-hobbit-an-unexpected-journey": "5/10 so is this technically a musical     ",
      "texas-chainsaw-3d": "2/10 leatherface throwing his chainsaw: this bitch empty. YEET     ",
      "the-lady-in-the-van": "5/10 i predicted the gay plot twist as soon as the guy sighed at his neighbour asking when hes finding a wife     ",
      "gods-not-dead": "1/10 youre right gods not dead viola davis is alive and well     ",
      "spider-man-homecoming": "8/10 i hate people over 25 playing high school students but i am 100% ok with laura harrier she can play who she wants     ",
      "chicken-run": "8/10 when it comes to vegan propaganda okja aint got shit on this     ",
      "sorority-row": "4/10 carrie fisher cocking a shotgun, saying \"lie again bitch\" and hunting down the killer herself saved this movie     ",
      "sausage-party": "1/10 yall: this movie made me veganme: this movie makes me never want to consume any food ever again i want to starve     ",
      "blair-witch": "3/10 so nice of ann coulter to cameo as the blair witch     ",
      "transformers-the-last-knight": "2/10 i havent seen this nor intend to see it however my sixth sense is telling me its a steaming pile of shit     ",
      "four-lions": "8/10 blow yersel up tae fuck     ",
      "hobo-with-a-shotgun": "6/10 batman? WACKdaredevil? WACKpunisher? WACKhobo with a shotgun? HES TIGHT AS FUCK     ",
      "the-neon-demon": "3/10 damn bitch yall (the 15k people who gave this 3★s or higher) live like this?     ",
      "tucker-and-dale-vs-evil": "7/10 give me 1 (one) heterosexual explination for how often dale thinks about tucker     ",
      "life-2017": "5/10 scariest thing in the movie was jake gyllenhaals jawline. i miss his fluffy dad beard     ",
      "the-mummy-2017": "4/10 if sofia boutella wanted to destroy humanity id be like same tf and greet her with open arms     ",
      "rogue-one-a-star-wars-story": "7/10    new drinking game everytime a character in rogue one dies keep drinking to numb the pain     ",
      "the-babadook": "7/10 happy pride month yall     ",
      "splinter-2008": "2/10 if im honest i watched about 40 minutes of this before skimming through the rest, but im sure i didnt miss out on much     ",
      "wz": "3/10 \"is that tom hardy? oh my god its tom hardy\"     ",
      "the-prestige": "8/10    logan 2017: how about multiple hugh jackmans thats never been done beforethe prestige 2006: *loud coughing*     ",
      "trainwreck": "1/10 the title wrote the review for me thanks for saving the effort     ",
      "x-men-days-of-future-past": "7/10 im sad this is the last film we will see the original professor x and magneto together, i want to see patrick stewart and ian mckellan have clear homosexual tension one last time     ",
      "rings-2017": "1/10 im going to put in as much effort into this review as the writers put into the script    this was fucking awful     ",
      "fantastic-four-rise-of-the-silver-surfer": "2/10 2 stars for captain raymond holt-1 star for lack of jake peralta     ",
      "funny-games-2007": "7/10    for a film in which every kill takes place off screen its had more effect on me than ones with on screen gore     ",
      "pirates-of-the-caribbean-dead-men-tell-no-tales": "2/10 my sixth sense is knowing this movie is painfully 'meh/bad' for how many millions was spent on it without actually watching it     ",
      "alien-3": "3/10 call me david fincher because i too have decided to forget this film ever happened     ",
      "alien": "10/10 snatched my sigourney weave     ",
      "the-promise-2016-1": "4/10 this is the straightest incarnation of oscar isaac ive ever seen. i never want to watch this again     ",
      "silence": "6/10 They aint kidding when they call it Silence because it was so quiet I could hear Rogue One playing on the screen nextdoor     ",
      "suicide-squad-2016": "1/10 Suicide Squad lives up to its name because as the title suggests it made me want to drink bleach.     ",
      "catwoman": "2/10 catwomans origin story was being burped in the face by a cat every adaptation of catwoman since then is INCORRECT     ",
      "mad-max-fury-road": "10/10 partner at our wedding: isnt this the best day of your lifeme, thinking of the day i saw fury road in black and white at the cinema: its up there     ",
      "carol-2015": "10/10 HAROLD     ",
      "the-fate-of-the-furious": "4/10 who is responsible for the puns they put in the titles every damn time bc i swear theyre better written than the script     ",
      "movie-43": "1/10 starring academy award winner emma stone     ",
      "pan-2015": "3/10 the only good part of this movie was hugh jackman singing nirvana's smells like teen spirit     ",
      "power-rangers": "4/10 this movie was,,not great but id rather you all went and supported a diverse cast than giving money to the ghost in the shell fanfilm     ",
      "prince-of-persia-the-sands-of-time": "1/10 oh jake baby what is you doing     ",
      "the-killing-room": "3/10 \"smells like government\" - wolverine     ",
      "fermats-room": "6/10 think of the trash compactor scene from a new hope. the movies that scene but 90 minutes long     ",
      "robocop-2014": "2/10 MOOD: SAM L JACKSON GETTING PAID TO SAY 'ROBO-PHOBIC'     ",
      "lucy-2014": "2/10    i wished i lived in a world where after a load of bullshit scarlett johanson just turned into a usb drive     ",
      "beauty-and-the-beast-2017": "4/10 good rep for the furry community     ",
      "amy-schumer-the-leather-special": "1/10 my sixth sense is being able to know this is awful without even watching it     ",
      "moonlight-2016": "10/10 Best picture or the Academy is wrong     ",
      "the-hitcher-2007": "3/10 sean bean coming back for the teenagers every 5 minutes is a metaphor for my depression     ",
      "star-trek-into-darkness": "4/10 nothing says star trek like spock brutally beating benedict cumberbatchs face whilst flying above a burning city     ",
      "lion": "8/10 Arnt we gonna ask why Sunny isnt being recognised for his role too     ",
      "10-cloverfield-lane": "8/10 Name a better glow-up than the original and this, I'll wait     ",
      "eloise-2017": "2/10 I expected nothing and I'm still let down     ",
      "criminal-2016": "5/10 Gal Gadot is barely in it but still manages to give the worst performance possible     ",
      "split-2016": "2/10 The only way this film is gonna be remembered is when someone with mpd meets an asshole who says 'oh so you're like the guy from split??' and that's sad     ",
      "the-lego-batman-movie": "7/10 Let's not ignore how the Joker's plot is literally the same as Prince Charming's in Shrek the Third     "
   }
}