{
   "user": "Kurstboy",
   "reviews": {
      "koko-a-talking-gorilla": "8/10 monkey mondays #8  started yesterday but didn't get around to finishing it until today. still counts     ",
      "dune-part-two": "8/10 one of those moviegoing experiences i'll cherish for the rest of my life     ",
      "bringing-up-baby": "8/10 leopard saturdays     ",
      "all-about-eve": "9/10    damn!!! the cross dissolve near the end that goes from eve's hair on the bed to the flowers at the banquet where she accepts the award, wowza     ",
      "little-murders": "7/10 not a single normal scene     ",
      "planet-of-the-apes": "9/10 monkey mondays #7      ",
      "the-after-2023-1": "3/10 they'll nominate anything these days     ",
      "madame-web": "2/10 instant classic     ",
      "the-doctor-and-the-monkey": "2/10 monkey mondays #6  oh you thought i FORGOT about MONKEY MONDAYS?     ",
      "perfect-days-2023": "9/10 didn't know a ton about this going into it, especially the similarities to paterson. watching a guy read books, listen to music, and work on toilets shouldn't be this riveting, but it is. and that's the kind of stuff i can't get enough of because when you get it right, it's so easy to get lost in the work. love the commitment to the dream montage, one of the better depictions of dreaming i've seen and they never forget to throw...     ",
      "nai-nai-wai-po": "9/10 ❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️     ",
      "the-tale-of-the-fox": "9/10 monkey mondays #5  i thought this french stop-motion fox movie was wonderful, obviously. some of the best looking stop motion animation i've ever seen. so innovative, can't say i've seen anything that looks like this. all this sped up motion blur, the dance sequence with the bird where the background is moving, all amazing. adorable and delightful. something about their eyes makes me laugh. but most importantly, the best monkey we've seen in the challenge so far. he's got glasses on. happy monkey mondays everyone     ",
      "the-legend-of-tarzan": "4/10 monkey mondays #4  some of the worst cgi monkeys we've seen so far in the challenge     ",
      "the-teachers-lounge-2023": "7/10 one of the strongest cases i've seen for minding your business. a little ridiculous but i think it knows that by the end. first time i've seen a \"karsten\" in the credits, which is all i really came here to say     ",
      "poor-things-2023": "10/10 a real mood lifter     ",
      "the-son-of-kong": "4/10 monkey mondays #3  there are so many movies out there     ",
      "the-monkey-sword-masamune": "8/10 monkey mondays #2  touching     ",
      "jawbreaker": "8/10 learn it love it live it or something like that     ",
      "dawn-of-the-planet-of-the-apes": "7/10 monkey mondays #1  thrilled to finally announce my Monkey Mondays challenge. every monday of 2024 i'm gonna watch a monkey movie. as long as there's a monkey in it, that counts. not sure why i'm doing this, it isn't for a video or anything. but i've already added so many promising ape films to the watchlist and i'm HYPED.  kicking off the challenge on a strong note with this one. a LOT of monkeys. much better than rise, properly absurd at points and some breathtaking action scenes. excited to embark on this journey.     ",
      "yi-yi": "10/10 should be a mandatory viewing every 5 years, so much to learn from this. it's impossible to see everything this has to offer off a single viewing so it only makes sense that it'll be something i continue to revisit and rediscover. as far as i know this is the only movie about everything that pulls it off. all those reflection shots in the windows are unbelievable. see you again in 5 years!     ",
      "rise-of-the-planet-of-the-apes": "7/10 Speechless     ",
      "may-december": "9/10 ate this UP! hilarious and sickening and thought-provoking. lost track of how many times i gasped but the grown ups line nearly killed me     ",
      "the-polar-express": "5/10 there is something wrong with robert zemeckis     ",
      "scarface-1983": "8/10 lots of snow, calling this a xmas movie     ",
      "its-a-wonderful-life": "9/10 My favowite Xmas movie :-)     ",
      "nashville": "10/10 watched this yesterday and put off logging it because i haven't been able to come up with a single thing to say. not in a bad way, oooobviously, but because there's arguably too much to say. i knew it was a big movie and i knew there were a lot of characters and i knew there was a lot of country and i knew it was very american and i knew it was very 70s and i knew about the...     ",
      "are-you-there-god-its-me-margaret": "8/10 so enjoyable, didn't even know \"moose\" could be a name for a person     ",
      "the-super-mario-bros-movie": "6/10 not a single mario golf scene smh     ",
      "godzilla-minus-one": "8/10 my first and last 4DX experience     ",
      "tokyo-godfathers": "8/10 watched the charlie brown xmas special last night so the filthiness of some of these scenes hit me like a bus. as usual his attention to detail is unmatched, why could i smell so many of these scenes? whole thing is a disorienting mix of realism and absurdity, which i suppose is every kon movie, but for him to use it in such a grounded \"family\" movie makes it incomparable to anything else he made. funnier the longer you're in it and the credits is just the cherry on top     ",
      "monster-2023": "8/10 \"our poop will go back in our butts\"Best Screenplay Winner at the 2023 Cannes Film Festival     ",
      "fallen-leaves-2023": "10/10 realized it was a perfect movie when they started hyping up the dead don't die     ",
      "zodiac": "9/10 I LOVED this wayyyy more than I thought I would. I am so tempted to give it a 5. How is every performance amazing? How am I just getting into Fincher? How is it that I could watch 2 more hours of this without being bored? How has Mark Ruffalo not gotten his damn animal crackers yet?  I WANNA WATCH IT AGAIN     ",
      "mike-birbiglia-the-old-man-and-the-pool": "10/10 so rare to watch a good netflix special     ",
      "napoleon-2023": "8/10 ...     ",
      "fantastic-mr-fox": "10/10 LOL how could I forget to review this. Yeah, I have a video that talks about why I love it so much so I'll leave it at that. Amazing, amazing, amazing.     ",
      "true-stories": "10/10 dale cooper would have a field day with this town. i'm getting too predictable but this was a home run, so delightful and hilarious and life-affirming. nashville but weirder and happier, even some stuff (parade scene) that reminded me of tati. thank you to the one person in my twitch chat who would tell me to watch this every stream     ",
      "willy-wonka-the-chocolate-factory": "9/10 average brewery tour     ",
      "misery": "7/10 it could happen to any of us     ",
      "badlands": "8/10 the shot of martin sheen stepping on that cow was weirdly gorgeous. simple but so strange and memorable, which i can say about most of the shots. whole movie is a beauty to look at. i've heard Gassenhauer in three different movies just this year (priscilla, true romance, this) and the use of it here is so warm. funnier than i thought it'd be. sissy spacek amazing as always     ",
      "anatomy-of-a-fall": "9/10    chill beats to kill yourself to  can't stop thinking about this movie     ",
      "all-of-us-strangers": "8/10 if paul mescal hits the dance floor in the movie it's gonna be a bad time     ",
      "twin-peaks-fire-walk-with-me": "10/10 This AND the series were both spoiled for me in none other than a Céline Sciamma interview. It sucks, but it didn't stop this from being a total nightmare to watch. Easily the darkest I've seen Lynch go. At a loss for words and will save those words for the video so all I'll leave you with is please, if you haven't seen Twin Peaks, tread lightly when watching Céline Sciamma interviews.  I will also definitely count this as my kickoff to Spooktober because it was scary! Idk!     ",
      "wallace-gromit-the-curse-of-the-were-rabbit": "8/10 great follow-up to michael haneke's \"funny games\"     ",
      "bride-of-chucky": "7/10 once i started hearing frank reynolds i couldn't unhear it     ",
      "the-old-dark-house": "8/10 we love morgan don't we folks     ",
      "the-exorcist-believer": "2/10 sucks ass     ",
      "spider-man-2": "9/10 slept on this for too long... kind of exactly what a superhero movie should be and more     ",
      "bram-stokers-dracula": "9/10 one of the craziest movies     ",
      "over-the-garden-wall-2014": "10/10 I want the opossum with the human-like shoulders in episode 3. He's so good at guitar. Give him a spinoff already!!! Cmon!!     ",
      "the-swan-2023": "8/10 keep these coming for the rest of my life     ",
      "prison-on-fire": "9/10 true friendship     ",
      "legally-blonde": "9/10 feels good to be back watching real movies     ",
      "hit-man-2023": "8/10 hot man     ",
      "hell-of-a-summer": "6/10 hate to see a film guy with a nut allergy lose     ",
      "the-holdovers": "9/10 hit it out of the park for me, probably goes even harder with a bowl of soup     ",
      "knox-goes-away": "3/10 something tells me michael keaton liked Barry     ",
      "dream-scenario": "8/10    didn't know it was possible to make a funny version of The Hunt (2012)     ",
      "one-life-2023": "6/10 the most sniffles i've ever heard in a movie theater     ",
      "finestkind": "3/10    \"i'm yer fuckin daddy!\" instant classic     ",
      "youve-got-mail": "7/10 wasn't feeling the hanks at any point, movie won me over tho ❤️     ",
      "all-about-my-mother": "9/10 favorite almodóvar, i think     ",
      "sorcerer": "7/10 roy scheider has the saddest face     ",
      "bottoms": "8/10 trying really hard not to be mean to booksmart, hate to pit two beautiful women against eachother     ",
      "moonrise": "8/10 some real characters in this one     ",
      "old-joy": "9/10 I didn't think movies like this could work this well? Wasn't aware that was allowed but apparently it totally is and that's a nice thing to know. Loved how everything was framed. I mean from the shot of him pulling out of the driveway to the shot of a hand in a bath, it was all great. I love Yo La Tengo and had no idea they were a part of this so that was a pleasant surprise. Honestly? Loved it all. I've also had a lot of weird connections that had some quiet similarities to what happened here. I think I'm gonna love Kelly Reichardt!     ",
      "oldboy": "10/10 just a ridiculous movie     ",
      "whats-up-doc-1972": "9/10 nothing good ever happens to people from iowa     ",
      "passages-2023": "9/10 i'm such a sucker for movies where a guy keeps making the worst decision imaginable and hurts everyone around him and never learns any lessons     ",
      "the-heartbreak-kid-1972": "10/10 \"you stay the hell out of minnesota you god damn newlywed\"     ",
      "only-yesterday": "9/10 one of the rare ghibli movies where grandmas are being assholes     ",
      "the-last-picture-show": "10/10 sonny was pulling in ways i cannot comprehend. jeff bridges is right there. unrelated, saddest movie i've seen in months     ",
      "the-big-heat": "9/10 goes hard     ",
      "talk-to-me-2022": "8/10 gnarly     ",
      "the-hustler": "8/10 i love playing pool     ",
      "oppenheimer-2023": "8/10 should've had at least one ice spice song     ",
      "barbie": "9/10 ken meetup in the mens bathroom, see ya there     ",
      "serpico": "8/10 he looks so good     ",
      "never-fuggedaboutit": "8/10 still haven't watched the sopranos     ",
      "a-man-called-otto": "5/10 watched on airplane     ",
      "starlet": "7/10 i love the filmmaker sean baker     ",
      "mission-impossible-dead-reckoning-part-one": "8/10 folks, he's done it again     ",
      "indiana-jones-and-the-dial-of-destiny": "5/10 harrison ford is one of the oldest guys     ",
      "jaws": "9/10 glad sharks aren't real     ",
      "summertime": "8/10 study a broad     ",
      "asteroid-city": "9/10 bought a ticket for a 2nd screening halfway through     ",
      "fishing-with-john": "9/10 Slowly been making my way through this on Youtube in 360p just to learn it's all on Criterion, apparently. Oh well!   This is brilliant and hilarious. The fact that Spongebob throws shots from the Jarmusch episode into Hooky is one of THE most hilarious things I can think of. Start your day by watching an episode of \"Fishing with John\" with a cup of coffee. It's good for ya!     ",
      "the-royal-tenenbaums": "8/10 \"I'm sorry for your loss. Your mother was a terribly attractive woman.\"     ",
      "elemental-2023": "5/10 what're we doing here     ",
      "wendy-and-lucy": "10/10 My brain is basically a milkshake after impulsively jumping into this right after finishing Bacurau. I had no idea I'd end up as broken as I currently am. Normally I'd wait things out to really flesh out some well-worded thoughts on a movie like this because this touched something in me that hasn't been touched before. Accidentally putting the words \"flesh\", \"touch\" and \"in me\" all in the same sentence...once again, milkshake of a brain over here.   This was simply...     ",
      "the-iron-giant": "9/10 :')     ",
      "four-lions": "9/10 getting my jesse armstrong fix any way i can     ",
      "the-celebration": "9/10 terrible time     ",
      "spider-man-across-the-spider-verse": "9/10 \"my holes can take me anywhere\"     ",
      "millennium-mambo": "9/10 have sat with this for a few days and am ready to say this is one of the best uses of electronic music in any movie ever     ",
      "le-havre": "7/10 very enjoyable, instantly a fan of how colorful and perfectly framed his shots are. thought i was over my primary colors phase but apparently not. also wish more movies these days had big bright lights pointed at the actors in broad daylight, looks so good. i can't believe this is from 2011?? love the sense of humor too. was the little bob thing supposed to be funny because...i mean. characters were a little too wooden at times but i dug...     ",
      "thief": "10/10 i love the city of chicago     ",
      "guardians-of-the-galaxy-vol-3": "7/10 guy in front of me was on the find my friends app in full brightness multiple times     ",
      "the-shop-around-the-corner": "9/10 wanted to punch pepi in the face     ",
      "some-like-it-hot": "10/10 funniest billy wilder i think. \"toothpick charlie\" cmon     ",
      "beau-is-afraid": "8/10 blew my socks off!     ",
      "showing-up-2022": "9/10 she's done it again     ",
      "air-2023": "7/10 perfect poster for this movie     ",
      "twin-peaks": "9/10 [season 1 +2]     ",
      "dungeons-dragons-honor-among-thieves": "7/10 massive win for short kings     ",
      "betty-blue": "8/10 3 hour cut  real sexy until it isn't     ",
      "erin-brockovich": "8/10 george having a tattoo on his shoulder that just says \"dirty\" is awesome     ",
      "somewhere": "9/10 need more chris pontius acting roles, what a screen presence     ",
      "the-darjeeling-limited": "7/10 would probably mean everything to me if i had one single brother and still leaves me colder than most of his other stuff but i still thoroughly enjoyed on a rewatch and love the way wes anderson makes Movies. this one really stands out as a turning point in his career too, imo one of his last down-to-earth movies, before he went full diorama. which is why i can see it being many people's favorite, but i think the film loses...     ",
      "the-last-detail": "8/10 the 60 seconds where they're drunk and exhausted while trying to set up a cot is 10/10     ",
      "amelie": "8/10 Odd and pure. Lot going on, definitely gonna watch again. Love the style (obviously). Makes me wanna go to France again :)     ",
      "operation-fortune-ruse-de-guerre": "4/10 did anything happen?     ",
      "blow-out": "10/10 that's how you do it!!!     ",
      "cocaine-bear": "5/10 I hope I get to make something this appreciative of the earth and the creatures that make it worth living on     ",
      "eo": "8/10 when (if) I make it to 84, I hope I get to make something this appreciative of the earth and the creatures that make it worth living on     ",
      "crash": "9/10 the idea of a destroyed tesla does sound pretty hot     ",
      "a-star-is-born-2018": "7/10 do I do a video review for it?     ",
      "ice-merchants": "8/10 not to be dramatic, but this is easily the best oscar nominated short we've had in a long time     ",
      "summer-1993": "10/10 makes me wanna give alcarràs another chance because this is incredible     ",
      "80-for-brady": "7/10 tom brady is one of our great american actors     ",
      "superbad": "8/10 he's kinda right     ",
      "ace-in-the-hole": "9/10 not the silly goose time i thought it'd be     ",
      "the-color-of-money": "6/10 This reminds me of that one episode of Drake & Josh!     ",
      "the-doom-generation": "9/10 got to meet gregg :)     ",
      "waiting-for-the-light-to-change": "10/10 linh tran is the future! incredible, immersive experience. so proud of everyone involved     ",
      "theater-camp-2023": "9/10 perfect chaser after infinity pool. funniest music mockumentary since popstar. basically a waiting for guffman remake, which is such a good thing. instant favorite for me, very few jokes don't land. why is this the only movie at sundance to make me cry?     ",
      "infinity-pool": "9/10 hit it well out of the park for me, total nightmare and i can't wait to watch it again UGH!!!  \"JAAAAAAAAAMES\"     ",
      "cat-person": "7/10 essential succession viewing gotta cover this on the podcast (new episodes of \"succ off\" every monday)     ",
      "polite-society": "6/10 one for the kids     ",
      "bad-behaviour-2023": "5/10 weird in a mostly not good way but ben whishaw is very fun. some of it reminded me of ruben östlund (👍) and a lot of it reminded me of jane campion's sweetie (👎). will probably work for a lot of people because of how specific it decides to go, but not for me. crazy unexpected cameo     ",
      "fancy-dance-2023": "7/10 reminded me of gta v. been playing a lot of gta v     ",
      "run-rabbit-run-2023": "6/10 sarah snook is so good at making like 8 different faces in just 5 seconds     ",
      "logan-lucky": "8/10 always thought this was that superhero movie. extremely up my alley, all of it is good. so lucky we live in a world where craig, tatum and driver all starred in a movie together and it was a soderbergh heist movie. are you serious? those are our best guys. david holmes even did that thing with the drums on the score. good time     ",
      "magic-mike-xxl": "9/10 beautiful     ",
      "m3gan": "7/10 m3gan you did nothing wrong     ",
      "babylon-2022": "9/10 had such a great time. felt like i got cornered at a party by the lamest film major but was just drunk enough after the first 20 minutes to hear him out. tom cruise and brad pitt made two VERY different movies this year where they acknowledge their own legacy in the industry...and i don't know how to expand on that but one being a record-breaking box office smash and the other being one of the biggest flops of the...     ",
      "the-fabelmans": "9/10 goes above and beyond what you normally expect from a movie about movies. cheesy and over-sentimental at times but i wouldn't want it any other way. if this is spielberg's last i cannot think of a better shot to end on. one of the best of the year, easily. and this is all referring to the david lynch scene specifically, rest of the movie is good too     ",
      "the-banshees-of-inisherin": "9/10 it takes two to tango     ",
      "rrr": "9/10 holy shit? lmfao     ",
      "burn-after-reading": "8/10 \"fuck\"     ",
      "titanic-1997": "10/10 the way of water     ",
      "avatar": "6/10 watched on my ipad on the airplane     ",
      "tar-2022": "9/10 if you're looking for a good laugh     ",
      "trouble-in-paradise": "10/10 perfect, i think i'm gonna love lubitsch movies     ",
      "finding-nemo": "9/10 great road trip movie     ",
      "clue": "10/10 holy fuck     ",
      "our-planet-behind-the-scenes": "10/10 first 60 minutes: soo sicklast 3 minutes: i don't wanna be around anymore     ",
      "glass-onion": "8/10 LOVED IT SO MUCH WOW     ",
      "bones-and-all": "9/10 lots to digest ...     ",
      "barbarian-2022": "8/10 still not as creepy as a night at ma's     ",
      "the-menu-2022": "7/10 can i get uhhhh     ",
      "guillermo-del-toros-pinocchio": "8/10 good clean fun     ",
      "nine-to-five": "9/10 This one goes out to my professor from last year who didn't go one class without letting us know that 'Nine to Five' was a perfect movie. You were right, Matt.     ",
      "tennis-ball-on-his-day-off": "9/10 cute lovely n existential short that i'm honored to have two lines in ❤️     ",
      "10-things-i-hate-about-you": "7/10 ska at prom ❤️     ",
      "happy-feet": "8/10 baffled at how many people hate this movie on here. it has some duds, absolutely. but leave it to george miller to make a kids movie this weird and big and gross and spiritual. i mean there is BARELY a plot but i couldn't care less as a kid and i couldn't care less now, this thing is too bizarre to fail most of the time. the crane crashing into the ocean moment is just a striking and weirdly ominous...     ",
      "black-panther": "7/10 \"w h a t     a r e    t h o s e\"——In all seriousness, I had a good time with it. I'm really glad this movie exists and I think it's a breath of fresh air in a lot of ways. Super cool score and nice performances all around.  The movie was full of things I didn't like, though. I'm clearly not a BIG Marvel fan or a superhero film fan in general and this...     ",
      "the-empire-strikes-back": "9/10 interesting remake of the LEGO video game     ",
      "down-by-law": "9/10 ideal male friend group     ",
      "halloween-1978": "7/10 watched a day after halloween because i'm *swirls hands around head*different     ",
      "dirtbag-2022": "10/10 My new short film \"Dirtbag\" is going to be screening at the 58th Chicago International Film Festival on 10/13 and 10/23! This is a massive honor considering how many years I've been going to this festival as a fan. If you wanna come laugh and say hi, more ticket info can be found here.  This is the final stop of the film's festival run, which is to say when these screenings are over I'll finally be able to put this thing online! Official release date will be 10/25 and a teaser can be found here! Can't wait for you all to see it <3     ",
      "white-noise-2022": "6/10 wish this was better, adam driver is the best comedic actor we have     ",
      "red-rocket-2021": "9/10 YES     ",
      "mandy-2018": "9/10 One of my most anticipated of the year and I can safely say it did not disappoint.   Batshit crazy in a lot of different ways. Sometimes it'll quietly make you go \"holy shit\" and other times it will give you the loudest, most chaotic, and just...obnoxious scenario.  This is the role Nicholas Cage was born to play and it was overall just a really well casted film.  Tied with ‘First Reformed' for best cinematography of the year.There's a lot...     ",
      "black-adam": "10/10 noah centineo is gonna continue delivering the corniest performances imaginable and i'm gonna keep watching them     ",
      "aftersun": "10/10 might've shed a few tears but you didn't hear that from me     ",
      "how-to-blow-up-a-pipeline": "9/10 the ocean's eleven influence is there but goldhaber citing a man escaped as an inspiration is the more palpable reference. there's the way it uses its own title to build tension, sure, but i walked away more impressed by the bressonian influence in not having one misstep in the edit and the cinematography being so simple and intentional that it makes it look easy. somehow minimalist and extreme at the same time. just lights a fire under your ass by the end...     ",
      "beau-travail": "9/10 this is the rhythm of the night     ",
      "creature-from-the-black-lagoon": "9/10 love watching him swim around! julie adams bringing like 60 outfits on this trip, hell yeah     ",
      "christine-1983": "8/10 so he definitely fucked the car, no?     ",
      "woman-in-the-dunes": "10/10 shovel your way out of the shit     ",
      "crimson-peak": "5/10 not my thing     ",
      "lyle-lyle-crocodile": "4/10 including this in my horror list for this year     ",
      "childs-play": "8/10 chucky is a true chicagoan     ",
      "triangle-of-sadness": "9/10 did not expect to actually consider using the promotional barf bag at the screening     ",
      "raw-2016": "10/10 I hesitate to give it a 5 because it has it's kinks, but I enjoyed it too much to not give it the big 10/10. Easily my favorite thing I've watched so far in the Summer100 list. The overall look of it is absolutely stunning. The writing was so careful and felt just right with every other aspect of the film. Nothing felt like a bad idea. It's hard at parts, yeah, but can't say I wasn't fully engaged from start to finish. Definitely gonna sit down and watch it again soon. Loved it :)     ",
      "girl-interrupted": "7/10 winona ryder is one cowboy hat away from getting her life ruined by benedict cumberbatch in 1920s montana     ",
      "blonde-2022": "4/10 i don't know how i arrived at this but i'm blaming sam levinson     ",
      "house": "10/10 my death scene is just an allergic reaction to the cat     ",
      "dont-worry-darling": "4/10 nightmare blunt rotation is just olivia wilde and alex garland in 2022     ",
      "monsters-inc": "9/10 door city over here     ",
      "atlantis-the-lost-empire": "7/10 my whole life i thought this was treasure planet     ",
      "the-witches-of-eastwick": "7/10 how one penis can change a small town     ",
      "decision-to-leave": "10/10 feeling shattered     ",
      "sanctuary-2022": "7/10 something something succession uhhh roman roy idk i give up     ",
      "the-eternal-daughter": "8/10 surprisingly funny, great dog performance, tilda swinton, why haven't i watched souvenir part 2 yet     ",
      "the-whale-2022": "7/10 big exhale after this one     ",
      "susie-searches": "6/10 took me a little bit to get on board with this despite some really creative cinematography/editing in the beginning. but once things kick into gear it gets really fun! saw alex wolff in hallway after screening, shorter/happier in person     ",
      "women-talking": "9/10 incredible     ",
      "bros": "8/10 maybe a little biased coming from the premiere tiff screening but hard not to laugh and smile through most of this. needed a second run in the editing room, i'll say that! a perfect 100 minute movie, what's with the extra 15 minutes? but i had fun! billy eichner has the range to carry a lead role, apparently     ",
      "weird-the-al-yankovic-story-2022": "7/10 a step forward for movies and music at the same time     ",
      "the-inspection": "6/10 well it isn't boring     ",
      "broker-2022": "9/10 kore-eda is gonna keep making this movie and i'm gonna eat it up every time     ",
      "one-fine-morning-2022": "7/10 i miss paris so much     ",
      "three-thousand-years-of-longing": "8/10 george miller discovered dialogue     ",
      "bodies-bodies-bodies": "8/10 the trailer did this movie so dirty     ",
      "funny-pages": "9/10 what i hoped mid90s would be     ",
      "gone-girl": "9/10 I didn't like this movie but at the same time it was amazing.     ",
      "midnight-cowboy": "9/10 nobody tell sam elliott about this  watched in 35mm at stockholm cinematheque     ",
      "fire-of-love-2022": "7/10 miranda july always sounds like she's seconds away from crying really hard     ",
      "the-host": "9/10 Very cool of Bong Joon-ho to invent classical music!     ",
      "we-met-in-virtual-reality": "8/10 good for them!     ",
      "normal-people-2020": "9/10 shouted at my tv like it was a football game for most of this. does more damage to sweden than midsommar     ",
      "spy": "7/10 hell yeah     ",
      "the-alpinist": "3/10 marc-andré leclerc is a fascinating documentary subject and an incredibly inspiring person. this documentary doesn't deserve him.  mixed feelings because i do think it does a decent job at showing leclerc in an authentic light that really gets across how inspiring of a person he is. but to give the film credit for that seems like a stretch, hard to shoot a smile like that and see him in a bad light.  i think leclerc and his accomplishments are nothing...     ",
      "blue-collar": "9/10 character in this named \"Dogshit Miller\" and you're telling me paul schrader isn't one of the best screenwriters to ever do it?     ",
      "the-hole": "10/10 the last movie you expect to be a musical (not complaining)     ",
      "nope": "10/10    this is my ‘don't look up'     ",
      "parallel-mothers": "9/10 recognized a prop that i own (retro magnetic cooking timer) and felt extremely cool. foaming at the mouth at literally every piece of furniture and article of clothing in this movie     ",
      "robocop": "7/10 LOL, kind of everything I expected. Cheesy, entertaining, 80s, and bad special effects. Can't deny it's fun as heck though.     ",
      "cars": "7/10 Cars     ",
      "polyester": "9/10 if i watched this instead of american beauty back in high school i feel like things would have gone very differently for me     ",
      "kaboom": "7/10 i love gregg so much but this is just a sampler platter. not funny enough, not hot enough, and not apocalyptic enough. almost impossible to top something like smiley face, nowhere or mysterious skin so i'll give him that. but still more interesting than most movies and proves yet again that he is probably my favorite film editor! nobody is doing transitions like him!!! the world REALLY needs a new gregg araki movie. i always leave his films feeling like there is so much more to filmmaking than people realize and he's the only one that seems to get that. anyway, not his best!     ",
      "127-hours": "7/10 spent half the movie trying to find his arc'teryx hat online     ",
      "pink-flamingos": "9/10 thought this was the movie where steve martin said \"damburger\" in a french accent     ",
      "thor-love-and-thunder": "1/10 absolute dogshit movie     ",
      "mash": "6/10 sometimes you just gotta watch M*A*S*H     ",
      "collateral": "9/10 lighthearted buddy roadtrip movie     ",
      "marcel-the-shell-with-shoes-on-2021": "10/10 are you fucking kidding me     ",
      "ghost-in-the-shell": "10/10 midnight screening and was already sleepy so when the story started losing me it was game over. lovely animation and music :) excited to watch this a second time in like 8 months and pretend this review never happened     ",
      "minions-the-rise-of-gru": "6/10 shoutout to gru and them     ",
      "2001-a-space-odyssey": "10/10 Great font choices in this thing     ",
      "lawrence-of-arabia": "9/10 filmed entirely at the Indiana Dunes     ",
      "the-dark-crystal": "10/10 would die for each and every one of these guys     ",
      "neptune-frost": "8/10 keyboard jacket     ",
      "sexy-beast": "9/10 barry before barry  (but weirder and darker and sillier)     ",
      "italianamerican": "9/10 literally ends with catherine scorsese looking at the camera and saying \"i'll murder you\"  accidentally a great fathers day watch     ",
      "the-muppet-movie": "7/10 orson welles is delivering those two lines like his career depends on it     ",
      "uptown-girls": "8/10 didn't expect:- fisher stevens cameo- nas cameo- michael ballhaus dp credit- crying- guy named tod (one d) in the credits     ",
      "free-solo": "9/10 Ugh, hell yes. Alex Honnold is one of the most interesting people alive. I've been interested in him before this movie so I was automatically going in pretty excited. This doc did such a great job at tapping into the psychological impacts his passion has rather than just the \"OHH SHIT DUDE YOU COULD DIE\". Very ethical film as well. Overall just felt super engaging and had me doing a lot of thinking. But MAN, he is the shittiest boyfriend of all time lmfao. Maybe my favorite documentary of the year so far.     ",
      "scanners": "7/10 too cool of a movie for a lead performance that boring. i also do wish there was more body horror, tho i'd understand if repeating the exploding head thing would've felt numbing after awhile. but the score is an all timer and i do think the concept itself is just plain fun. still don't think i understand anything cronenberg has ever done or said in a movie, for now i'm just kinda nodding along and not looking away. when the guy with the glasses and mustache showed up i went \"oh it's THAT movie!!!\"     ",
      "smiley-face": "10/10 i don't think i've ever loved a movie so strongly and so immediately     ",
      "late-spring": "10/10 seems so silly to think of how intimidated i was by ozu before watching any of his movies. i always figured i'd need to be \"sharp\" enough to properly digest his slow, meditative approach. but really (and i've only seen two so far) his movies could not be more inviting. it's so easy to sink your way into his style; the characters and their relationships to one another are so naturally charming and his shots are always framed in a...     ",
      "jurassic-world-dominion": "2/10 at one point a kid in front of me got so bored he started doing a headstand in his seat which would normally be annoying but in this case was the most entertaining part of the movie     ",
      "fire-island-2022": "7/10 cute :) and has a Great soundtrack. instant comfort classic     ",
      "good-morning": "8/10 midnight movie material     ",
      "empire-records": "9/10 one of those movies matthew lillard was definitely supposed to be in     ",
      "crimes-of-the-future-2022": "8/10 nothing in this could ever be as gross as the man sitting next to me who groaned, snorted, cleared his throat, smacked his lips, guzzled his popcorn, and moaned for a good portion of the movie. wouldn't have batted an eye if he farted. was that a passion of joan of arc reference in the end? enjoyed this as much as i could, all things considered     ",
      "top-gun-maverick": "9/10 \"I just wanna tell you both good luck. We're all counting on you.\"     ",
      "videodrome": "10/10 watched then went home and smashed my tv with a fucking hammer     ",
      "the-godfather-part-ii": "10/10 love that deniro sometimes does a brando impression and sometimes is simply robert deniro     ",
      "pleasure-2021": "8/10 more yung lean than i was expecting     ",
      "men-2022": "5/10    i can put up with watching a lot of shit but seeing someone break their ankle ruins my entire day     ",
      "shrek": "9/10 had to rewatch so i could remember what color shrek was     ",
      "top-gun": "9/10 not just sort of gay, but actually one of the gayest movies i think i've ever seen     ",
      "spider-man-no-way-home": "4/10 always a pleasure to look at willem dafoe's face     ",
      "great-freedom": "9/10 franz rogowski is one of the best doing it. whole movie is pretty great but there's no way it could have achieved what it did without him. love how much attention there is to light in this, looks phenomenal. loved this     ",
      "charade": "8/10 about to make this movie my entire personality     ",
      "ghost-dog-the-way-of-the-samurai": "9/10 jim jarmusch's most action packed movie and it's still a mostly chill time     ",
      "oslo-august-31st": "10/10 feels like i just got hit by a bus     ",
      "doctor-strange-2016": "3/10 haven't watched a movie in a week and after this i still haven't watched a movie in a week. just the most lifeless thing i've seen in a hot minute, can't say i'm surprised! (still gonna watch the new one)     ",
      "the-witch-2015": "7/10 It's great, don't get me wrong. Just not really my thing, I guess. Kinda crazy how much of an impact dull colors can have on my enjoyment.     ",
      "the-unbearable-weight-of-massive-talent": "3/10 i liked the part where they said mandy was a masterpiece     ",
      "split-ends-2022": "9/10 way better than Split (2016)     ",
      "the-northman": "9/10 could only think of the casey frey \"can i sing 4 u\" clip anytime skarsgård's massive traps were on screen     ",
      "serial-mom": "8/10    \"SUZANNE SOMERS....THIS IS MY BAD SIDE\"funniest ending possible     ",
      "were-all-going-to-the-worlds-fair": "9/10 of all the movies that have tried to \"get\" being online, this is the only one that has actually succeeded at that while still taking itself seriously in the process  loved this, reminded me of some of the worst/loneliest times of my life  subscribe to my youtube channel!     ",
      "enter-the-void": "9/10 The most bizzare film I've ever seen and something I never want to sit through ever again. I need a lot of Advil.     ",
      "ratatouille": "10/10 lowkey? one of the best pixar films     ",
      "miracle": "7/10 spent all of high school resenting hockey because everyone would rather go watch the hockey games than our swim meets. and admittedly there's still a little bit of that in me so for that reason alone i really can't pretend like i care about or support these fellas     ",
      "ambulance-2022": "7/10 Ambulance     ",
      "women-on-the-verge-of-a-nervous-breakdown": "9/10 and it all happened so fast 😵‍💫     ",
      "wild-at-heart": "9/10 when willem dafoe calls you \"mr. big round balls\" you get in the god damn car     ",
      "the-straight-story": "9/10 a david lynch movie about an old guy who grew up on a farm in minnesota? are you kidding me? obviously, ofcourse, definitely. disney world should make a ride based off this.     ",
      "jerrod-carmichael-rothaniel": "9/10 i've watched this like 3 times already     ",
      "the-worst-person-in-the-world": "9/10 this movie gets it     ",
      "benedetta": "8/10 watched with a glass of a wine and a good dinner     ",
      "a-room-in-town-1982": "7/10 dambiel is the most huggable character i've seen in the movies     ",
      "everything-everywhere-all-at-once": "8/10 easily one of the top 5 movies about taxes     ",
      "jackass-forever": "8/10 awww     ",
      "x-2022": "7/10    at a certain age having missionary sex with your bag of bones husband is considered a horror scene     ",
      "the-evil-dead": "5/10 Cannot for the life of me get into this movie. Ya know what? I'm just gonna blame my disinterest for this on the debate interrupting me halfway through. Perfect. So we're all in agreement not to yell at me because this is the debate's fault. Not mine. Fuck you, Mike Pence! Great.   Yeah I don't know, I thought the blood was cool? Big fan of the blood. Some really fun things happening here and there! But ehh?? Just kinda annoying sometimes and I really didn't care about these people. But how about that fly!     ",
      "for-a-good-time-call": "7/10 so cute to have a friend     ",
      "turning-red": "9/10 a good use of animated fur, one of the great tools this thing we call cinema has to offer     ",
      "after-yang": "8/10 second time this week where i wanted to look like colin farrell in a movie     ",
      "licorice-pizza": "8/10 alana haim was interested in politics from a very young age     ",
      "the-batman": "9/10 pouring one out for the one guy at our screening that dressed up as batman but showed up one minute before it started and ended up sitting on the stairs the entire time     ",
      "jeen-yuhs-a-kanye-trilogy": "8/10 part 2     ",
      "batman-1966": "8/10 okay NOW i'm ready to watch the new one     ",
      "boxballet": "8/10 my favorite of the oscar nominated shorts this year, this is why you watch them!     ",
      "affairs-of-the-art": "8/10 closest we'll get to an oscar nominated john waters film     ",
      "m": "8/10 man those are some big eyeballs     ",
      "surfs-up": "9/10 watched the 3 hour directors cut, a must-sea     ",
      "nightmare-alley-2021": "8/10 surprisingly riveting. the rise is just as thrilling as the fall and that's all i really needed out of this to feel satisfied. should've never doubted gdt     ",
      "an-american-tail": "7/10 another great rodent movie     ",
      "the-simpsons-movie": "8/10 Maybe I'm alone here but the Bart penis thing is such a chilling childhood memory. Still a pretty crazy shot. This is crazy relevant and still very funny.     ",
      "coda-2021": "7/10 CODA also stands for cried on da airplane     ",
      "julia-2021": "7/10 i feel like this is a good place to admit i do not remember why i gave ‘julie and julia' a single star. i don't remember that movie and i don't remember disliking it. don't know what that was about, should probs watch that one of these days. enjoyed this tho     ",
      "belfast": "3/10 there's a scene in here that's just a wide where the kid goes, \"daddy are we gonna have to leave belfast?\" the dad pauses, and then they immediately cut out of that scene. scenes and moments like this are littered throughout this film, all captured in a wide angle lens that makes the memories of branagh's memoir feel cartoonishly distant from us. in this scene, he's showing us an idea — that this kid is childishly unaware of the world...     ",
      "some-kind-of-heaven": "8/10 It always sucks when a documentary with such a fascinating subject chooses to not tell it any interesting way. That said, Some Kind of Heaven is nooothing like that.   This is playful and introspective in all the right ways. But so bleak too. I like to brush off the misery in this as a \"you're in Florida\" thing but it's made pretty clear this is universally felt.  A lot like Squidville, ya know?     ",
      "high-and-low": "10/10 everytime i watch a kurosawa movie i haven't seen i'm all like \"okay this is the best one\" but this time i MEAN IT     ",
      "encanto": "7/10 made me hungry     ",
      "west-side-story-2021": "9/10 very glad i chose this as the film to return to theaters with after not going to one in over a month. steven spielberg is the MAN!!!     ",
      "romeo-juliet-1996": "8/10 you don't go into this thinking there are gonna be two radiohead songs     ",
      "the-tragedy-of-macbeth": "7/10 why have we not figured out VFX birds yet     ",
      "nowhere": "10/10 shoutout to the lizard, he seems chill     ",
      "the-player": "9/10 trying to come up with something to say about this but can only think about how much young lyle lovett looks like my friend jeff     ",
      "the-wind-rises": "9/10 feels weirdly satisfying to watch fireflies, a thesis statement for what ghibli as a studio aimed to tell stories about, and then follow it up with the wind rises, which feels like a conclusion/reflection on those themes. obviously done by two different filmmakers, but they share a lot. hard to summarize all of what i'm feeling about this at the crisp hour of 1am, minutes after finishing this. but i'm initially just very over the moon about how real the...     ",
      "grave-of-the-fireflies": "10/10 to go from ‘barb and star go to vista del mar' to this     ",
      "barb-star-go-to-vista-del-mar": "8/10 this should be taught in film school     ",
      "all-that-jazz": "10/10 to buy a criterion and then actually go through with watching it on the blu ray player...nothing quite like it     ",
      "the-red-shoes": "10/10 we gotta stop putting men named boris in positions of power     ",
      "in-bruges": "7/10 Funny little thing; I've had the In Bruges theme saved on Spotify for over a year and have been listening to it consistently without having seen the movie. Cool seeing that bad boy in action!  I'll be honest, first 30 minutes weren't doing it for me. Didn't find either leads that charming or funny, didn't think it was doing anything terribly interesting. Thankfully McDonagh is amazing at subverting expectations and made the remainder of the film quite a ride. I...     ",
      "fargo": "10/10 Perfect film to watch before going home for thanksgiving tomorrow. I love Minnesota with every bone in my body, ya know?     ",
      "first-reformed": "9/10 1. Ethan Hawke better be getting some Oscar recognition for this2. Best shot film of the year (so far)3. Cute :) (sarcasm)     ",
      "star-wars": "9/10 Figured I'd give this a review. This film is awesome, man. It's hard to review it as a film on it's own without knowing the influence and monster it turned into, but it's good. Great story, blah blah, it deserves everything it's received.     ",
      "the-power-of-the-dog": "10/10 will be piecing this one together for weeks. precise and uncomfortable movie about predation and protection. loved it, need to ride a horse immediately     ",
      "when-harry-met-sally": "9/10 she has great hair, he has god awful hair, simple as that     ",
      "the-matrix-resurrections": "8/10 a love story that feels like it was made by an actual human being! enjoyed this movie a lot     ",
      "princess-mononoke": "10/10 thinking about the three dead plants sitting in my apartment rn     ",
      "dont-look-up-2021": "4/10 corny, self-important, out of touch, too long, underuses every actor besides jonah hill, and the absolute worst editing i've seen all year...possibly all decade. there's no chance in hell this wasn't a rough cut!!! sorry, i'm usually picky with any editing but thiiiiiiiiiiis....oh Brother this guy stinks!!  the ariana grande thing and the \"memes\" made me wanna gouge my eyes out. but i was entertained? like vice, this gets worse the more i think about it, and i don't see what...     ",
      "frosty-the-snowman": "4/10 oh WHATEVER     ",
      "the-matrix-revolutions": "6/10 \"The only way you're getting through this door is over my big dead ass\"   they don't write movies like they used to     ",
      "the-trouble-with-harry": "7/10 hitchcock, but silly     ",
      "the-lost-daughter-2021": "7/10 liked, didn't love. thought about ‘passing' a lot during this? both are debut features directed by actresses and distributed by netflix and feel like they're missing something. despite some phenomenal performances going down in both. olivia colman is obviously great. paul mescal pushes the 5 inseam agenda in a promising direction. i loved how ugly and uncomfortable this was. just wish it didn't scream \"first time feature film\" (cutting between flashbacks and present day? we've seen it all before!!!)     ",
      "network": "7/10 faye dunaway would be a great shiv(i promise i'll stop referencing succession eventually)     ",
      "the-matrix-reloaded": "8/10    in many ways this is monsters inc     ",
      "drive-my-car": "9/10 there's a 5 minute scene with a dog in it     ",
      "air-bud-spikes-back": "8/10 actually got choked up a few times     ",
      "air-bud-seventh-inning-fetch": "8/10 oh c'mon!     ",
      "air-bud-world-pup": "8/10 The Power of the Dog     ",
      "the-matrix": "10/10 i can also do a backflip     ",
      "pierrot-le-fou": "8/10 lots of colors in this one     ",
      "air-bud": "8/10 the dog in this movie is actually shooting these baskets, unreal     ",
      "the-rescue-2021": "7/10 100% the most stressful movie i've watched. few things i can think of that are more anxiety-inducing than an underwater cave. and to see it this up close was just...ah! very straight forward doc, not nearly as introspective as free solo despite trying very hard to be, but makes up for it in being one of the most impressive achievements in documentary filmmaking out there     ",
      "another-round": "9/10 Have wanted to check this out for months after seeing that still of Mads circulating around film Twitter. After already loving pretty much everything about it, the final 5 minutes left me on probably my favorite ending of the year. Ahh! The backbone of this is the chemistry between these four men, who all have unique stories relating to alcohol that feel fully fleshed out by the end. Mads delivers, without a doubt, my favorite performance of the year. As...     ",
      "the-beatles-get-back": "10/10 Bet it smells crazy in there     ",
      "the-fog": "8/10 pretty much exactly what you'd expect out of a john carpenter movie about fog     ",
      "the-sparks-brothers": "7/10 got up at 7am and had a weird, random urge to start this on netflix. got like 5 minutes in and fell back asleep and then had a really weird dream where i hung out with sparks in the jungle and then i woke up at noon. felt obligated to finish the rest of this. it is hilarious how this could have been at Least an hour shorter     ",
      "tick-tick-boom-2021": "7/10 could not be less of a Musical Theatre Kid. or maybe i'm just denying it, which would be tragic...but thoroughly enjoyed this! i love andrew garfield, he is very good. sucker for a swimming scene, although garfield's stroke is complete dogshit. loved the production design. vanessa hudgens? okay!     ",
      "the-long-goodbye": "10/10 he's so cool :)     ",
      "pvt-chat": "4/10 aims to only examine the client-side of sex work and doesn't really do a great job at it. feels graphic and uncomfortable, which i guess can be deemed as \"authentic\" but i didn't walk away from this feeling like i actually knew either of them. I get that it's about the stalker but scarlet (julia fox) is undeniably the more interesting character here, and the film seems to have zero interest in understanding her. which makes the ending fall on...     ",
      "the-good-the-bad-and-the-ugly": "9/10 gotta be the best ending of all time     ",
      "finch": "7/10 refreshing take on the apocalypse film. feels like something everyone would be talking about 10 years ago and something that would be anything but a comfort watch one year ago. probably my go-to recommendation for thanksgiving 2021     ",
      "donkey-skin": "9/10 the man has never made a bad movie     ",
      "venom-let-there-be-carnage": "5/10 sexiest movie of the year!     ",
      "venom-2018": "6/10 in my opinion every superhero movie should be exactly like this     ",
      "trick-r-treat": "8/10 AWOOOOGA     ",
      "the-invisible-man": "9/10 not sure this is scientifically possible but still really liked the movie     ",
      "last-night-in-soho": "4/10    worst case scenario coraline     ",
      "scream-2": "6/10 kinda dumb. well paced tho! at the drive in we discovered that to turn my cars lights off (because i dont wanna annoy the other cars) i'd need to take it into the dealership and they'd have to change something so that i can manually turn them off. piece of shit car, right? so i had to keep the car on for us to use the radio for sound, but i couldn't take the keys out or else that'd kill...     ",
      "dune-2021": "8/10 my takeaway is that jason momoa is my favorite action star. a million dollar smile and a great head of hair!!     ",
      "memoria-2011": "9/10 movies to chill and study to     ",
      "the-french-dispatch": "10/10 everything i wanted it to be and more! i know on my inevitable 5th watch i'll decide this is 5 stars so i may as well just take one for the team and be the first person i know to give it 5 now. and who cares about stars anyway. i loved it, i had a good ass time. what else is there to it?     ",
      "mad-god": "10/10 commits to the bit at an inspiring level     ",
      "spencer-2021": "9/10 Jazz :)     ",
      "blazing-saddles": "8/10 watched while putting together a cool Lego set     ",
      "ring-1998": "8/10 this is what happens when you watch long toast     ",
      "irma-vep": "8/10 that ending was one of the coolest things i've seen in a movie. filmmaking seems fun!     ",
      "the-nightmare-before-christmas": "8/10 have seen this many times, been watching it for years, and i still have no clue what happens in this movie. he's a skeleton and he doesn't know about christmas. great flick to fully disassociate to!     ",
      "dune": "6/10 there are worse movie     ",
      "titane": "10/10 best movie ever, what more could you want here? not one part of this isn't paid full attention to. so bold, so metallic, so gross and so funny??? to think, i loved ‘raw' and this just completely surpasses that movie in every way. the music choices, come on!! the whole movie is on FIRE! this is a sloppy review and i'm sorry about that but i just loved this. i had such a good time and i'm so so so excited to watch it again and show it to everyone i know besides my parents because i don't know if they'll dig this one tbh!     ",
      "casino-royale-2006": "9/10 relatable     ",
      "onibaba": "10/10 one of the most haunting tellings of grief and the indirect effects of war. captivating as hell     ",
      "hit-the-road-2021": "9/10 great galaxy road trip dog movie     ",
      "petite-maman": "10/10 a vanilla pudding movie; wish it lasted longer, sweet and soft while it's there, makes me go \"gotta check out the rest of pudding's work\"     ",
      "el-planeta": "9/10    best scorsese cameo since shark tale     ",
      "cmon-cmon": "8/10 i wish you could get tattoos of movies     ",
      "passing-2021": "7/10 a shame that i put out a video all about 4:3 two weeks ago because this is one of the best examples of a movie that knew what it was doing with it     ",
      "vortex-2021": "9/10 still not really sure what to make of this one, which is not a new experience for me with these recent gaspar noé movies. but what i Can say for now is this somehow uses his signature style to make something more intimate than anything he's done, and it works really well. loaded? sure, i really wish he took more than what seemed like a month to edit this one. but the spontaneity at which this extremely dense movie was put together...     ",
      "mulholland-drive": "9/10 So I enjoyed quite literally every second of it...but at the same time I'm very confused on a few things (and I'm definitely supposed to be). Gotta love a good puzzle.     ",
      "after-hours": "9/10 This guy is really bad at being a person     ",
      "malignant-2021": "7/10    great addition to the \"‘where is my mind' by the pixies in a movie where two people end up being one person\" cinematic universe     ",
      "mogul-mowgli": "8/10 riz ahmed destroys his performance. the sound of metal comparisons make sense (i mean cmon) but this is way more disorientating. in a good way! i love a good nightmare scene. and what the fuck does he mean by \"pussy fried chicken\"     ",
      "moonstruck": "9/10 one of the great american movies about moon and infidelity     ",
      "the-young-girls-of-rochefort": "9/10 i would like to eat this movie, it probably tastes great     ",
      "king-of-new-york": "8/10 maybe christopher walken is the best actor of all time     ",
      "the-thing": "9/10 This was....a blast. Such a great time.Watched on unrestored 70mm in a packed and very sweaty theatre. Two minutes in I realized I was thirsty and thought to myself \"I'll find a dull moment to get up and go grab some water\" but here's the twist...  there was no dull part.     ",
      "the-card-counter": "6/10 typed out a lot of thoughts on this only for it to boil down to:  if this was paul schrader's first film, maybe even the first of his i'd seen, i'd like this a lot more. but he did this same thing in taxi driver, and obviously the same thing in first reformed. and if i wanna watch paul schrader do that Thing he always does, i'd rather watch those! that's not to say he isn't trying ANYTHING new here. it's just that most (not all) of it is doing nothing i haven't seen before.     ",
      "josie-and-the-pussycats": "8/10 such a Floyd's 99 Barbershop movie     ",
      "tangled-2010": "7/10 very clearly a movie made when parkour was at its peak, flynn's speed vault was clean as hell     ",
      "the-suicide-squad": "4/10 really wanted to like this and have fun with it but just couldn't. sure it's gory and bold and colorful and whatever. but what use is any of that if you're gonna throw out any sense of pace or heart? the character development feels so half-assed and like it's getting in the way more than anything. and the action focuses more on making you go \"whoa the superhero said fuck!\" instead of feeling like it's adding any sort of tension....     ",
      "a-page-of-madness": "8/10 to the joker it's just a page     ",
      "the-ladykillers": "9/10 need a group of friends like this (old woman included)     ",
      "hes-all-that": "1/10 i don't think addison rae is a real person     ",
      "the-mummy-1999": "8/10 i love to watch the movie!     ",
      "the-third-man": "9/10 OrsonWellesSayingCuckooClock.mp3     ",
      "ida": "9/10    whenever a movie does that little thing where the camera doesn't move off sticks till the final shot i'm guaranteed to go cuckoo nutso bananas over it     ",
      "tampopo": "9/10 graphic noodity     ",
      "carnival-of-souls": "10/10 literally took me almost the entire movie to realize what this was doing, and it rules  great double feature with ugetsu     ",
      "ugetsu": "9/10 very unsettling, specifically with sound. lots of very eerie noises going on throughout the entire thing. never felt like i was being talked down to either. a refreshingly nuanced take on greed. ceramics!     ",
      "mamma-mia-here-we-go-again": "7/10 The moment Cher started singing Fernando and I gasped was the moment I realized I am definitely not straight.     ",
      "best-in-show": "9/10 pretty much just a fred willard stand up special     ",
      "indiana-jones-and-the-temple-of-doom": "7/10 nobody is talking about the mine cart scene, huge fan of the mine cart scene     ",
      "annette": "8/10 they could have played the \"baby of the year\" theme from ITYSL and it would have made total sense. never seen a leos carax movie, planning on watching holy motors as soon as i can. this worked for me! it's fun, dumb, absurd, and surprisingly sad. i can't tell how this movie will age for me, i can see it leaning either way. i don't know! i want more movies to be this crazy, if i had the time i'd see this again tomorrow. saw adam driver's ass, can't give that less than 4 stars.     ",
      "stoker": "9/10 seems like park chan-wook is definitely holding back with this one. but that said it's still spicier than most of what's out there. has to be one of the best edited films i've ever seen. would have gone feral over this movie in high school. everyone in this movie is in desperate need of some eye drops!     ",
      "icarus-2017": "8/10 easily the craziest movie i've seen about piss     ",
      "the-green-knight": "9/10 the princess bride deleted scenes     ",
      "space-jam-a-new-legacy": "2/10 on par with those videos they play while you wait in line for rollercoasters     ",
      "old-2021": "7/10 personally this would never happen to me.   first 15 minutes of this is god awful and i can't say it gets better but you warm up to it. very stupid movie and with a concept like that i don't know what else i wanted. everything that tried being even remotely meaningful was an absolute eye roll so maybe it's best that it has as much fun as it's having. although i genot sure if it was intentional but \"my name is JARED\" is just maybe the funniest thing to come out of a studio blockbuster this year.     ",
      "roadrunner-a-film-about-anthony-bourdain": "8/10 between this and paris, texas this month has been all about unexpected john lurie cameos     ",
      "the-cat-returns": "7/10 kitty :)     ",
      "the-woman-who-ran": "8/10 kitty :)     ",
      "pig-2021": "8/10 theatre staff kicked me out because i wouldn't stop oinking     ",
      "spree-2020": "8/10 kurt would be huge on letterboxd     ",
      "waiting-for-guffman": "7/10 Hamilton? Sorry I only know \"Red, White and Blaine\"     ",
      "paris-texas": "9/10 movies can be so sick sometimes     ",
      "zola": "6/10 you guys should watch Succession     ",
      "the-boss-baby-family-business": "3/10 who needs the 2021 Cannes Film Festival anyway     ",
      "no-sudden-move": "7/10 if you're gonna throw roman roy on screen ALL i'm gonna think about is succession and this is why i'm so stressed to see zola     ",
      "goodfellas": "9/10 this is a good one     ",
      "naked": "8/10 have wanted to watch this for years and for having finally gotten around to it i think i'll give myself a pat on the back. which isn't to say it's boring or disturbing. it's bleak, but that's not what makes it a (purposeful) slog to get through. just very confrontational and uncomfortable. the dude goes around and ruins everyone's day but those people only had to hear his speech once, think about us! used every bone in my body not to make my post simply \"this is joker but with more words.\" david thewlis is really good in this too.     ",
      "climax-2018": "10/10 Climax is everything you've heard. It's crazy, depressing, gross, aggressive, you know the deal. I love that, it makes for an interesting experience. But if there's one thing I took away from this film, it was just me asking why. Like why did this film happen? Why are all of these choices being made? Why does he stick to certain ideas and not others? Why are certain ideas in here in the first place? This question comes up in every...     ",
      "luca-2021": "8/10 gay     ",
      "it-2017": "7/10 Really fun. Felt like I was watching a Stranger Things movie and I mean that in a good way. Nicely shot, very fun, pretty scary.     ",
      "in-the-heights": "5/10 i just don't like lin manuel miranda or musicals or movies or music so this wasn't for me     ",
      "sam-morril-i-got-this": "5/10 one of the better standup specials on youtube     ",
      "the-pink-panther": "8/10 is this french new wave     ",
      "the-umbrellas-of-cherbourg": "10/10 genuinely think jacques demy is the greatest to ever do it     ",
      "the-hot-rock": "9/10 who knew stealing a diamond could be So Much Fun!!!     ",
      "ma-2019": "3/10 i know who spiked the sangria in climax     ",
      "bay-of-angels": "10/10 of the few of them i've seen, this has gotta be one of my favorite films about gambling. probably bc it's the first one that made me wanna go to a casino asap and also stay as far away from one as i can. it's just an absolute whirlpool of a time. would like to emphasize, i do NOT want to pick up gambling after this. definitely could be interesting tho. but probably shouldn't do that. unless  great ending, great everything, movies kick ass.     ",
      "mary-janes-not-a-virgin-anymore": "8/10 great to be back at the movies watching movies about being (and working) at the movies     ",
      "cruella": "4/10 the de Vil wears prada     ",
      "cinema-paradiso": "9/10 need toto's reaction to Uncut Gems (2019)     ",
      "lola": "10/10 michel isn't even that hot     ",
      "undine-2020": "8/10 went in expecting mermaids and came out knowing a surprising amount about german architecture     ",
      "army-of-the-dead-2021": "5/10    the first 10 minutes of this begs the question \"can road head cause a zombie outbreak?\"     ",
      "bo-burnham-inside": "5/10 bo is a very good guy who makes very good things that are very important to me and i'll just leave it at that     ",
      "playtime": "10/10 I got really sad when this was over. Not in a way where I'm just saying that to say it, I was genuinely kind of upset. For it's 2 hour runtime I felt so comfortable in the world Tati created. Everything is so well-orchestrated and the commitment to the style is unforgiving. Just based off personal taste, I can't really say there's a better looking film out there, just watch the last 10 minutes and get back to me. I'm so in love with this, and unlike most of what I've seen from Tati thus far, I'm pumped to watch it again.     ",
      "saint-maud": "7/10 don't go to MAud's     ",
      "mortal-kombat-2021": "3/10 gotta know which of the three writers that wrote Mortal Kombat (2021) threw in the line \"all the great artists are a little twisted, man\"     ",
      "california-split": "9/10 manifesting elliott gould in the next safdie brothers film. this is just fantastic     ",
      "lost-highway": "8/10 a movie about being a saxophonist     ",
      "perfect-blue": "8/10 I say this in the most minnesotan way possible: oh jeez     ",
      "freaky-friday-2003": "7/10 chad michael murray falling on the pavement for 97 minutes straight     ",
      "the-mighty-ducks": "7/10 i think it's weird that gordon wore a nice sweater on the day he was gonna have the kids hit eggs towards him     ",
      "the-daytrippers": "9/10 liev schreiber and anna meara have some of the best comedic chemistry i've seen in awhile. i really can't believe i liked this as much as i did. i feel like this is sort of a stretch but if you like wes anderson or noah baumbach you'll probably like this. just because of the family issues and oddball humor. yeah, exactly the thing i needed to watch right now as i'm currently experience the worst tonsillitis of my life. the first time all week where i didn't wanna rip my throat out.     ",
      "the-skin-i-live-in": "6/10 what the fuck lmfao     ",
      "election": "10/10 My mom has said to me multiple times that nobody should graduate film school without having seen Election. I don't know if I agree with her yet but this is an amazing movie.     ",
      "the-devil-wears-prada": "7/10 Not sure if it's just because I watched this a lot with my mom and my sister but I love this movie. Really funny and entertaining and very well paced. It's hilariously cheesy at times but feels like it knows what it's doing.     ",
      "mainstream-2020": "6/10 somehow not saying anything new but also the most self-aware and absurd a film about influencer culture has gone. gonna get a best actor campaign going for andrew garfield just to try and get what is essentially an expensive youtube poop a nomination at the oscars.     ",
      "the-handmaiden": "9/10 2nd park chan-wook film ive seen where i spent the 1st act going \"this is cool\" the 2nd act going \"what the absolute fuck is going on, this movie is horribly edited\" and the 3rd act going \"forget everything i just said, everything about this is perfect\"  genuinely spent a solid 30 min in the middle of this telling myself i'd never watch this again and honestly, might rewatch in a few days idk why not  to the hundreds (literally) of people who've wanted me to watch this for years, i did it!     ",
      "gunda-2020": "9/10 need to see the blooper reel for this     ",
      "eternal-sunshine-of-the-spotless-mind": "9/10 this also happened when i dyed my hair     ",
      "school-of-rock": "9/10 Why did I cry?     ",
      "john-mulaney-the-comeback-kid": "9/10 put this on because it's really just the lightest possible thing to watch whilst dealing with hellish 2nd dose symptoms. have seen this maybe over a dozen times and it still remains just as sharp and entertaining. this was the first time i realized jon brion scored the intro and outro music, cool!     ",
      "scooby-doo": "7/10 we need to collectively recognize matthew lillard as a better nic cage     ",
      "train-to-busan": "8/10 famously based on ozzy osbourne's rock n roll classic \"crazy train\"     ",
      "godzilla-vs-kong": "5/10 we want the funky kong cut     ",
      "bad-trip-2021": "8/10 first 10 minutes were not clicking at all but it got so good....so fast. like as soon as the musical number parody happened it got extremely fun. this is pretty much all my favorite parts of the eric andre show in one movie with the added bonus of being suchhh a clever way of using hidden camera pranks in film. probably the best hidden camera prank movie if we're being honest?   just so glad that this makes up for eric andre's extremely disappointing standup special from last year (that i'm still not over, apparently)     ",
      "shiva-baby-2020": "9/10 Interrupted my horror marathon (that I am aggressively behind on) to check this out and...fuck yes. But also, as someone who identifies as bisexual and has had a handful of uncomfortable experiences during family get-togethers because of that, this is at least SORT OF a horror movie. Right?   Depending on availability, I predict myself watching this at least 5 more times before the end of the year. Rachel Sennott rules.  NewFest     ",
      "my-octopus-teacher": "7/10 oscar bait because 1) surprisingly not the first time the oscars nominated a movie about a human wanting to fuck a fish2) bait! like the fish     ",
      "the-father-2020": "9/10 just an absolutely heartbreaking film from beginning to end. belongs in a very small group of movies that i don't think i could bring myself to watch again. i really don't know what else there is to say? anthony hopkins deserves the world.     ",
      "aniara-2018": "7/10 feels sooo redundant at this point to be like \"ugh, so ahead of its time because 2020 :P\" but this was a little too relevant. i haven't seen a film since last march that felt like it just understood solitude the way this did.   some dogshit pacing here and there, especially near the end. and i wish these characters felt more like people with lives and less like stereotypical representations of their beliefs. like that roommate character could've been so...     ",
      "barton-fink": "7/10 light n easy watch before bed     ",
      "the-lighthouse-2019": "10/10 It was clear the moment both actors appeared on the screen that this was going to be something special. To put it simply, this is the result of everyone behind the film being on the same page and doing their absolute best. It's not something where I can pick my favorite aspect, it's all overwhelmingly good. It was clear throughout the film that this was not the end of this experience, with sounds and images so specific and beautiful that...     ",
      "greener-grass-2019": "10/10 Easily one of my favorite movies. Greener Grass is unlike anything I've ever seen but it tackles ideas I have never been more familiar with. I love Greener Grass from every angle I look at it. On it's surface, it's hilarious, absurd, unpredictable, uncomfortable, basically everything you'd find on Adult Swim but turned up to the max. And from that perspective it's absolutely hilarious thanks to some amazing performances with peeeerfect comedic timing. But what I love SO much about...     ",
      "promising-young-woman": "8/10 definitely the best \"oh, alison brie is in this?\" movie i've seen in AWHILE     ",
      "yes-god-yes-2019": "5/10 ethan hawke voice \"well somebody has to do someone!\"     ",
      "shock-corridor": "9/10 the eeriest and most effective use of a silhouette(s)     ",
      "cats-2019": "3/10 The way I escaped the theatre as soon as the words \"Written and Directed by Tom Hooper\" appeared.     ",
      "they-live-by-night": "8/10 not like any noir film i've seen. even when nothing is really happening, things still feel like they're moving forward. which was cool! mostly referring to the romantic stuff. running on 4 hours of sleep and also drove for like 8 hours today. so it only feels right to end on a film that has over one million shots of people driving cars. an exaggeration, of course! how do i end this review so i can go to bed?     ",
      "tom-jerry-2021": "2/10 it amazes me every day that colin jost has made it this far in the industry     ",
      "mystery-train": "10/10 One Night in Memphis  (i will be real with you, i think jim jarmusch is my favorite director)     ",
      "spirited-away": "10/10 ugh....just.......ugh....     ",
      "pretend-its-a-city": "9/10 i don't like sports, but i also don't like people who are too vocal about not liking sports. like the kinds of people who post the same \"hope they score a goal\" joke on superbowl night every single year. i'm forsure guilty of this. don't get me wrong, i also think sports culture is obnoxious and easy to make fun of, but it feels like the same jab every time.   i say all of this to make it clear that fran lebowitz is the only person i know of who can talk about not liking sports and make it a point worth listening to.     ",
      "earwig-and-the-witch": "2/10 i've seen commercials for The General Insurance that look better than this     ",
      "klute": "7/10 wish i liked this more but i still liked it! jane fonda, what needs to be said? and that score is beautifully haunting. i can't say it loses steam in the second half but it definitely doesn't embrace what the first half had going for it. i think one of my biggest take aways is that adam driver is the sequel to donald sutherland.     ",
      "the-princess-bride": "9/10 lots of people have seen this movie     ",
      "point-break": "9/10 i feel so alive right now     ",
      "malcolm-marie": "4/10 felt like i was plankton in that scene where he eats the holographic meatloaf but this time the meatloaf wouldn't stop whining     ",
      "the-discreet-charm-of-the-bourgeoisie": "8/10 this is, and i don't say this lightly, bananas     ",
      "pilots-2021": "8/10 this happened to my buddy jeff     ",
      "police-story": "7/10 loved the part where he did the stunt     ",
      "pride-prejudice": "10/10 mr. darcy smiling is enough to make a grown man cry     ",
      "whiplash-2014": "10/10 perfecto!     ",
      "branded-to-kill": "9/10    just when i thought this couldn't get any goofier, it ends on the most ‘dear sister' ending imaginable     ",
      "judas-and-the-black-messiah": "9/10 if your ensemble has lakeith stanfield in it, it's gonna be a good film. devastating from beginning to end.     ",
      "superior-2021": "5/10 i accidentally ordered two pizzas instead of one right before this. in my opinion? pretty funny accident to have during a movie like this.  anyway i, uh? mm. well. i really loved the beginning of this. and the cinematography was so different so i was very excited to watch things unfold. and then it kept going. and going. and going. and by then i had eaten like 1.5 pizzas and i was like christ how much longer. the pizzas weren't...     ",
      "cusp": "5/10 Three Lil Peep songs in one film. That's gotta mean something, right?  If there's one thing you walk away from this fly-on-wall film with, it's that these girls feel unseen, unheard, and in some ways unfelt. Which is made abundantly clear when you look at their surroundings as well as, unfortunately, the doc itself.  This serves as a really great introduction to the lives of these girls and who they are but it never quite cracks that surface to give...     ",
      "censor-2021": "7/10 showing up fashionably late to sundance but here we are 🤪  this doesn't quite stick the landing but i'd be lying if i said i didn't have a good time. also just such a unique thing to make a movie about and i Personally think that they pulled it off. there's a lot of argento in this but at the same time this feels like a very original take on the horror genre. i also think it's so easy to...     ",
      "this-is-spinal-tap": "9/10 i love a good Gumby motif     ",
      "one-night-in-miami": "8/10 I really liked this! Obviously, intoxicating performances all across the board and some surprisingly slick cinematography. A birds eye view shot is used like 3 separate times and it looks beautiful. What does that choice do for the film aside from looking cool? I really don't know. And that's where this falls short.  I do think this lacks a spice and soul behind it to really feel like something worth sticking. But, in Regina King's defense, the screenplay and performances...     ",
      "bernie-2011": "9/10 how can david fincher sleep at night knowing he didn't cast jack black as orson welles in mank?  this is the dictionary definition of a hidden gem     ",
      "insomnia-2002": "7/10 could never happen to dunkaccino     ",
      "the-dark-knight-rises": "6/10 Christopher Nolan Learn How To Mix Sound Challenge     ",
      "the-prestige": "9/10 Second unexpected Radiohead in the credits moment THIS WEEK, i need a break     ",
      "batman-begins": "6/10 If I took away anything from this movie, it was a greater appreciation for The Dark Knight.     ",
      "taste-of-cherry": "10/10 writing a review Way after i logged it but oh well. kiarostami does something unexplainably beautiful here, felt like i was in a haze watching this.  i'm gonna cut myself some slack for not adding a review until now because i think this is a very tough one to write about. not only from a personal level but it's also tough to mention any specific theme or visual trick used here without spiraling into the hundreds of things to say...     ",
      "porco-rosso": "8/10 won't elaborate but this has tom hardy energy oozing out of it     ",
      "the-twilight-saga-breaking-dawn-part-2": "8/10 my eyes hurt     ",
      "the-twilight-saga-new-moon": "8/10 i can't believe \"edward vs. jacob\" is a debate when there is very clearly a correct answer     ",
      "kirikou-and-the-sorceress": "8/10 Only logging because it just got added to Criterion and that reminded me it exists.  This movie rules. My french teacher in high school put our class onto it because it was the most a class of French 1 students could comprehend but we all agreed it was great. I keep in contact with one person from that class, the rest I have no clue where they are, but we all had this shared love for this and I think that's kinda nice. I don't know, that's all I had to say. Lot of good, innocent memories associated with this one.     ",
      "a-serious-man": "9/10 once you remember this takes place in minnesota it all starts to click     ",
      "bloody-nose-empty-pockets": "7/10 i am so confident that tarantino loves this     ",
      "me-and-you-and-everyone-we-know": "7/10 definitely a weird one!     ",
      "palm-springs-2020": "8/10 Just really glad Connor O'Malley is getting this kind of recognition.     ",
      "wolfwalkers": "8/10 Undeniably and unsurprisingly one of the most gorgeously animated films of the year.  On a semi-unrelated note: It is weird that THIS was the film that really made me think about how horrific a film industry dominated by streaming services looks like. Like you can really only experience this beautiful movie if you own an Apple device of some kind. Or an Apple Id or whatever you get what I mean. Very awesome how films got so accessible and so inaccessible so fast! Not a mind-blowing thought by any means. But pretty odd the more you think about it, no? Idk  Great movie, though!     ",
      "fallen-angels": "10/10 happy to announce that wong kar-wai finally clicked for me and holy shit i love movies     ",
      "soul-2020": "9/10 Soul is the textbook definition of a one-of-a-kind in that there's nothing textbook about it. From the look to the music and from the structure to the story itself, everything about this is completely fresh. Like watching a Pixar film for the first time again.  The film starts with high concepts and the \"adventure\" ends with 30 minutes left. Joe Gardner is both gifted and soo normal. Basically, Pixar started with a concept as broad as purpose and stretched it...     ",
      "burrow": "9/10 To quote another movie, \"In a way, I'm almost glad that flood interrupted us because I don't like the toast I was giving. I'm gonna start over.\"     ",
      "kajillionaire": "10/10 I think literally every scene topped the previous one. I cannot emphasize how every part of this felt like it was made specifically for me. Unbelievable!!!  This and Fantastic Mr. Fox are both enjoying drinks in the corner of the film industry, chatting over how they quietly redefined the heist movie.     ",
      "im-no-longer-here": "8/10 One of my favorite final shots of the year. What an experience this movie is.     ",
      "feels-good-man": "9/10 I think after watching this and Crumb, I've decided documentaries about comic artists are just gonna be my thing.     ",
      "swallow-2019": "5/10 REALLY bummed i never came around to this. while i think the way it goes about these themes is pretty clever, i didn't really get much out of the film itself other than an \"oh, neat\" and some really intense squirms. said \"ouch\" out loud once or twice which is really embarrassing on my part. it had all the right ingredients, thumbtacks and all, but i didn't taste a thing.     ",
      "let-them-all-talk": "7/10 Fully expected a mom-pleaser movie and, it totally is, but I also...liked it way more than I thought I would?? Super entertaining and very jazzy throughout. Mostly got a kick out of my dad roasting Lucas Hedges for his dweeby backpack in every scene. I like it! Fuck it!     ",
      "mangrove-2020": "8/10 I think what I love so much about this is that Steve McQueen can maintain this sense of scale while still making the case for this being a slice of something that cuts much, much deeper. Beautiful and upsetting.     ",
      "ma-raineys-black-bottom": "7/10 Chadwick's performance is seriously electrifying. Sure this has so much else to offer, but it wouldn't come close to being as enthralling as it is without him. All love to Riz, I know I just locked my prediction/pick this same week, but Chadwick has that award in the bag and it's absolutely deserved.     ",
      "long-toast": "7/10 made a little animated thing about long toast  link     ",
      "minari": "9/10 I keep seeing the word \"tender\" slapped on every review for this and I....okay, yeah, I get it now. In a year full of beautiful film scores, this absolutely takes the cake. Both that and the cinematography feel SO dreamy. They simultaneously capture the hazy perspective of the parents, the old age of the grandmother, and the childlike wonder for both children.   Minari is such a specific movie full of specific scenes that all do specific things. What a vague way of describing a film's specificity. Essentially, it's unforgettable. I miss movie theatres.     ",
      "emma-2020": "9/10 texted my gf the entire time didnt watch a god damn minute of it     ",
      "tenet": "7/10 hilariously expensive, convoluted, and up its own ass. like, sooooo dumb. loved every second of it!     ",
      "sound-of-metal": "9/10 Everyone involved in this deserves recognition but if anyone should get that ‘best actor' award this year, it's Riz. And it isn't even close!  Talked about this on my podcast, the Karstcast.     ",
      "the-queens-gambit": "7/10 Anya Taylor-Joy has done so much and is still someone whose career I'm so excited to watch progress. This is fun as hell! And the editing is sexy. If nothing else, it made me download a chess app that I deleted less than 10 minutes later!     ",
      "coraline": "9/10 Other Mother has a dumper     ",
      "dick-johnson-is-dead": "8/10 I think this struck a chord much deeper than just grieving over a parent and made me appreciate documentary on another level. That scene about her mother and the stairs is specifically something that'll stick with me till I (and all my loved ones) die. Dick Johnson is a lucky man but Kirsten Johnson is just as lucky to have something like this to hold on to forever. Can't wait to confuse my mom and film her doing something completely insignificant tomorrow just to have a little something to look back on.     ",
      "the-trial-of-the-chicago-7": "6/10 I think I really don't like Eddie Redmayne.     ",
      "following": "5/10 Solid proof that Nolan has always been Nolan both in how reliant he is on the score and how he doesn't believe in women as characters.     ",
      "the-social-network": "10/10 \"MY FUCK YOU FLIP FLOPS\"     ",
      "mank": "6/10 This gets so much better as it goes. It starts on such an odd note where it reads like you walked into the theatre an hour late. I think it's just so frantic in that first act and the more it really starts to settle and invites you into what it's trying to do, you come around to it. There's a lot of good in here, but for someone like Fincher—a master at making the audience care about anything he throws at them—I was bored way more than I should have been.     ",
      "happiest-season": "6/10 there have been...happier seasons, no? sorry idk i'm going to bed my allergies are really bad rn     ",
      "an-evening-with-tim-heidecker": "6/10 there are a lot of jokes in here     ",
      "the-game": "9/10 i'm so positive charlie kaufman wish he made this     ",
      "the-girl-with-the-dragon-tattoo-2011": "8/10 the best use of enya's orinoco flow ever put to film     ",
      "puella-magi-madoka-magica": "9/10 cookie finally got me into anime     ",
      "high-school-musical-2": "8/10 Kelsi is the worst-dressed character in the history of film     ",
      "shithouse": "9/10 Embarrassingly relatable. And I know I say that a lot but this was...aggressive. The freshman roommate, the crying the second you get off the phone with your mom, the ******* ** **** **** **. I can't pretend this doesn't have it's flaws, but I also can't pretend this isn't a direct reflection of who I was my freshman year of college. And to an extent, who I still am in a few ways. Which goes to show how well this...     ",
      "only-lovers-left-alive": "9/10 I love Jim Jarmusch so much lmfao     ",
      "and-then-we-danced": "8/10 For as familiar as a film like this may seem, this is a breath of fresh air. So much fragility and beautiful body language. Sucks that every time I hear the title I think of that one Macklemore song from 2011. But anyway, sorry, great movie. I'll revisit that one-shot at the party quite a bit.     ",
      "the-wolf-of-snow-hollow": "7/10 I feel like I'm the only person in the world who watched this BEFORE Thunder Road but I'm into it! This has some really nice moments but I think the (interesting) subplots kind of fold in on each other  and make it hard to care or find a clear tone. It dabbles in comedy, horror, and drama but never REALLY commits to any of them. But, it does those little moments of each style super well. The cinematography is FULL of...     ",
      "boys-state": "8/10 \"Ugh, I hate high school boys\" - me posting a review to my audience of mostly high school boys     ",
      "killer-klowns-from-outer-space": "7/10 Definitely should be on more of those \"1,001 movies you need to see before you die\" lists.     ",
      "enola-holmes": "5/10 A movie about a girl who is really good at one specific New York Times puzzle.  Talked about this on my podcast.     ",
      "the-blob": "6/10 Not to be THAT guy but this could've used more blob.     ",
      "the-texas-chain-saw-massacre": "9/10 man...i mean like...cmon     ",
      "totally-under-control": "7/10 Every time I think about Covid, Trump or anything related to this administration—which quite frankly is all the time—I shut it out as quickly as I can because it's just too exhausting. So watching a +2 hour long documentary covering nearly every corner of how poorly the pandemic was and still is being handled was quite the experience. We're living in hell, I'm upset, and I'm gonna play some Super Mario Galaxy to distract myself for a second.     ",
      "re-animator": "7/10 the hair and makeup department bodied this     ",
      "hubie-halloween": "6/10 Forgot to log this but I had fun! Talked about this on the Karstcast! Normally when I have this little to say about something, I don't even bother with a review. But I have to promote this podcast, please listen to the podcast. alright     ",
      "evil-dead-ii": "10/10 the SECOND ‘a farewell to arms' came into frame, it was 5 stars     ",
      "the-devils-backbone": "8/10 Thought this was more captivating and unsettling than it was scary. I'm also not super squeamish but this has some moments that are...so vivid. Extremely well written, specifically the way things wrapped up. I know this is nitpicky but I'm super annoying when it comes to how music is used in film, specifically when it's overused. This is a prime example of that in that I think a lot of the \"scary\" scenes here could have been so much scarier...     ",
      "the-orphanage": "8/10 *Borat voice*\"My son!\"     ",
      "unfriended": "7/10 To everyone who shat on this and convinced me to shit on it without ever having seen it, cmon man. Fun time and aside from a (sorta) cheesy ending, this has aged better than it should have. I miss how awful 2013 was.     ",
      "tales-from-the-hood": "9/10 Genuinely? One of my favorite anthology films and EASILY the best horror anthology I've seen. Hilarious that I JUST saw Dead of Night last night and this (I think) pays homage to that (scary puppet!) or at least follows the same format.  Amazed at how creative it goes about telling such heavy stories. At any given moment this is either funny, horrific, powerful, or incredibly unique. You truly can't lose here.     ",
      "borat-subsequent-moviefilm": "7/10 \"That's c̶i̶n̶e̶m̶a̶ Moviefilm\" - Martin Scorsese     ",
      "dead-of-night": "8/10 This was my first drive-in experience and it was a blast! Was in a comfortable position for less than a minute total but still had a good time so what does that say? This is real creepy and real funny, the whole golf ball thing was brilliant. But wait AND I won a free blu-ray during the pre-show trivia. Hell yeah, movies!     ",
      "audition": "7/10    My wifi went down 20 minutes before this was over so I was like \"Oh okay, I'll use this time to make a quesadilla that I've been craving this whole time!\" So I make the quesadilla, right? Wifi comes back on, I press play, and what I'm trying to say is I'm not gonna eat this quesadilla.     ",
      "scream": "9/10 It's a damn shame that we never got a live-action ‘Ed, Edd & Eddy' with 90s Matthew Lillard as Ed. A damn shame.  (for those curious, i'd cast young joseph gordon-levitt as edd and deryck whibley from sum 41 as eddy)     ",
      "night-of-the-living-dead": "7/10    Can't believe my FIRST thought when all the zombies entered the house was \"Aw I miss being in crowded spaces with friends :-(\"     ",
      "twin-peaks-the-return": "10/10    Doesn't get much darker than those last 5 minutes. I just wanna leave it there for now and go curl up in a ball.   /:     ",
      "song-of-the-sea": "8/10 Really good but pretty fucked up that this wasn't a movie about their dog Cu     ",
      "the-slumber-party-massacre": "8/10 people just don't say \"fork it over, shortcake\" anymore     ",
      "in-the-mouth-of-madness": "8/10 Definitely had a few expectations going into this knowing it was John Carpenter but dude... what the hell? I was hilariously unaware of how psychological this was. But also so fun. But also so unsettling?? Still processing but I really dig this.     ",
      "trouble-every-day": "6/10 what a weird flick     ",
      "black-christmas": "10/10 The great thing about finding a film that counts as both a Halloween AND Christmas flick is that from now on I have the excuse to watch this twice every year. What an absolute banger of a time. Surprisingly one of the most brilliant takes on domestic abuse I've seen to come out of a horror movie, let alone a slasher! The cinematography is so playful and the editing could not be more perfect. There's a specific scene that uses...     ",
      "dead-of-night-1974": "8/10 \"I died for you doc, why shouldn't you return the favor?\"   Fuuck yes!     ",
      "hellraiser": "6/10 Some cool stuff here and there but Kirsty? Is that the best name they could come up with?     ",
      "inferno-1980": "8/10 Tom Hooper should've gone this direction with Cats.     ",
      "guns-akimbo": "2/10 This is like one of those fake movies you'd see posters of in the background of Drake & Josh. But this one is real. And it's almost unwatchable.  Talked about this extensively on the Karstcast.     ",
      "the-beach-bum": "9/10 This movie converted me into a Zac Efron fan aggressively fast.     ",
      "days-2020": "8/10 Haven't had my patience tested like this since Jeanne Dielman. That's not by any means a jab, this is just one of the slowest, most meditative films I've seen. It's also my first from Tsai so keep that in mind.   For as erotic and intimate as parts of this are, this left me generally depressed from the bleakness. Right now I'm paying closer attention to how I move from one room to the next and what I do in these spaces. I can't say that feels very significant. But as simple as it sounds, it's an awareness I didn't have 2 hours ago.     ",
      "on-the-rocks-2020": "4/10 As a fan of Sofia Coppola, Bill Murray, Jenny Slate, and dark blue color palettes, I could not be more disappointed. Is it a rom-com? Is it a satirical take on a rom-com? What is this?   Usually Coppola's work feels a little off but it's got this unique thing going for it that I can never put into words. It always keeps me interested, it's different! This....huh?? I guess I understand why the \"bad acting\" (up for debate) in The...     ",
      "the-human-voice-2020": "7/10 NYFF  Almodovar's THE HUMAN VOICE, shot in the middle of the pandemic, is a vibrant and expressive look at reflection. Be it a reflection of a past relationship or of your past self. You could argue they're one and the same. It's got AirPods, Phantom Thread on blu-ray, and Tilda Swinton. What's not to love?     ",
      "black-swan": "9/10 Sure as hell isn't Barbie of Swan Lake but it is most definitely a good ass movie.  Talked about this sucker on my podcast! Click here to uhhh listen!     ",
      "barbie-in-a-mermaid-tale": "4/10 Let's cut to the chase, I'm not gonna log all these Barbie movies. I don't wanna do that to all of you. But I will be watching them! So this post serves as an explanation for why you're not gonna get all the logs, nothing more.  All that said, see you on the other side.     ",
      "3-2003-1": "6/10 And so it begins     ",
      "lovers-rock-2020": "9/10 NYFF  This is one of those where you don't fully appreciate what it did to you until it's over. I was craving a rewatch within 30 seconds of finishing it. Or maybe I just wanted to revisit the rich environment McQueen was able to so carefully capture through film. Soaked in shades of orange and hypnotic music, this made me really miss being at parties. I don't even want to think about how beautiful this would be in a theatre.     ",
      "jennifers-body": "8/10 Screamed a minimum of 50 times during this     ",
      "operation-avalanche": "8/10 There's a scene in a car in here that is AS GOOD as THAT car scene in Children of Men. Like it's a scene that's waaay better than it has to be. But it's so good. Great movie??     ",
      "looper": "7/10 Twilight started autoplaying five (5) seconds after the credits rolled and that somehow made more sense than some of the plot points here.   Talked about this puppy on my PODCAST!     ",
      "le-samourai": "9/10 Captivating from the first frame to the last. Am I just saying that because I studied abroad in Paris and miss the thrill of riding a subway? Specifically the Paris subway? Maybe, but a lot of other people seem to really love this so it CAN'T be that!  (I miss public transit)     ",
      "the-conjuring": "7/10 This is a movie about sideburns     ",
      "the-rental": "4/10 Nothing about this makes it clear that Dave Franco directed this but OFCOURSE Dave Franco directed this. That's the best I got and that's the most this gave me to work with!     ",
      "bonnie-and-clyde": "8/10 I imagine Warren Beatty's top and bottom lip are like two magnets repelling against each other because this dude's teeth are visible at all times.     ",
      "dog-day-afternoon": "9/10 It's hard to look at Dog Day Afternoon as something completely unique because every film that came after Dog Day Afternoon that tried to be Dog Day Afternoon stole some technique from Dog Day Afternoon. The title just rolls off the tongue, clearly.   But what immediately stands out for me is the color palette. While maybe not direct with this usage, Dog Day Afternoon is consistently capturing the color white in a way perfectly akin to it's themes. The buildings,...     ",
      "im-thinking-of-ending-things": "9/10    Had to pee for most of this but luckily this movie convinced me that the moment I had to pee happened 60 years ago so I'm good. And also my pants are SOAKED!     ",
      "she-dies-tomorrow": "8/10 If we're talking time-of-day ratings this gets a strong 2:00 AM from me     ",
      "heathers": "9/10    This movie has everything......big fun, christian slater doing a bad jack nicholson impression...a dead gay son.     ",
      "little-shop-of-horrors": "7/10 Rick Moranis walked so Fred Armisen could run.     ",
      "matthias-maxime": "6/10 I enjoy how much affection is on display here, but this really didn't leave me as satisfied as I was supposed to feel. There are some beautiful visual metaphors, even if there are too many of them, and Dolan's performance was vulnerable in all the right ways. But as far as movies that address internalized homophobia, toxic masculinity and mommy issues go, this didn't feel like it was bringing anything new to the table. Maybe I'm missing something! Really sad because scientifically I was totally supposed to love this.     ",
      "bacurau": "8/10 Truly one of the craziest emotional rollercoasters I've been on. I've already said too much, going in blind was the best idea. Udo Kier and Silvero Pereira have the best eyes.     ",
      "my-life-as-a-zucchini": "9/10 This is a sad movie!     ",
      "playmobil-the-movie": "2/10 Absolutely not     ",
      "who-framed-roger-rabbit": "7/10 Looks great for the 80s but this would never happen in real life     ",
      "the-virgin-suicides": "6/10 Probably would have loved this in high school. I really shouldn't compare it to Mysterious Skin because they're both completely different movies doing completely different things but if we're talking movies about teenagers that understand angst and deal with heavier subject matter, Mysterious Skin is a movie that really does the damn thing.   This just felt a little too muddy and drowned out in it's own ideas. Interesting but definitely left me wanting more. I know a lot of people...     ",
      "hands-on-a-hardbody-the-documentary": "10/10 One of the most American movies you'll find. In terms of style, subjects, and deeper themes I really can't think of a more entertaining, hilarious, and (kind of) depressing look at rural America. There's also so much heart in this that you wouldn't expect. Haven't had this much fun in a minute. Why can't Mr. Beast's videos be more like this?     ",
      "ernest-celestine": "8/10 This does more for snow than Frozen ever could     ",
      "stranger-than-paradise": "9/10 Dangerously cool in that it almost convinced me to buy a fedora.     ",
      "never-rarely-sometimes-always": "9/10 Eliza Hittman has an attention to detail that, as proven here, can carry an entire film without words. Not just in the faces but in footsteps, blinks, and obviously hands. Even the smallest of actions speak so loudly. When something otherwise \"normal\" means something, you feel that difference.   There's a specific shot near the beginning when Autumn is laying in the bed after her ultrasound exam. The camera follows her face as she turns to her side, facing away from...     ",
      "an-american-pickle": "7/10 Love the way this movie smells!     ",
      "sam-jay-3-in-the-morning": "7/10 Hilarious and so consistent. Probably my favorite standup special of the year so far! Suuper excited to see what she does next.     ",
      "despicable-me-3": "7/10 If it wasn't obvious, and for anyone who came across this review on the movie's page, I've been watching Illumination movies all weekend. This is the last one. My mind went to some dark places. All I see is yellow, all I hear is Pharrell, all I smell is fart.   Closest thing I can compare the experience of this marathon to is Super Size Me. Nobody should do this. Not for views, not for goofs, not out of curiosity. It's...     ",
      "whered-you-go-bernadette": "4/10 I wouldn't say I hate this. But the more I try and defend it the more I realize this was such an ugly and rushed execution to what could have been something touching. Like what is the Kevin Macleod type score accomplishing? Who allowed those \"documentary\" scenes to go on for as long as they did? It's different! It's interesting! Kinda? But the HIDEOUS end credits sequence was really the final twist of the knife. That bottom centered \"Directed by Richard Linklater\" SCREAMED that even he wanted this movie to just wrap itself up. Is a shitty visual aesthetic enough to ruin a movie? Apparently!     ",
      "a-new-leaf": "8/10 So funny. While this may be her directorial debut it feels like such a perfect bundle of everything I love about Elaine May. Hilarious, clever, a little sad, and different. So different. I'm not alone when I say for the hundredth time that May was way ahead of her time, but even if she was making movies today (which apparently she might be doing soon?) nobody could come close to replicating her work. Heavens!     ",
      "big-eyes": "5/10 Big Eyes more like Big Little Eyes?? Because of all the LIES in this movie??? And Amy Adams is also in Sharp Objects which is always in the \"related\" section of Big Little Lies??? There's a joke somewhere in there.  Talked about this on the podcast!     ",
      "beetlejuice": "7/10 Much better than I remember! First time I saw this was in 7th grade and all I remember about that experience was going \"I can't believe they're playing 6 foot 7 foot by Lil Wayne!!\"     ",
      "the-favourite": "9/10 Yorgos' films are dangerous. I say that because this man knows how to make an ending...like, a really good freaking ending. An ending so good it could make you forgot about earlier scenes in the film that you thought were just okay. But something I've come to learn about this guy is that once you have this full grasp on the story and you see the piece as a whole, everything seems to hit you just a bit better. In...     ",
      "scenes-from-a-marriage": "9/10 [theatrical version]   Damn. Really wish I caught the 5 hour version first because I would have loved to sit and endure each and every detail of this relationship. Very rare for me to think something like that after spending nearly 3 hours with a movie that is entirely conversations, but Bergman's way of capturing the pain in these characters was too real to not feel completely immersed. Liv Ullmann has so much truth in her performance, specifically in the Paula chapter. Nothing captures the magic of the movies quite like divorce!     ",
      "night-on-earth": "9/10 Rosie Perez is really good at saying \"fuck you\"     ",
      "cry-baby": "8/10 Let me get this straight. NONE of you were gonna tell me there was a movie where Willem Dafoe spanks Johnny Depp's ass and goes \"It's beddy-bye time\" ???     ",
      "before-midnight": "7/10 Jesse just needs to go sing \"Being Alive\" in a bar in NYC and call it a day     ",
      "before-sunset": "10/10 Will be talking about this more in my monthly watch vid and honestly maybe in it's own vid someday so I won't get TOO into it here.  My heart was beating basically the entire time. Fury Road and this are equally as thrilling. Fuck it, I said what I said! Fifty percent of that is because of how all your morals slowly go out the door and you lose yourself in this absolute mess of a relationship. The question \"is...     ",
      "female-trouble": "8/10 Went down a rabbit hole and watched (I think) every John Waters interview I could find on Youtube and even read a few chapters of his book ‘Shock Value' thinking that'd prepare me for one of his films. That said, nothing can prepare you for your first John Waters film.     ",
      "toy-story-4": "9/10 This is the best thing Pixar has made in years. Great humor, great animation, so much heart (that didn't feel forced). Warmed my heart to know that if they want to capture the feeling of their classic films, they totally can. Also how is nobody talking about how well they used the score? Full scenes where the emotions are fully driven by the music and barely any dialogue. I am so happy about this.  More thoughts on the next Karstcast!     ",
      "journey-to-the-west-conquering-the-demons": "6/10 Was messaging someone on Hinge for 50% of this but I loved the monkey!     ",
      "anomalisa": "10/10 I was basically held at gunpoint in the comment section of my stop-motion video to watch this and boy am I glad I did.  Sorta at a loss for words and anything I say about it won't really be able to really sum up how much I enjoyed it. Slapping a rating on it feels dumb. Felt so real and honest and just perfect in every way. Just gonna leave it at that.   GIRLS JUST WANNA HAVE FUN!     ",
      "tommy": "7/10 One giant Oompa Loompa segment but that is by no means a bad thing     ",
      "before-sunrise": "10/10 Deciding to watch a film about a romance that originated from riding public transit is a questionable decision in the middle of a pandemic. But don't let that stop you because this was arguably the best thing I've watched in quarantine. Jesse has a monologue in the third act where he talks about self-hatred and how so many people hate themselves because they're stuck with their mannerisms all the time, \"I've never been out bowling if I wasn't there, ya...     ",
      "winter-light": "8/10 While Schrader's film was heavily influenced by this I think they're on two completely different pages. For one, this doesn't have a magical mystery tour. Secondly, I'm tired and am gonna go to bed, actually.     ",
      "popstar-never-stop-never-stopping": "10/10 Fuck it, 5 stars for this movie. It's hilarious. Had a bad day, made it better. Fuck it. FUCK IT! WHATEVER!     ",
      "the-40-year-old-virgin": "4/10 Somebody needs to tell Judd Apatow \"no\"  Talked about this in depth on my podcast, the Karstcast!     ",
      "mysterious-skin": "10/10 So violent and so innocent. I honestly can't remember if Araki had this many shots of characters looking directly into the camera in his other work but that choice is working stronger than ever here. What I really appreciate about this is how he's capturing the manipulation in all forms of abuse. His use of shoegaze also does so much as far as romanticizing not these specific events but adolescence. I just felt very close to Neil by the end, as though I was one of those little moons orbiting around him. I'll never forget about this movie.     ",
      "a-mighty-wind": "7/10 Fred Willard could do absolutely nothing and still be the funniest person in the room.     ",
      "lava-2014": "8/10 Watched this on an iPhone while inhaling two rubbery 75¢ hot dogs without condiments in an Ikea parking lot.     ",
      "a-nightmare-on-elm-street": "7/10 Talked over the movie and annoyed everyone in the room for the entirety of this except for when Johnny Depp had the crop top on. Great time! Anyways can't believe I have almost 50k followers on this app.     ",
      "totally-fucked-up": "7/10 Definitely fucked up to a CERTAIN extent but TOTALLY fucked up? Gotta think about it     ",
      "the-living-end": "7/10 Been meaning to dive head first into Gregg Araki's work for awhile now as he is one of most important figures in LGBTQ cinema. All I really know going into this is that his work is known for being unapologetic, rebellious, and dark. This was all of that and done at such a chaotic level that I wasn't prepared for. Can truly say I don't know a film that uses punk better than this. It goes so much further with...     ",
      "dead-man": "9/10 There's a certain haziness to the films of Jim Jarmusch that I've come to expect from my limited experience with his work. That haziness is usually broken up with a sense of wit that grounds the film out of necessity for the narrative.   But in Dead Man, a film widely regarded as his masterpiece, that haziness is never interrupted, if anything it subtly progresses into a state of tedium. It explores Western culture through a perspective somewhere between life and death, a perspective indescribable but clearly understood by Jarmusch.     ",
      "the-birdcage": "9/10 \"HOW BOUT THOSE DOLPHINS?\"  I am very obsessed with everything about this. Fully aware this is a remake but I think Elaine May is the only person that knows how to get the most out of a character. Definitely broke the record for most times I've gasped while watching anything.     ",
      "spaceballs": "7/10 Broke: nature is healingWoke: It's Mega-Maid! She's gone from suck to blow!     ",
      "o-brother-where-art-thou": "8/10 Why is Stephen Root in, quite literally, every movie ever made?     ",
      "eurovision-song-contest-the-story-of-fire-saga": "4/10 Come on ABBA, just let Pierce Brosnan join the band.     ",
      "my-neighbors-the-yamadas": "9/10 This may seem like the Ghibli film doing the least but it just might be doing the most. There's a lot of bias going on here. For one, this art style is extremely up my alley. I was honestly a little doubtful going in that such a simplistic approach wouldn't be able to carry an entire feature. But there's a lot of variety here. A lot of creative choices that'll convince you all animated films should look like this from...     ",
      "fire-2015": "9/10 It's June 28, 2020 and it's a Sundeey.     ",
      "bill-burr-im-sorry-you-feel-that-way": "9/10 Sometimes Bill Burr is really awful but sometimes he's really good and most of this special is really good. His best special probably!  \"Sir please put your seatbelt back on.\"     ",
      "coffee-and-cigarettes-2003": "8/10 \"Now that I've quit..I can have one\"  Earlier today I watched an interview with Ethan Hawke where at one point he said \"What would happen if people could really actually see how boring, funny, sublime, romantic, elegiac, and stupid their lives are...\"   Writing that out makes that seem a lot less meaningful than when I heard it but I think it pairs really well with this film. I see myself revisiting this a lot.     ",
      "this-is-the-end": "7/10 Not sure what I was on when I gave this a single star but we all make mistakes I guess!     ",
      "indiana-jones-and-the-last-crusade": "10/10 70mm  I think this is better than Raiders. No, it is. It definitely is. I think a really interesting part of this film is how well it shows Indy's weaknesses and how he contradicts himself all the time. I think you actually see a real change in character from beginning to end with this one while remaining incredibly entertaining. The theme for this one will also always find a way to creep it's way into my mind and stay there...     ",
      "pineapple-express": "6/10 This movie is 9 hours long     ",
      "where-is-the-friends-house": "10/10 Happy birthday Kiarostami!   I have a huge soft spot for films that understand the purpose of children in society. Because so often it feels like they are looked at as mirrors of who we once were that we have the ability to mold rather than a part of humanity we could learn from. A few films that immediately come to mind are Truffaut's The 400 Blows and Pialat's L'Enfance nue. While sure, Where Is My Friend's House fits in the...     ",
      "the-king-of-staten-island": "6/10 Fantasizing about seeing Pete Davidson and Alma Har'el at the same party, taking their hands and saying \"Have you two met? Please make a movie together!!\"   Listen to my \"full\" thoughts on The Karstcast Moviecast.     ",
      "bridget-joness-diary": "6/10 Hugh Grant's hair is a character in itself.     ",
      "the-graduate": "9/10 Almost forgot to post this but I recently rewatched this for my podcast and you can listen to my full thoughts here.  I was worried this wouldn't hold up on a rewatch but it really does. Feels like the first time again every time I watch it. The cinematography is so beautiful, spaces are either too big or too small for Benjamin. Just wanted more Mrs. Robinson. And more than just just three Simon and Garfunkel songs that play over and over again. We get it, you're going to Scarborough Fair.     ",
      "da-5-bloods": "8/10 I hope this makes sense: the colorful, psychedelic imagery in the poster wasn't really in the film, but I still felt that. Ya know? Spike Lee is so good at giving you a physical reaction.     ",
      "casper": "4/10 this but they all have thick new york accents     ",
      "magic-mike": "6/10 After learning that Refn almost directed this I can't tell if that would have been significantly better or worse. I'm torn on this and that star rating is bound to fluctuate. On one hand Soderbergh's static style adds emptiness and really drives home the film's themes of invalidation. I think that's the right word to describe it.   On the other hand the direction leaves no room for empathy and does NOT do the performances any favors. Specifically referring to the...     ",
      "wisdom-teeth": "7/10 so satisfying to listen to, so painful to watch     ",
      "macgruber": "5/10 Talked about this on the most recent episode of my podcast.  (that text up there is a link)     ",
      "13th": "9/10 This is an AMAZING documentary, please watch it.     ",
      "shirley-2020": "8/10 The only thing stranger than Josephine Decker's work is Michael Stuhlbarg's face.     ",
      "i-am-not-your-negro": "8/10 Essential. Plenty of other great reviews for this floating around that I can't add a lot to so I'll use this space to say please consider donating to as many organizations and signing as many petitions as you can.    click here for resources     ",
      "belly": "8/10 Had tickets to see this in 35mm back in the fall but couldn't make it for reasons I completely forget. Having finally seen it I can now say I definitely wouldn't have forgotten about that night if I ended up going. I've never seen lights used like this before, felt like I was discovering a whole new way of making movies.   Anyone who says the only noteworthy part of this film are the first 10 minutes (don't get me wrong, great opening) hasn't seen the last 10 minutes.     ",
      "chicken-little-2005": "6/10 Expect a 2 and a half hour youtube video on Chicken Little at some point in the future because this movie is so much more insane than I remember     ",
      "the-lonely-island-presents-the-unauthorized-bash-brothers-experience": "6/10 Paused it halfway through to order the Popstar steelbook.     ",
      "tour-de-pharmacy": "8/10 Backflips are super rare on the tour, but they do happen.     ",
      "howls-moving-castle": "9/10 When Howl unintentionally dyes his hair orange. Hey man we've all been there!     ",
      "laura": "10/10 Won't lie, had a great time watching this. Gasped with every turn this film took. Not one bad performance but Vincent Price really is just THAT dude, ya know? The camera movement, the use of space, it all comes together into an ending that left me completely on edge. Not to mention the fact that Laura really is one of the most fascinating characters I've seen, especially for this time period. I'm sure there are actual reviews that actually go into depth about that. Too tired to add more sowwy 🥴  I wish Vincent Price were still alive so he could get into podcasting.     ",
      "bonjour-tristesse": "8/10 While I may only be two films deep in an expansive career, it's clear as day that Otto Preminger was a filmmaker years ahead of his time. His framing and use of space took full advantage of what the wide screen format had to offer and that other filmmakers weren't able to fully realize quite yet. I still don't believe the black and white sequences in this film are from 1958. While Anatomy displayed his ability to use these framing...     ",
      "anatomy-of-a-murder": "9/10    Absolute hypnosis. The rhythm of the line deliveries in every scene is almost magical. Too many examples to choose from—seriously, I could literally pick any moment—but there's an interaction in the final 15 minutes where something the audience already knows is revealed to everyone else in the courtroom and it still manages to come off just as shocking to us as it does to those in the film. That moment works because the nanoseconds in between every word in this...     ",
      "taxi-driver": "9/10 jazz music? rewarding ending? COLORS? Yeah, this is great.     ",
      "the-lord-of-the-rings-the-return-of-the-king": "8/10 Still got some day left, might squeeze in Sátántangó     ",
      "they-live": "7/10 real eyes realize real lies........     ",
      "a-hard-days-night": "7/10 George was the best Beatle, end of story     ",
      "film:367810": "9/10 Honestly hilarious and unfair how good this is     ",
      "paranoia-agent": "10/10 Feeling pretty blown away by this. Satoshi Kon's work is some of the most terrifying to me because of how he effortlessly creates a space in your head. ‘Internal' is probably the best word to describe it and while that may seem intriguing, any of his films would suggest the opposite. With ‘Perfect Blue' and ‘Paprika' he accomplishes so much with so little, taking high-concept ideas and boiling them down to their most electrifying parts. That said, you can imagine...     ",
      "barking-dogs-never-bite": "6/10 On my hands and knees BEGGING Bong to make a film with a jazzy score like this again.  Sadly this is definitely the weakest I've seen from him. These ideas he throws around in each scene are interesting to watch but they also don't feel like they're doing anything some of the time. One of the best things about a Bong Joon-ho film is that you know none of that time will be wasted. But this could have been cut...     ",
      "not-too-cheerful-1976": "8/10 Thank you to my friend Jon for introducing this to me. Funny, colorful, clever, what's not to love?     ",
      "paprika-2006": "8/10 For as vibrant as this film is with its imagery this is dark as hell, which is something I suppose is a norm for Satoshi Kon's work.  He looks at animation in a different way than what I'm used to. Sure he understands the possibilities that come with the medium in terms of interesting character design and abstract locations. But he also understands the ways at which you can use surrealism in a more naturalistic way. For as confusing as...     ",
      "with-a-documentary-and-concert-film-about-sylvan-esso": "8/10 Finally an excuse to talk about my favorite band on Letterboxd :) If you've been following me on Instagram over the last 2 years you've most likely seen a few IG stories with a screenshot of me listening to Sylvan Esso. Since my freshman year I've been weirdly obsessed with this duo. No other music feels like a warm blanket the way theirs does. I love the band, I love both the side projects from each member, love their album...     ",
      "the-lady-from-shanghai": "9/10 Kinda loved this? Funnier than I could have ever expected, Orson Welles' Irish accent definitely wasn't supposed to funny on purpose but it was enjoyable nonetheless. I think the discombobulating tone of it is very effective in creating the dreamy state it wants to put you in. A dream that turns more into a nightmare with every turn. What I'm saying is yeah I‘ll acknowledge it's \"messy\" I think it's controlled and captivating in the process.Glenn Anders as Grigsby is nothing short of a great time, what a character. Yeah this rules!     ",
      "mother-2009": "9/10    Anytime a character hits their head in a Bong Joon-ho film I feel it in my entire body.     ",
      "rhubarb-2020": "9/10 Not gonna review my own short film but my mom and dad just watched. She gives it a simple \"aw!\" and he gave it a \"well there's GOTTA be a sequel!\"   Check it out!     ",
      "the-naked-gun-2-the-smell-of-fear": "6/10 Probably the funniest sex scene I've ever seen and some other really great bits here and there but overall very disappointing /:     ",
      "on-the-waterfront": "7/10 Brando's performance really did live up to my expectations. Not only ahead of its time but also capable of surpassing dramatic performances today. I can feel the rage boiling underneath this film which is why I see it staying with me for awhile. The ending felt much more spiritual than I was expecting. Lot of religious metaphors that I couldn't pick up on my first time around but that I look forward to revisiting. I don't really know how I...     ",
      "shes-gotta-have-it": "7/10 That black and white imagery is something else! Spike Lee captures the human body in ways I didn't know were possible. Wish this exploration of love had more intimacy. Never had a real grasp on Nola as a character. This has to be one of the most confident debuts. VERY excited about Da 5 Bloods coming to Netflix soon.     ",
      "monkey-up": "1/10 don't ask     ",
      "baby-driver": "9/10 Everything I wanted and more.     ",
      "allegiant": "1/10 Halfway through this I got irrationally upset. This Ansel Elgort marathon was for a video (obviously) but it still felt like such a waste of time. There are so many things I've wanted to watch and read with the time I've had in quarantine. So much schoolwork this week that I've put 70% into rather than 100% for the sake of making time to get through these films. Anytime you get to a point where you're watching a movie and...     ",
      "jonathan-2018": "3/10 There's something I appreciate about this movie. An overlong shitty Black Mirror episode? Sure. But judging by how they went about telling it, the filmmakers clearly, uh, cared. Just wish they did more to make me do the same. The color palette of the poster isn't the only thing this has in common with your typical sleep podcast.     ",
      "men-women-children": "4/10 20th Century Women but with men and children. And also without everything good about 20th Century Women. This is nothing like 20th Century Women. Ya know what just go watch 20th Century Women.   This is an awful review but at least it's more interesting than the movie itself!  *No ratings on any Ansel movies for now, don't wanna spoil my video*     ",
      "carrie-2013": "4/10 Watching this before watching the original (I just didn't have the time) is gonna go down as one of the worst things I've done. But hey, what a killer soundtrack brought to you by the Vampire Weekend Pandora station!!     ",
      "november-criminals": "3/10 I think that pissed off dad spoke for all of us when he screamed \"WHY DO YOU HAVE A PAGER??\" in Ansel's face.     ",
      "parasite-2019": "10/10 Our expectations were high but HOLY FUCK     ",
      "billionaire-boys-club-2018": "2/10 I wonder how it feels to be....uh...(checks notes) James Cox. Directing a blatant Scorsese ripoff and making $287 opening weekend, then having to watch Todd Phillips make over a billion dollars and getting nominated for a bunch of Oscars after pulling the same trick.     ",
      "insurgent": "2/10 Not doing star ratings for the remaining Ansel films I gotta get through.   You mean to tell me I have to watch ANOTHER Divergent film after this?     ",
      "bad-education-2019": "8/10 Cory Finley is Yorgos Lanthimos in day mode and that's a great thing. After Thoroughbreds I was anticipating what he'd do next and this makes me super excited for the NEXT thing he does. His tone is starting to form a voice of it's own in Bad Education, balancing crime and humor in a way that never gives you a moment to breathe.   The specific shade of blue in practically every shot of this film gives off a specific feeling...     ",
      "hustlers-2019": "8/10 A movie that knows it's the shit. I WANNA MAKE LOOOOOVE IN THIS CLUB     ",
      "divergent": "3/10 I remember seeing the poster for this in high school and thinking \"I am staying as far away from this as possible!\" Attractive people in a generic stance with a generic title in front of a generic sci-fi background? AND it's an adaptation of a YA novel? When I realized Ansel was in it I immediately went \"Oh come on!\"  So this is simultaneously better than I expected and as watered down as expected. I'm trying to be a bit more...     ",
      "chinatown": "9/10 The most interested I've been in a movie in a long time, I was sucked in with every scene. The screenplay does a fantastic job at giving you just enough, it's as though each individual word was carefully thought out. No wonder it's regarded as one of the best screenplays of all time! I've also decided to have the unpopular opinion that Jack Nicholson is one of my favorite actors! God damn is he good in this movie. Loved this!     ",
      "the-fault-in-our-stars": "3/10 You know you made something awful when Laura Dern, Willem Dafoe, AND Charli XCX can't save it. No better way to start an Ansel Elgort binge than by realizing one film deep that maybe it really is just his looks.     ",
      "the-naked-gun-from-the-files-of-police-squad": "9/10 \"I've got nine more\" is one of THE funniest lines. As a diehard Airplane! fan I can't believe it took this long to watch this.     ",
      "tomboy-2011": "8/10 How does she do it???  Céline Sciamma has this really weird/specific thing about all her movies that makes anything feel like it's on fire. Like there's this one specific shot in here where Mikäel is running down a path but the only thing in focus is a leaf and everything (besides Mikäel) is completely static and somehow it felt so LOUD. Lots of moments like that where I try and picture anyone recreating the shot but not capturing that same energy....     ",
      "tootsie": "8/10 One of my mom's favorite movies, because of course it is! Hilarious script, great performances all around, and Bill Murray!     ",
      "magnolia": "8/10    Amazed I NEVER knew about the frog thing. Like that was never spoiled for me. That was an amazing twist. Can you even call it a twist? Is this how people felt when Darth Vader said that thing? That was such a 2020 thing to happen. I screamed \"FROGS???\" to an empty room.     ",
      "little-fires-everywhere": "8/10 Was a huge fan of Celeste Ng's book so I was pretty hyped for this. First episode was not promising and it didn't get a lot better /: Just felt a little too on the nose compared to the subtleties of Ng's writing. My family really liked it tho! Worth a watch I guess!     ",
      "mikey-and-nicky": "9/10 No offense to my good buddy Jeff, someone who considers Ishtar to be his favorite film of all time, but this is a LOT better than Ishtar!     ",
      "national-treasure": "7/10 Far from the worst movie of all time but it definitely has the worst changing rooms.     ",
      "blue-velvet": "10/10 Embarrassingly my first time. A view of suburbia and sadomachochism I didn't think was capable of existing under the same roof. A weirdness that only works in the context of the normal, and also the other way around. What a normal movie.     ",
      "missing-link-2019": "6/10 Too harmless to get upset about but too harmless for its own good.     ",
      "martyrs": "8/10 Was trying to figure out if I should watch this or Missing Link. Ya know what? I'm gonna leave it at that.     ",
      "parade": "9/10 For someone who starred in all of his films, Jacques Tati always made it clear that he is one of the most selfless filmmakers of all time. Parade proves his films were never about him, or Hulot, or anyone specifically. They were about everyone and they were for everyone. They questioned the role of entertainment while entertaining. This idea is finalized in this last film of his not through words, not through a narrative, but through reds, yellows, blues, and pure joy. A humble end to a beautiful, overlooked career.     ",
      "a-woman-is-a-woman": "8/10 I really love the poster for this movie. the circles, the reds, the text all spaced out like that, the white background. MUAH!The movie? Also really nice to look at. I want to know what PTA has to say about it because stylistically it is clear as day that Punch-Drunk Love was directly influenced by this. The lens flares, the wide shots, the blue suit and red dress.It took me a while to calibrate my brain for this...     ",
      "good-burger": "5/10 Dexter is a moron     ",
      "jimmy-neutron-boy-genius": "4/10 Seriously? One of the best things ever made.     ",
      "chris-delia-no-pain": "4/10 Embarrassingly enough, Chris D'Elia has IN MY OPINION the funniest podcast out right now. Only podcast that I listen to as soon as it drops and it always cheers me up a bit. That said, his stand-up and his podcast are like two different people.   Chris is best when he is working out material on the spot. That's why the podcast works so well and also why when I caught him at the Laugh Factory in LA it ended up...     ",
      "jules-and-jim": "7/10 I love how excited this movie is about how it works under its own rules. Truly unapologetic with it's style which is probably why it has that status of being one of the greatest to come out of the french new wave. Won't deny that it doesn't feel as though it sticks the landing. It also works at a very fast pace and trying to process all of the beautiful writing scattered throughout gets pretty overwhelming. That's more at the...     ",
      "tiger-king": "6/10 Not a doubt in my mind that Jeff Lowe doesn't take off the Oakley flat brim hat / black bandana combo during sex.  This docu-series is equivalent to a bag of Funyons.     ",
      "uncut-gems": "8/10 Not at all what I was expecting. I mean I knew it'd be tense and claustrophobic and well-acted (made a whole video on Sandler, he better give a great performance) but what I didn't expect was how...huge this film is.  The Safdie Brothers have historically tackled large themes with simpler plots and with a story this complex, despite a clear mastery of the techniques they're known for, this feels like new territory. Uncut Gems is an inSANELY well thought out story with dozens of storylines working together (almost) perfectly. Feels like the darkest fairytale I've ever experienced.     ",
      "world-of-tomorrow": "8/10 I had lunch today :-)     ",
      "harold-and-maude": "8/10 Cmon I can't be the only one who did a little \"wow\" when Harold first spoke and his voice was way deeper than I thought it'd be     ",
      "the-fits": "9/10 Holy shit???   I could leave it at that and it'd honestly be a perfect summation of my thoughts on this but alas this film deserves better. What a great piece of filmmaking. Every aspect is demanding your attention leaving you hypnotized 15 minutes in, if not sooner. Now I could be alone on this, but you have absolutely no clue what's going on for most of the time. But thanks to the score, cinematography, and performance by Royalty Hightower (honestly...     ",
      "obvious-child": "7/10 Jenny Slate makes a poop joke, I smile a little bit, and that is what the movies are all about!     ",
      "big-fish": "7/10 Everything in Big Fish feels, well, big. In Bloom's stories the greens are greener, the whites glow, the camera never stops moving. When the camera isn't moving we are in some strange angle. Whether that be in the corner of a house, looking directly down at the subject, or perhaps perfectly symmetrical with everything else in the frame. Every moment in Bloom's life feels bigger than it actually is. Unlike Forrest Gump (because the comparison feels inevitable) these moments aren't...     ",
      "dracula": "4/10 deliciously dark atmosphere but not much else     ",
      "the-wicker-man": "8/10    The disturbing nature of those last 10 minutes doesn't fully set in until it's over. For some reason, as inevitable as the ending may seem for the entire movie, you still feel like there's a chance of making it out. This is hilarious too. Think I loved it. I also think folk horror is officially my \"thing\".     ",
      "cars-3": "4/10 Lavender Lamborghini, roll up in a blue bikini     ",
      "green-room": "6/10 Liked this but super underwhelmed. Great gore and a few intense scenes where you really have no idea where they're going. But for a film that relies on punk as a core part of it's personality, they didn't really use it a whole lot? It just felt like a way of establishing an aesthetic that never felt fully utilized. The politics were there but the energy just wasn't.   Watched with some Twitter friends through Netflix Party! Great time!     ",
      "fight-club": "9/10 Well it's no Zodiac     ",
      "cars-2": "2/10 I have managed to avoid Cars 2 for NINE whole years now. If it weren't for something I'm working on I genuinely don't think I ever would have gotten around to it. Now having finally seen it, I can safely say this was one of the bigger wastes of time and, not to be dramatic, one of the most disappointing choices to happen in the film industry. Here are three reasons why:  1. Pixar is THE animation company. There are certainly...     ",
      "very-ralph": "4/10 Started off as a fascinating glimpse into the life of a man who I've personally found to be rather mysterious. The jazzy soundtrack combined with the way at which they went about describing Ralph's upbringing was so sleek it made me feel sexy just for watching it. But then it repeats everything it already stated for about an hour. We get it, the guy liked not just fashion...but movies too! Ralph wants you to know he goes through his own creative struggles even at his level of success, but it's hard to hear him clearly when his own dick is in his mouth.     ",
      "forrest-gump": "6/10 If this took place now Forrest Gump would accidentally cure the coronavirus or some shit.     ",
      "stop-making-sense": "10/10 SAME AS IT EVER WASSAME AS IT EVER WASSAME AS IT EVER WASSAME AS IT EVER WASSAME AS IT EVER WASSAME AS IT EVER WASSAME AS IT EVER WASSAME AS IT EVER WASSAME AS IT EVER WAS     ",
      "the-swimmer": "9/10 Me at the beginning of the film: Oh to be Burt Lancaster prancing through the woods in only a swim suit...  Me by the end: Hey nevermind!     ",
      "hardcore": "8/10 Being that it's 2:30am and this is my second Paul Schrader film of the night I'd much rather sleep on this and try to write something in depth in the morning. On the other hand I'm not gonna be able to sleep if I don't get some sort of thoughts out there now. More terrifying than it is thought-provoking, oh look I'm already contradicting myself. The subtlety I've come to expect from Schrader's critique(?) on religion was non-existent here. Not...     ",
      "tom-segura-ball-hog": "10/10 Got really into Tom's standup this last year, specifically ‘Thrilled' and ‘Completely Normal'. This definitely feels like a different side of him in a mostly terrible way.   On one hand he gets a lot more vulnerable and insightful than he usually does, especially in the second half, which is weirdly refreshing. On another, specifically in the first 30 minutes, he gives into to the lazy ‘Triggered' type of comedy that feels wildly unoriginal and unfunny. It's not like Tom never...     ",
      "horse-girl-2020": "4/10 yeah, anyways!     ",
      "onward-2020": "8/10 How is NOBODY talking about all the Indiana Jones references??? I mean SO many!!! This was great, even coming out of Pixar. It only feels like a \"generic animated kids movie\" because of Chris Pratt's voice acting. Besides that everything about this feels so original. Honestly really sad that the release was so overshadowed by everything going on, especially considering maybe it's the kind of movie we all need right now? /:     ",
      "kicking-and-screaming": "8/10 It's practically a crime that Baumbach was allowed to keep making movies after making something about pretentious 20 year old men who happen to be pretty redeemable.  But what does that say about him as a writer! As a senior film major with an unpredictable future who just made a video using philosophy to talk about Spongebob, I really did enjoy the hell out of this.     ",
      "bojack-horseman-christmas-special": "8/10 Reason I haven't logged a lot of movies this week is bc I've been catching up on this beautiful little thing (the whole series, not the xmas special.) As usual I'll elaborate more on my podcast but that's gotta be one of the best finales ever I mean come on.     ",
      "hot-fuzz": "10/10 Line delivery was invented when Olivia Colman went \"Nothin' like a bit of girl on girl!\"     ",
      "waves-2019": "6/10 Exactly what you'd expect from a movie to play Kanye, Kendrick, Tyler, Cudi, Frank Ocean, Chance, Radiohead and Animal Collective all in one movie. The first half of this film is literally so chaotic but in a really good way. The opening credits are sick, but I can't tell if that's just because I like Floridada by Animal Collective. And that's how I felt about pretty much most of this film. Do I like this or is it really just...     ",
      "saint-frances": "8/10 One of the most charming and midwest films of the last few years. Fresh and egoless take on a necessary subject. To any NY and LA readers out there, go see it this weekend! Not just saying this because Alex Thompson helped me get equipment for Keychain. (thanks Alex!)     ",
      "the-fly-1986": "7/10 It's movies like this that bring people together.     ",
      "pete-davidson-alive-from-new-york": "7/10 Pete is a really good comedian, can't wait for him to eventually write good jokes     ",
      "yesterday-2019": "6/10 two hours? really?     ",
      "okja": "7/10    That last shot might be one of the coziest things I've ever seen but it still couldn't bring me back from how sad I was 10 minutes earlier. That kinda summarizes my thoughts on Okja as a whole. A lot of heart and precision in every scene, but do all these carefully crafted scenes work when you put them together? I'm not gonna say no, but it could've been smoother. Another great film by Best Director, Best Screenplay, Best International Film, and Best Picture winner Bong Joon-ho!     ",
      "downhill-2020": "2/10 Logged this and Force Majeure back to back because I watched them back to back, meaning this review will be seen more than my review for FM. I spent a really long time writing up an in-depth analysis of Force Majeure so I'm gonna use this review to redirect your attention to that one. Once again, spent a lot of time on that analysis so go easy on me. Haha thanks!     ",
      "force-majeure-2014": "8/10 the dad looked like nakey jakey     ",
      "spring-breakers": "8/10 I don't think this is as smart of a film as a lot of people think, nor do I think Korine was aiming for that. It's just aged like fine wine and encapsulates a nightmarish ambience that I didn't know I was afraid of until watching it.     ",
      "trafic": "8/10 *Tati edits together 5 minutes of people picking their noses in their cars*me: fantastic!     ",
      "lady-bird": "10/10 Yeah this film is awesome. Just gonna leave it at that.     ",
      "the-life-aquatic-with-steve-zissou": "9/10 After hearing about this for the past few years and seeing bits and pieces on TV I finally got the time to sit down and see it in full. So conflicted over how to write a review for it but if I'm going to give my general reaction I really really liked it. I think the costume design is so cool and the whole world built around Steve is so beyond ideal. I also think it's take on mental health...     ",
      "birds-of-prey-and-the-fantabulous-emancipation-of-one-harley-quinn": "6/10 ???Birds of Prey ends with 20 minutes of colorful and flawlessly choreographed action. It says \"fuck you\" to traditional comic book endings and leaves you feeling like you actually did see a movie take that style in a fun and unique direction. Unfortunately almost everything before those last 20 minutes is a typical messy and heartless superhero film covered in glitter and empty eccentricity. The highs of this make me excited for another Harley Quinn film (if that happens)...     ",
      "stranger-by-the-lake": "8/10 The timing of me watching this and also committing  to growing a mustache could not have been worse.(this was sexy, scary...and sad!)     ",
      "portrait-of-a-lady-on-fire": "10/10 You ever find yourself staring at a bonfire? Just zoning out and watching the flame change every second, feeling the heat, the energy, the anger, the tension, you get what I'm saying. It's a beautifully hypnotic thing, and that's exactly what Portrait of a Lady on Fire is. The only difference being that this brought me to tears in ways a bonfire never could.     ",
      "brittany-runs-a-marathon": "3/10 I wish I liked this more, I mean it's practically on hands and knees begging for me to love it. It's trying so hard and that's why it feels so boring. The choice to go handheld in certain scenes was nice, but aside from that it feels like this made all the wrong choices.     ",
      "the-staggering-girl": "4/10 Guadagnino is so good at capturing that first time feeling. In Call Me By Your Name I remembered the first time I was in love, Suspiria felt like the first time I felt fear. In his latest short, it reminded me of the first time I was bored out of my mind.     ",
      "sonic-the-hedgehog": "5/10 Oh boy....     ",
      "honey-boy": "8/10 Last year it was Ethan Hawke, this year it's Shia (so far). One of the most powerful performances I've seen in awhile. Agh. Yeah. Hm. Wow. Glad I exchanged my Velvet Buzzsaw ticket for this. You people are gonna eat this shit up.     ",
      "the-grand-budapest-hotel": "9/10 You ever just...pregame for a trailer?     ",
      "buffalo-66": "10/10 Caught this in 35mm and just want to get it out there that nothing has ever looked this good on film, can't imagine seeing it any other way.This blends traditional filmmaking with new wave elements and feels like nothing else out there. Everything that happens after the bowling scene is so vulnerable. Vincent Gallo seems to have a relatively toxic fanbase (for the most part) and from what I know about him I can't say I'm a huge fan...     ",
      "daughter-2019": "10/10 There is much to appreciate about this and I would LOVE to see handheld being used in more stop-motion projects but I felt more confused than moved /:     ",
      "nefta-football-club": "10/10 My pick for best live-action short! Funny and clever.     ",
      "cat-people-1982": "7/10 Everybody involved needs to get laid! I'd also like to say, the room temperature is never something I considered when watching a movie until I saw this. the ac was blasting and I was freezing for a good portion of it, and for a movie as humid as this I feel like I didn't get to fully embrace the atmosphere it was going for. Is that weird to say?     ",
      "the-bling-ring": "7/10 not a single good shot or outfit in this entire thing     ",
      "hair-love": "7/10 🥺     ",
      "north-by-northwest": "7/10 I love what Hitchcock does visually here. Also probably his silliest (that last cut is hilarious.) Isn't this essentially just The 39 Steps with more creative freedom? He even mentions the number 39.     ",
      "honeyland-2019": "6/10 By the end of Honeyland, a documentary from 2019, I thought, \"Huh, they should really make a documentary about this.\" I didn't know where this was going or more importantly why it mattered. Then the rest of the film happens and Honeyland quickly starts to feel more universal. I felt urgency in Hatidze's life as the story progressively sank into a very depressing ending. It's a weird little doc that I admired and could feel the warmth of but didn't...     ",
      "paul-schrader-man-in-a-room": "6/10 I'm pretty positive First Reformed is my favorite film of the decade and one of the more influential films I've ever seen, so to get this glimpse into the process and mindstate that was behind it makes me feel very lucky. Paul Schrader is such a genius but such a goof at the same time, I love it.   \"How do you push the viewer away in a way that makes them lean in?\"     ",
      "kitbull": "6/10 🥺 WAHHH     ",
      "little-women-2019": "9/10 The big stupid grin I had on my face for basically the entire first half hour. I noticed it and was like \"oh wow I should not be smiling this hard I look weird\" and 5 seconds later went back to smiling. The love and care that is oozing out of this film gives it this dreamlike feeling that I haven't felt since, well, Lady Bird. Overwhelmed really is the best word to describe my initial reaction when it ended...     ",
      "water-lilies": "8/10 synchronized swimming is so underappreciated     ",
      "jojo-rabbit": "9/10 Unexpectedly phenomenal. An absurd amount of passion and heart put into a film that shouldn't work at all but miraculously does. Something no filmmaker besdies Watiti could pull off in this way. I'd go from embarrassingly scream laughing at Hitler jumping out of a window to being on the verge of tears. A breath of fresh air for this subject matter. If there was a film that truly felt like it needed to happen in 2019, it was Jojo Rabbit.     ",
      "enemy": "8/10 Did not realize how terrified I was of Jake Gyllenhaal until this.........what the fuck???     ",
      "what-did-jack-do": "7/10 Here's how 'What Did Jack Do?' can still win best picture     ",
      "good-time": "9/10 It's one of those where you finish it and go \"what did I just watch\" but it wasn't a movie that was trying to get you to go \"what did I just watch\"     ",
      "the-irishman-2019": "9/10 This won't make a lot of sense but:I can't honestly say every minute of this is necessary. But none of those minutes feel like a waste of time. This was everything I love about Marty and his films but polished. The most thoughtful, precise, and vulnerable film I've seen from him. Can't wait to see it again!     ",
      "kazaam": "2/10 like a 90 minute cereal commercial with no cereal     ",
      "marriage-story-2019": "10/10 I hate saying \"I'm at a loss for words\" as a cop out when writing reviews but I can't think of a better way to describe my feelings towards this. A dense yet perfect examination of love, what it means to love, what it means to understand, and what it means to feel alive.     ",
      "mon-oncle": "9/10 Similar to the first time I saw Kurosawa in color, seeing Tati use it for the first time was unbelievable. It's not just transferring from b&w to color, it's adding color to his toolset to build the beautiful world he created. So weird in such a lovely way. Some of his best comedy I've seen yet. That ending <3     ",
      "goldman-v-silverman": "9/10 these dudes are so good at making movies     ",
      "the-spongebob-squarepants-movie": "9/10 Now this....this is what tf I'm talking about.     ",
      "the-beguiled-2017": "8/10 Nicole Kidman saying BRING ME THE ANATOMY BOOK was so personal     ",
      "once-upon-a-time-in-hollywood": "8/10 tarantino's horniest and funniest movie! i'll add more later     ",
      "monsieur-hulots-holiday": "6/10 This feels like the most fitting thing to watch after moving to LA. Aggressively laid back with a hint of chaos underneath. This barely worked for me but at the end of the day I still admire it. It's so atmosphere heavy, and from what I've read Tati only gets more atmospheric from here. I smiled a lot! While I watched this my roommate watch You Were Never Really Here for the first time which is kinda hilarious lol     ",
      "1917": "8/10 \"1917 makes you FEEL like you're in the war\" - IGN     ",
      "jour-de-fete": "7/10 Definitely works better as a short, and I'll agree with the majority that it feels like a whole lot of nothing at the end of the day. But there's too much good and too much personality coming out of this to not enjoy it.     ",
      "school-for-postmen": "7/10 From the outside, Tati has always seemed like the type of filmmaker I would love. I wanted to find time to properly binge all his work in chronological order and what better time to start than now. Loved this a lot, I'm so excited to go further.     ",
      "on-the-basis-of-sex": "4/10 Pretty sure the score was ripped straight from Law & Order     ",
      "caddyshack": "7/10 An absolutely off-brand and underwhelming last film to watch this decade, but a great time nonetheless.     ",
      "modern-times": "10/10 EASILY my favorite from Chaplin. Can't tell you how good it feels to genuinely love one of his films rather than just appreciate it. Everything about this is great.     ",
      "the-39-steps": "9/10 Can't go wrong with Hitchcock     ",
      "bombshell-2019": "4/10 Made me wanna watch Vice (2018)     ",
      "fantasia": "9/10 Unfortunately, I gave up and got a Disney+ account. Fortunately, I finally got to watch this and it was beautiful!     ",
      "john-mulaney-the-sack-lunch-bunch": "9/10 This is good but why would you watch it when I Think You Should Leave with Tim Robinson is right there     ",
      "bad-santa": "7/10 Very hilarious that the guy who made my favorite documentary of all time also made this. Not surprising at the same time. Enjoyed this more than I should have lmfao     ",
      "unaccompanied-minors": "9/10 Listen to my podcast \"The Karstcast Moviecast\" available on all platforms     ",
      "star-wars-the-rise-of-skywalker": "6/10 just shut down my account at this point     ",
      "star-wars-the-last-jedi": "6/10 It was great. beautifully shot, good pacing, little confusing at times but that's just because I got a stomach ache halfway through and it distracted me. Good stuff tho. 👍🏼     ",
      "my-favorite-shapes-by-julio-torres": "3/10 You simply can't say it's been a slow year for Ryan Gosling when he gave one of the best performances of his career as Blue Penguin     ",
      "20th-century-women": "9/10 As the decade is coming to a close I'm trying to catch up on a few hidden gems that I missed for whatever reason, this being a huge one.20th Century Women is awkward at times with it's pacing and dialogue. Certain conversations last as much as 3 lines and end there. It feels a little all over the place and I think that's what I love. It works as a collection of details that, in some way, shape someone...     ",
      "her-smell": "7/10 I'm just a little underwhelmed but I have a very strong feeling Alex Ross Perry has the potential to make my favorite movie some day     ",
      "jenny-slate-stage-fright": "9/10 lol GRONK     ",
      "a-beautiful-day-in-the-neighborhood": "6/10 Heller's filmmaking is so warm and inviting. She has the ability to take character's who on the surface feel like supporting characters in real life and makes them protagonists (obviously referring to Llyod, not Mr. Rogers.) That said, while she held my attention with his character, the performance from Matthew Rhys felt pretty cartoonish and stereotypical. Same with Chris Cooper, he didn't really feel believable till the last 20 minutes. The editing was interesting and I appreciate the stylistic choices...     ",
      "i-lost-my-body": "8/10 I love animation and I miss France     ",
      "mistress-america": "8/10 Enjoyed it!     ",
      "notes-from-melanie": "8/10 Stepping into filmmaking as a Youtube film critic with over a million subscribers is asking to get destroyed critically online. Especially when you're just starting out, your first work is most likely gonna need some work. It's like going to a skatepark in 2006 and learning how to skate there. You're gonna get made fun of and fall on your face and go home and cry and maybe you won't ever pick up skating again (this happened)My point is...     ",
      "private-life-2018": "8/10 Sometimes you just gotta watch Paul Giamatti deflate a mattress for 20 seconds     ",
      "knives-out-2019": "9/10 Took me 3 months to finish this and it was worth it!It has some hiccups every now and then with some painful jokes that feel like they come from a Jimmy Fallon intern but there are enough bits to not only call this one of the funniest of the year but one of the most enjoyable all around. Michael Shannon going \"YOU WANT A COOKIE, HUH??\" is so funny for some reason, I really have no idea why.  I want a donut!!!     ",
      "frozen-2": "4/10 \"Oh come on\" - my sister Elsa watching me give it 2/5     ",
      "while-were-young": "7/10 Dreading the day I turn 30 years old lol. I liked what this was doing in the first half and in the last 10 minutes but it became a different movie for a solid half hour with the authenticity-in-documentary-fimmaking thing. The things Adam Driver does with his hands in this movie are almost too perfect.  You're an old man with a hat.     ",
      "mike-birbiglia-the-new-one": "7/10 Nothing will ever top Two Drink Mike but this was unsurprisingly great!     ",
      "full-metal-jacket": "9/10 watched w family     ",
      "news-from-home": "10/10 thank god i watched this at home where i get to say morning to my mom tomorrow because if i wasn't i don't know how i'd be able to handle myself right now     ",
      "the-squid-and-the-whale": "7/10 I'm gonna come clean, this is a super unlikeable film. Its characters are pretentious and unredeemable past the point of feeling any empathy, the soundtrack sounds exactly how you'd expect it to sound based off the poster, Jesse Eisenberg is in it...I mean, come on. It feels static but the underlying anger and toxicity of the situation is simultaneously always building till it reaches a point where it needs to come out. It feels real in a different way than what I'm used to. It's honest and it's different, I just wish I felt anything about it.     ",
      "the-departed": "9/10 Great way to end my Scorsese binge!That final shot is perfect and the whole third act feels tight as hell. The entire film is rich with interesting approaches to the subject matter which is fitting for a plot that grabs your attention within the first 5 minutes. Scorsese is just spitballing here and throwing every idea at the wall, his love for filmmaking shines brighter here than in something like Hugo. Don't know what to add to the table...     ",
      "casino": "8/10 I want a pastel colored suit now. I don't mean this as an insult, but this feels like every Scorsese film morphed into one. Which is amazing in some ways, it's like the most Scorsese movie possible I don't see much wrong with that. But it does feel, especially near the middle, like it doesn't have a purpose and/or voice of it's own. But again, this is only really an issue if we look at it in the context of...     ",
      "cape-fear-1991": "8/10 The anxiety this gave me! This is a damn good thriller and I can't look at Deniro the same way.     ",
      "bringing-out-the-dead": "9/10 The darkest I've seen Scorsese go. The way at which the edit goes about capturing exhaustion is pretty genius, staying chaotic and loud for brief periods of time but allowing for that come down to feel just as strong. The trip sequence is unreal. While it's undoubtedly unfortunate this is as under-appreciated as it is, it's not the most accessible of Scorsese's work so I completely understand. Everything about this is hopeless and I'm sad. Imagine going from this to Gangs of New York LOL     ",
      "hugo": "8/10 I have a canker sore on my left tonsil. Every time I move anything, eat anything, or swallow it feels like someone is stabbing my throat. Based on past experiences I'm assuming I got it because of stress. It's finals week, I'm applying for internships, I'm in the midst of pre-production for a short film I'm shooting in a few weeks, and I'm trying to find time to watch all of Scorsese's films.   My mind is a tornado right now...     ",
      "ford-v-ferrari": "5/10 In a year of films where it feels everyone involved was doing their absolute best, Ford v Ferrari lands on the opposite side of the spectrum. Aside from the editors it was clear that everyone who worked on this, and I mean EVERYONE (besides the editors...and fuck it, Bale too) sleepwalked their way through this. Just when you think something worth writing about is going to happen, they pull back. The bright cinematography was eye-grabbing at first but gets old real fast. It's getting the job done, nothing more. It'll be the talk of the town at this year's Thanksgiving, though.     ",
      "gangs-of-new-york-2002": "5/10 Maybe Marvel fans do deserve rights (kidding!!!!)     ",
      "the-last-temptation-of-christ": "9/10 I worship Paul Schrader, even though Paul Schrader has made it clear in multiple films that I shouldn't worship Paul Schrader.     ",
      "silence": "8/10 I'm....hm....uh.... Writing about movies is hard lol, writing about Silence is hell.   At the ripe age of 22 I still don't know where I stand on religion, I just have a lot of opinions on it that nobody wants to hear about. But what I'm trying to say is I feel like with a film like this, a film as subtly extreme and exhausting as this, your view on religion is going to impact how you take in this movie....     ",
      "alice-doesnt-live-here-anymore": "9/10 Ah yes, another gritty gangster flick from the one and only Martin Scorsese!!!     ",
      "happy-gilmore": "7/10 I promise I'm not trying to be that guy and piss off and confuse everyone on this app. But I liked this more than I remember, I'm sorry!     ",
      "the-aviator": "7/10 This was a lot more entertaining and a lot crazier than what I was expecting. The editing was not doing it for me in a lot of cases which I suppose is the point, it makes things feel pretty claustrophobic, but it just felt sloppy at a certain point. This is such a 2004 movie....     ",
      "the-king-of-comedy": "10/10 This is a perfect movie!     ",
      "boxcar-bertha": "5/10 Ya know...it's just not that interesting. There's a lot going on here, some of which is pretty cool, but none of it feels like it's doing anything. The beginning of my Scorsese binge!     ",
      "the-meyerowitz-stories-new-and-selected": "9/10 Noah Baumbach's work is like piano music. It takes two points, whether those points be birth and death, love and hate, New York and LA, and examines the in between. It's comprised of small moments, small notes, each providing a singular mood that, when put together, combines into a larger, more spastic piece. But there's precision to that. These notes aren't thrown together at random, one note always goes hand in hand with the next in a melodic way. It's...     ",
      "osmosis-jones": "4/10 Beto O'Rourke saw Tom Colonic and said \"I will look like that\"     ",
      "inside-llewyn-davis": "10/10 Sometimes the exact movie you needed at that exact moment naturally comes along and there's really no better feeling in the world. Don't know where Inside Llewyn Davis has been all my life, but I'm glad it showed up now.     ",
      "salo-or-the-120-days-of-sodom": "7/10 Salò has lurked in the back of my mind for awhile now. Going in with the expectation of it being one of the most disturbing films of all time had me intimidated but extremely curious. What I didn't expect was the bleak, depressing, disconnections within the film. While obviously disturbing (so much poop) I can't say I've seen a film this heartless before. A film that conveys that feeling not through nauseating cinematography or haunting music but through something indescribable. I'll be thinking about this one for awhile but not for the reasons I expected.     ",
      "raising-arizona": "7/10 The way Nic Cage delivered the line \"I'll be takin' these Huggies and whatever cash you got\".....perfection.     ",
      "turkles": "1/10 I assumed this was off limits. \"Turkles,\" I thought to myself, \"there's no fucking way.\" I found it on Amazon Prime, the beginning of the end. \"QUALITY. INDEPENDENT. CINEMA.\" pops up on the screen. We're in for a ride.This changed the way I look at this medium. For the better? For the worse? I'm still figuring that out. Maybe it's ahead of it's time.   Fuck you, Noah Centineo. Fuck you.     ",
      "pain-and-glory": "9/10 Craving fruit, colorful wall art, and dick     ",
      "mvp-most-valuable-primate": "3/10 I mean...     ",
      "sierra-burgess-is-a-loser": "2/10    \"Veronica quit cheerleading and is taking a break from social media\" is, without a doubt, the funniest and most on brand way to end this shitshow.     ",
      "spf-18": "1/10 You really don't think it could get any worse and then that girl goes \"Have you heard of lucid dreaming?\" and shit hits the fan. What the actual fuck is this \"movie\"?     ",
      "dolemite-is-my-name": "8/10 One of the most enjoyable films of the year. Dolemite is my Name fills it's runtime with as much energy as it can, even moments that need a minute to catch their breath feel like they have something exciting to offer. I don't think I'm the one that needs to tell you this but Eddie Murphy delivers a performance that never loses your interest. The cameos, the music, the energy of it all, sure it might not be saying a whole lot but it's hard not to have a great time watching this.     ",
      "swiped-2018": "1/10 Noah Centineo has never seen a movie     ",
      "the-perfect-date-2019": "2/10 the self-hatred i felt when i realized i was slightly attracted to noah centineo but ONLY when he was the museum boy....i'm such a loser     ",
      "how-to-build-a-better-boy": "1/10 More painful to get through than anything out of the new french extremity movement     ",
      "spider-man": "7/10 You mean to tell me people watched this and then went \"super hero film should be taken SERIOUSLY\"     ",
      "the-scarecrow-2019": "7/10 Nice work, Alex! The colors!! The editing!! Excited to see what ya do next!     ",
      "europa": "7/10 First LVT film I've seen that wasn't one of his modern works. Interesting to see some of his stylistic approaches that he's always had but to also see how much his work has evolved. My opinion on this film shifted depending on how I was looking at it. The prologue alone makes it clear this is meant to be more of an experience than a clear-cut story. You're supposed to get lost in it, and at times I was. But whenever I went off track (get it cuz train haha lol) I was very uninterested. Would have been great to witness in a theatre!     ",
      "the-snails": "7/10 Sometimes when you feel overwhelmed, anxious, and exhausted from everything you just gotta put on an animated short film about snails where a man uses his tears to water his garden.     ",
      "angst": "9/10 I'm quick to call any film that takes over my body a masterpiece. But I feel like I can justify that, any piece of art that can use its tools in a way that's so extreme that it gives me a physical reaction is worth admiring, in my opinion. This can be labeled as lazy, pretentious filmmaking, and in some cases it is, but it works. It's doing exactly what it sets out to do without any hesitation and that's...     ",
      "el-camino-a-breaking-bad-movie": "7/10    El Camino didn't need to happen, plain and simple. As fragile as this was, I still stand by that, the finale to Breaking Bad was perfect. BUT, this by no means ruined anything. Jesse was always my favorite character, still is, so to see 2 hours of his world was already going to be fascinating. Up until those last 20 minutes I'll be honest, it just feels like catch up so that we can get what's in those scenes. But...     ",
      "the-pleasure-of-being-robbed": "6/10 🥺     ",
      "memories-of-murder": "9/10 I'm just in awe at how original Bong's films are, keep in mind this is only the third film of his I've seen. He doesn't share his voice through style as much as he does his use of tone. Bong Joon-ho films don't just look like Bong Joon-ho films, they feel like that. His stories are so original you really have no idea what his next step is going to be. Memories of Murder is an extremely precise downward spiral...     ",
      "revenge-2017": "8/10 A vibrant, bloody, and suffocating hour and 40 minutes. Okay time for bed!! :P     ",
      "snowpiercer": "7/10 More like ....Polar Express! :P Sorry, feeling funny tonight! Can't help it!It took a minute for this to get going but once it got going it was a wild ride! Not to say the first half was bad, I just liked what the second was doing more. Yuuuuuup     ",
      "in-the-tall-grass-2019": "2/10 If this were me, I would simply not go into the grass     ",
      "district-9": "7/10 Sure! I liked this. It really just gets better as it goes on. It started out kinda messy imo, mainly in it's editing. I also just feel like it could've gone a bit further with what it wanted to say. But all that aside this is a good movie.     ",
      "nathan-for-you-finding-frances": "9/10 wonder how it feels to be a filmmaker today knowing this exists and you'll never reach it's level of greatness     ",
      "monos": "7/10 Lotta wet clothes in this film, can't imagine how uncomfortable. Like all the sand and dirt rubbing up against your skin? Sheesh. A consistently dark and foggy film. There's no room for a breather which, in a lot of ways works, and in some ways feels like something the film desperately needs. Rico killed it!     ",
      "ishtar": "7/10 stupid but also genius     ",
      "ad-astra-2019": "8/10 Why write about Ad Astra when you can use that time to buy another ticket for Ad Astra     ",
      "the-dark-knight": "8/10 Like....okay yeah fine sure whatever moving on. I think I've settled on my stance regarding \"Heath vs. Joaquin\" but the world isn't ready for that opinion.     ",
      "what-we-do-in-the-shadows": "8/10 I feel like every week a new person asks me \"Have you seen ‘What We Do in the Shadows'\" and I have to go \"no not yet\" and then they go \"GET ON IT\" so I finally got on it and it was hilarious and great     ",
      "crumb": "10/10 Gotta say, one of the most fascinating films I've ever seen. After spending 2 intimate hours in the mind of Robert Crumb I still feel like there's so much more to know about him. Not to say I wasn't satisfied by the end, I definitely feel \"full\". This film starts off odd and just gets more twisted the more you learn about him, his family, and his perception of the world around him. But with that you grow a sense...     ",
      "joker-2019": "7/10 This film throws you into a fire and watches you burn to a crisp for 2 hours. By the end you feel, not so much disturbed, but intimidated. The film, however silly the script is at times, feels bigger than you by the end. Joaquin Phoenix's performance and Hildur Guðnadóttir's score truly carry this film. Todd Phillips adds barely any originality in regards to the tone. People are gonna hate it for the wrong reasons, people are gonna love it for the wrong reasons. At the end of the day, I'm just a little bummed I saw it instead of Uncut Gems.     ",
      "the-truth-2019": "7/10 Much smaller scale on it's surface compared to what I'm used to with Kore-eda but definitely packs a punch underneath. Maybe too underneath for my taste though. Could be that I'm just burnt out and slightly sleep deprived at this point but it lost my interest in a few scenes. Still tho, everything to love about his filmmaking is very present here.     ",
      "a-hidden-life-2019": "8/10 Such an ambitious and emotionally gripping experience. I'm just exhausted. The man could not be more self-indulgent (to a point where it's honestly just obnoxious) but Malick sure knows how to make a movie.     ",
      "the-goldfinch": "7/10 *film ends*me: that was pretty good!*checks twitter*me: ah jesus christGuess this is the equivalent of Vice for me this year. Didn't hate it. Not perfect, structurally a mess, but I was into it. It feels like it tackles the subject in every angle possible, which obviously makes for a mess, which it is, but I personally think it pulled it off. While I'd say the scenes with Ansel definitely feel relatively empty, the scenes with young Theo completely make up for it. They feel full of heart. Roger's cinematography is obviously the highlight.     ",
      "synchronic": "7/10 Honestly way better than I thought it'd be. Some great performances and a really cool concept. In fact I wish it was either a bit longer or more fleshed out because the concept had so much potential. Also deserved a bit more of an interesting approach visually. But regardless, an entertaining time.     ",
      "color-out-of-space": "6/10 Nic Cage is one of my favorite famous people, hands down. This has some real highs and some real lows. There's automatically gonna be a lot of comparing to Mandy and I'll come right out and say it's not as good.... at all. But that's coming from someone who doesn't mind style over substance. Because if you didn't like how empty Mandy felt, you might like this more! The acting from literally everyone is not great and the editing near...     ",
      "the-twentieth-century": "6/10 Visually, sure! Concept, great! Production design, oh my god! Take aways? Not much!     ",
      "the-climb-2019": "8/10 Closer to a 4.5 but sticking at 4 for now. Biking, one-shot sequences, jokes, what's there not to love? Literally, very few things not to love about The Climb. Besides the fact that I wanted more. I guess not much else to say, excited to see what these dudes do next because this was great!     ",
      "were-going-to-the-zoo": "10/10 Okay that's enough Safdie for today     ",
      "the-black-balloon-2012": "10/10 This is one of the best shorts ever omfg     ",
      "heaven-knows-what": "7/10 Uncut Gems HypeOfcourse Caleb Landry Jones is in this.  On that note if the Safdie brothers never utilize Steve Buscemi in one of their films their entire career was a waste. Anyways, this is one of the grittiest things I've seen. A lot grittier and more authentic than Good Time. That said, what it makes up for in grit it loses in empathy. I didn't care about Harley the way I did with Connie. We spend a lot of...     ",
      "eyes-wide-shut": "8/10 Can't tell if I love it or just like it yet...but I like it. This is a good movie. Yep. This is real good. There was so much happening in the first like 20 minutes I feel like I need to rewatch it now knowing how the rest of the film pans out. INTERESTING     ",
      "raiders-of-the-lost-ark": "10/10 Perfect film. Made me want to make movies.     ",
      "the-flintstones": "3/10 lmfao     ",
      "travis-scott-look-mom-i-can-fly": "4/10 Pretty similar to how I feel about the Brockhampton documentary. As a Travis Scott fan, I dug it, but that's only really because I'm familiar with him, his performances, his music, and this is  just a closer look at all of that. If you're going into this knowing nothing, you'll come away knowing about the same and probably even a little turned off by how up his own ass Travis comes across through this. Unlike Brockhampton's doc, this had barely...     ",
      "high-life-2018": "8/10 Arriving veery fashionably late to this party BUT. This is way more brilliant than I thought it'd be. According to Denis this is her most heart-warming film and it's apparently, at its core, about love. That changed much of how I looked at this thing. She takes something like love, something that, to me, is codependent with time (for reasons that would require a separate essay) and places this \"love\" story in a setting like space where one could argue...     ",
      "synecdoche-new-york": "10/10 Watched this morning and have since been going back, rewatching scenes, figuring out how to write this review, and reading up on some other people's takes. This film is much bigger and more personal than...anything I've seen in my life. To summarize everything I have to say about this and everything it meant to me in one review would be absolutely silly. Will probably be making a video on it soon, but even that won't do it justice. Something (many...     ",
      "jigoku": "9/10 Well, that was disturbing! Didn't expect this to mess me up as much as it did but here we are. So ahead of its time visually, too. It's times like this where I just hate ratings bc while it's very flawed, I can't deny how into it I was and how much it, again, disturbed me. Sheesh!     ",
      "brigsby-bear": "5/10 Brigsby Bear is such a confusing thing that exists. Not the storyline, that could not be simpler, just the actual purpose of this film, the tone of this film, the voice of this film, I mean what is the point?It's something that, on it's surface, comes off as a passion project, as something that was so carefully thought out and had a lot of heart put into it. But once you actually watch you realize there isn't an ounce of personality in it's filmmaking. While enjoyable and sorta funny in the moment, Brigsby Bear is the most boring high you'll ever have.     ",
      "still-walking": "9/10    The camera only moves in 2 scenes (that I remember) and the choice to move the camera in only those scenes is literally the most beautiful thing ever. The way Kore-eda captures space and location and uses that to tell the connection people have with each other cannot be replicated. Don't know how something so simple could feel like nothing I've ever seen before (besides Shoplifters obviously.) Last 10 minutes felt like I got hit by a bus!     ",
      "aquaman-2018": "6/10 This movie was on it's knees begging for everyone not to analyze, discuss, or review it in any way what so ever. You're supposed to watch it, get confused on whether you like it or not, and move on. So that's what I'm gonna do.     ",
      "dora-and-the-lost-city-of-gold": "4/10 In a year where it seems the trend in film is characters getting high and having bad trips.....I can't believe Dora decided to make a contribution to that trend. Dora got high. She sang about pooping.     ",
      "speed-racer": "9/10 While maybe not as consistently engaging, this is genuinely in the same lane (haha) as Spiderverse and Fury Road in terms of visuals. If you had any doubts that this wasn't a good movie please revisit the \"Non-ja\" joke.     ",
      "naked-childhood": "10/10 After A Nos Amours I was very curious to check out the rest of Maurice Pialat's work and damn I'm glad I did. I cared so much about this boy even though I didn't like him for most of the film. I understood his motives and he barely said anything. Pialat is amazing at saying a lot in a matter of seconds. Yeah, loved this and would happily watch again. I have much more to say but can't really put it to words at the moment.     ",
      "a-nos-amours": "8/10 Well, I really liked this. Something weirdly honest and intimate and vulnerable about it. Don't know how it pulled any of those traits off or why any of those traits made it so good, but they did. I feel like there was a bit more I wanted out of it by the end, but like most films, maybe that was the point? Definitely giving this a rewatch somewhere down the line as it reads a lot like a film that hits differently depending where you're at in life.     ",
      "sleep-has-her-house": "9/10 Watching this and Space Jam in the same day should honestly be a crime.My thoughts and approach to this film shifted throughout its duration. At first I was totally approaching it as an experimental film, which it is to a certain extent, but the further into it I got I realized it's actually just a really unique horror film. Not only that but it's one of the most terrifying horror films I've seen. But it's also, in some ways,...     ",
      "space-jam": "4/10 I fell asleep almost immediately (don't worry I watched the rest, elaborating on karstcast)     ",
      "rosemarys-baby": "8/10 The energy radiating off this thing is so unwelcoming and uneasy but so interesting. I feel like a lot of that comes from the performances, they were all so bizarre but so right. Felt like 90 minutes! One of the coolest movie posters ever also.     ",
      "willard": "8/10 Don't know if I'm supposed to log this. My dad goes \"we're gonna watch this with the sound off and put on Earth Wind & Fire\" and we did that and I don't know what to say about the whole thing. As you can tell I've given up on watching movies.     ",
      "the-spongebob-movie-sponge-out-of-water": "3/10 This thing gives me a HEADACHE     ",
      "wild-hogs": "3/10 As bad as this was, watching Tim Allen AND John Travolta get punched in the face was pretty great.     ",
      "death-proof": "9/10 DUDE LOL. This is an absolute goof of a time, I loooooved it. Everything about it! The style, the dialogue, the editing, the music, and obviously that ending. The cut to the credits is hilarious and awesome and so self-aware. It's obviously a Tarantino film but it also feels weirdly like a side of Tarantino I haven't seen before. A softer but simultaneously angrier side of him. But above all, I take back what I said in my last review, this man was HORNY horny when he made this.     ",
      "the-farewell-2019": "9/10 Me laughing embarrassingly loud at a joke that took place in a graveyard is everything you need to know about this film. Lulu Wang is so good at writing conversations it's not even funny. Nothing I say is gonna do this film justice, just please see it immediately.     ",
      "wont-you-be-my-neighbor": "8/10 With \"Beautiful Day In The Neighborhood\" being announced for TIFF today I figured I'd finally get around to this. It's that last scene that really drives this documentary home. While I did want to know more about the man himself, that was totally not the purpose of this documentary and I'm glad it ended on a note that reminded me of that. I feel really happy, gonna go call my mom!     ",
      "the-florida-project": "10/10 One of the most heartbreaking yet beautiful films I've seen in a long time.     ",
      "bubble-boy": "7/10 it really doesn't get much more 2001 than this     ",
      "the-lion-king-2019": "2/10 best part about this is knowing eric andre got a nice fat check and can live comfortably doing whatever weird shit he wants to do     ",
      "charlie-and-the-chocolate-factory": "6/10 Mike Teavee definitely grew up to be a Twitch streamer     ",
      "mamma-mia": "6/10 Tempted to go higher but afraid I'm gonna get punched in the face if I give it a higher score than The Witch.     ",
      "but-im-a-cheerleader": "8/10 I scream laughed at \"this is my son, Rock.\" protect this movie at all costs holy fuck     ",
      "spider-man-far-from-home": "6/10 eh sure yeah why not!     ",
      "autumn-sonata": "10/10 Emotions and dialogue that we're too afraid to discuss and convey brought to the surface in an uncomfortably realistic way. There was something about this that felt so subtly familiar. I. Was. Not. Ready!!! Can't wait to see Spider-Man: Far From Home in an hour lmfao     ",
      "midsommar": "9/10 This year's Mamma Mia: Here We Go Again!     ",
      "the-last-boy-scout": "7/10 \"it's called vocabulary, you read much?\"\"yeah my subscription to juggs magazine just ran out\"automatic 3.5 stars for that dialogue     ",
      "paths-of-glory": "9/10 Hate to be that guy but Kubrick is so freaking good at making movies hooly shit. He did this at 28....TWENTY EIGHT. This is my new favorite (anti)war film. I will say, interesting choice on my part to watch this at 6:30am.     ",
      "rocketman-2019": "7/10 This was just great. I went into it hesitant because ya know...musical biopics. But this was pretty refreshing and did exactly what it needed to do. Wish it went a liiittle further and got a liiittle darker but whatcha gonna do. Elton's entire downhill spiral was done so well. My mom summed it up pretty well when as soon as we left the theatre she went \"Well......fuck Bohemian Rhapsody!\"     ",
      "anima-2019": "7/10 Being that ‘Daydreaming' is maaybe my favorite music video ever, I was preetty hyped for this. It definitely delivered. I love shit like this so much. Can't wait to watch it over and over again and try to make sense of it all.  Also when Thom Yorke did that little dive jump in literally the same way Barry did in PDL...iconic.     ",
      "moonlight-2016": "10/10 Don't even feel like I need to say much at this point. Stunning, perfect, beautiful, sad, vulnerable, everything man I don't know I love this movie a lot.     ",
      "the-avengers-2012": "4/10 Gonna assume I don't love this as much as everyone else because I didn't experience it when it initially came out. There were literally three scenes I enjoyed. Could be that I was running on 2 hours of sleep but I fell asleep for a good 30 minutes in the middle. I watch the latest Marvel films and always think \"why do people hate on these? they're so fun\" and then I look back at this and I'm like oh....yeah...     ",
      "grease": "6/10 Your Second Cousin From the Suburbs of Wisconsin Who Did Lacrosse Once: The Movie     ",
      "ran": "10/10 I feel like I just witnessed color in film for the first time. There is a lot to love about Ran. It's way of finding heart and beauty in a story fueled by hatred and tension is one of my favorite aspects, I suppose. But then there's the color. And the editing. And everything else. I'm just really glad this wasn't my first Kurosawa and that I've unintentionally been building my way up to this. Because while it does stand...     ",
      "kangaroo-jack": "2/10 the things I do for my podcast     ",
      "prisoners": "9/10 *jake gyllenhaal blinks**hugh jackman growls**paul dano squeals**it starts raining for some reason**all within the span of 10 minutes*  me: this is cinema at its finest     ",
      "booksmart": "9/10    Lots that I love about this but there's a small joke in here where Amy is crying and tripping on drugs and she goes \"my mom has a scarf that color\" and it was so relatable I almost cried myself.     ",
      "bronson": "6/10 I cannot tell you how badly I wanted to love this. The intro and ending are unbelievably good but boy is everything in between kinda rough. Sure it looks good, sure Tom Hardy is amazing, sure it has some interesting scenes, but for a movie that creates such an interesting atmosphere, it really does nothing with it. He's batshit crazy from beginning to end, which makes for a fun performance for Tom Hardy but allows for 0 progression. At a...     ",
      "alien": "8/10 Can't believe it took me THIS long to see this. Took me a liiiittle bit to get into it, not gonna lie. I get that a lot of it is just building an atmosphere but I wasn't even really interested in it until like 30 minutes in. But once it got going, boy did it get going!     ",
      "the-neon-demon": "7/10 Nicolas Winding Refn's films are always really good until the characters start saying things.     ",
      "meatballs": "6/10 watched for karstcast.  liked this way more than i thought i would. it has tons of issues but it's pretty innocent and has some really funny moments. will go more in depth on the next episode of KARSTCAST.     ",
      "the-dead-dont-die-2019": "9/10    If Adam Driver died and came back to life and tried to kill me...I'd let him.-Between this, Greener Grass, and Beach Bum, 2019 is definitely the year for weird and unique comedies. Like those other films, this is a hard one to recommend because you're gonna have to have a pretty specific sense of humor and be in a pretty specific mood to get any sort of enjoyment out of it. It's really stupid, and very self-aware, but...     ",
      "creep-2014": "9/10 realized i've never logged this. just wanna say this and creep 2 are super great compared to most jump scare movies. they do the whole sub-genre super well and in a really interesting and engaging way imo.     ",
      "nina-wu": "7/10 Tarantino showed up to the screening. Not only did I see the man in person but I TECHNICALLY watched a movie with him. Cannes is fucking sick. But yeah I really liked this a lot, felt very in control and was consistently throwing new ideas at the wall and they were working. Great performances and cinematography, loved the structure, would happily check it out again.     ",
      "atlantics-2019": "4/10 this shit Boring     ",
      "port-authority": "3/10 green book     ",
      "little-joe-2019": "5/10 Hate to compare but it's like a dull Yorgos Lanthimos film. With stale dialogue and a unique score that feels like it's screaming at me to feel nothing, this film felt so static. I wanted to love this, and I will definitely be paying attention to whatever Hausner does next because this was stylistically great. But this felt like a big pile of nothing. I don't want to say it's boring but it's certainly not FASCINATING, it's just somewhere in the middle. Funny ending though!     ",
      "sorry-we-missed-you": "9/10 I'm definitely checking out everything Ken Loach has done, starting with Kes. This was tragic and the saddest part is how real it is. The way it covers the fear and depressing aspects of literally normal people is...so smart, I am not doing it justice. Too many thoughts!     ",
      "beanpole": "4/10 not my thang!     ",
      "first-love-2019": "7/10 Takes a bit long to get going and a bit long to cool down but everything in between is batshit crazy in the best way.     ",
      "les-miserables-2019": "8/10 My first Cannes film!!! (grace if you're reading this, sorry for dipping so fast, there was a lot going on)  This was fantastic. Such an angry film that really puts its morals in your hands which I appreciate. Some of my favorite films of all time are those that deal with this subject and do so very bluntly, but it's nice to not be spoon fed how to feel for once. It's lack of original style is the only thing...     ",
      "pokemon-detective-pikachu": "5/10 As someone who still consistently plays Pokemon Go, I was ready to come out of this shoving my middle finger at all the critics faces and slapping a 4 stars on it. But unfortunately I can't bring myself to do that. In short, it's like a movie from the early 2000s done right but at the end of the day...it's still feels like a movie from the early 2000s. Also not a single Magmar in this whole thing, fuck that.     ",
      "la-haine": "10/10 Completely different film but this was very similar to Do the Right Thing in terms of it's structure and I loooove Do the Right Thing. So yeah, this was pretty grrrreat!   (I've been handing out 5s left and right but god damn these films I'm seeing are just so deserving of it)     ",
      "pahokee": "9/10 my goodness this is so good. so raw and charming. feels rare to get something as honest and unfiltered as this that still manages to hold your attention. i see some people bashing it for not having the typical documentary tropes like voiceovers or talking heads but honestly that's probably my favorite part about it.     ",
      "howard-the-duck": "2/10 I need to take a shower immediately.     ",
      "the-killing-of-a-sacred-deer": "9/10 Jeeeeeeeeeeeeeeesus christ!!!!!!!!!!!  I have been trying to watch this for months but something always seemed to get in the way. The last half of this is some of the most exciting filmmaking I've ever seen. Seriously wow. Not a perfect film but WELL deserving of a 5. UGH. I'm at a loss for words. Please for the love of god watch this if you haven't already it's FFAANNTTAASSTTIICC.     ",
      "mirror": "10/10 What makes a life a life? The people who raised you? The places you went? The home you grew up in? The historical events that occurred? The relationships you had? The deaths you witnessed? The philosophies you learned? This film is saying these are all correct, focusing on the idea that life is based off memory. Which then poses the question, is life only based off memory? Is what you didn't remember not considered a part of your life? Told...     ",
      "yojimbo": "8/10 While it's far from being my favorite Kurosawa, it was still a pretty great time. Excellent use of blending tones, it's able to be funny, sad, and thrilling all at the same time and it makes it look so easy. I guess I just wanted more out of Sanjuro. This could just be personal opinion but he was one of the more uninteresting protagonists I've seen in a Kurosawa film. Still, a very smart film that, like most of this man's work, probably won't leave my head for a little while.     ",
      "unicorn-store": "4/10 Harmless and deep down pretty charming but it's just so awkward for all the wrong reasons. Some of the performances and editing made this feel like a student film. I do like Brie Larson, she's the best part about this, but damn. Will talk about it more on the next Karstcast.     ",
      "avengers-endgame": "7/10 There is something so interesting about these films. Something so odd but charming, so ridiculous but right, so messy but structured. That something is a lot of things, and this film takes that thing and turns it up to the max. Superhero films have over the years excercised this idea of being more than just a genre, but a completely new style of filmmaking. This (and Infinity War) are the perfect examples of what this style is. It's an indescribable...     ",
      "blood-simple": "9/10 I love these Minnesota boys so god damn much.     ",
      "vivre-sa-vie": "8/10 Clearly liked it a lot more than Breathless. At the end of the day I'm still pretty conflicted on how I feel. Like I love everything about this, the visual language, the editing, the performances, the philosophy in that 11th story. The only thing it's missing is me giving any sort of shit about this woman. I will say, that final shot is absolutely tragic in the context of the entire film but that can't be the only time I care about her. Ya know? Still though, I'm sure there's a Godard for me that I'm gonna love, we're getting closer.     ",
      "belle-de-jour": "9/10 Dark, weird, and fascinating. Aka, my thing. Buñuel's filmmaking style has always seemed like something that would be my thing so I finally decided to start getting into his stuff by watching this. Absolutely loved it. Haven't been this absorbed in a film in awhile. The surrealism in this film works incredibly well, too. So much to say about it, that box scene is great. Whenever a film ends and I find myself staring at the black screen for longer...     ",
      "the-color-of-pomegranates": "9/10 There's a pretty reassuring review on here that was something I knew before watching this but needed to hear again afterwards where it describes the visuals as \"meaning whatever they mean to you.\" This film is very personal, and how it is approached depends entirely on how you look at it. I found myself feeling so many different emotions throughout this thing. Excited, irritated, depressed, turned on, uncomfortable, you name it. It's a film about this man's life but is...     ",
      "funny-games": "9/10 Paul looks and lowkey acts exactly like Alex Honnold which only helps my argument that Alex could kill a person and feel nothing. Like did you see the way he talked about his girlfriend in Free Solo? Sheesh. Anyways this was fucking great!     ",
      "three-colours-white": "7/10 The worst in the trilogy is still...pretty good. The ending and theme are probably my favorite parts. I will say, at times the score does feel extremely \"generic 90s drama\" though. I guess what separates this from the others is just how normal it feels. While Blue and Red emphasize their respective colors and use them to create the tone of the film, this one just feels like a movie where the color white happens to be a theme. In it's defense,...     ",
      "a-short-film-about-killing": "8/10 ///////////:     ",
      "a-simple-favor": "5/10 this did close to nothing for me but the idea was nice     ",
      "us-2019": "8/10 Guys, when the dad is watching baseball, the game is the Giants vs......wait for it...the Minnesota TWINS!   Anyways, felt smart for that, don't really fully understand the rest of it and I'm really not sure how I feel about that. The minute people realize they can't stop thinking/talking about a movie and that it has a somewhat obscure ending that requires some thinking to figure it out, they'll automatically label it as a masterpiece. This is one of those movies,...     ",
      "lord-of-the-flies": "6/10 *10 minutes in*\"Why does this have such a low average rating? This is super captivating.\"  *An hour later after the tone has barely changed but the characters have changed a lot and it's really frustrating because it's sort of progressing but it feels like nothing is happening at the same time*\"Oh, I see.\"     ",
      "the-revenant-2015": "8/10 I got a lot going on in my life right now, but at least I'm not this dude.     ",
      "annie-hall": "6/10 I've seen a lot of movies jack themselves off, some of which I actually quite loved, but this one went full autofellatio. This review isn't even about the allegations against Woody, I actually went in expecting to love this. I would just genuinely love to hear others thoughts on why it's considered a masterpiece because I feel like I'm...missing something.     ",
      "vox-lux": "7/10 Sorta underwhelming? Not really, though. I have no idea. The visuals and editing were the best thing about it, seriously stunning looking film. My low amount of enthusiasm to talk about it pretty much sums up why I didn't LOVE it. There was a good 40 minutes of nothingness in the middle of it when Natalie Portman was introduced that took me out and almost brought me back but not quite. Everyone keeps calling this a movie where you love it or you hate it and I am aggressively in the middle.     ",
      "punch-drunk-love": "10/10 Do you ever love a film so much that once the credits roll you stand up and jump around a little bit because of how much you loved it? That just happened with this movie right here.   Been going through PTA's stuff because I really haven't seen any of em and so far I've loved everything, but this one right here...b-b-b-BOY this takes the cake.   I loved every bit of this movie. Every shot, every line of dialogue, every sound,...     ",
      "500-days-of-summer": "8/10 This could not be more different than Don Jon.     ",
      "three-colours-red": "9/10 Better than Blue. Beautiful cinematography. That ending is so so good.     ",
      "leaving-neverland": "10/10 Part 1:Hooooly fuck dude     ",
      "children-of-men": "9/10 Well, shit. One of the most impressive films I think I've ever seen. I just....hm. I really do feel stupid trying to put any of my feelings about this film into words. Nothing I say will do it justice. Lots of anger, sadness, pain, anxiety, too much to describe in any coherent way. We don't deserve Alfonso Cuaron.     ",
      "blade-runner-2049": "8/10 Worth the hype and praise. Not really sure what to say that hasn't already been said, great job at world-building and, I mean, the cinematography...yeah I'll just leave it at that.     ",
      "barry-lyndon": "10/10 Long movies scare me. Period pieces scare me. They are both things that I historically (haha get it because period piece) have not exactly found EASY to watch. They're usually GREAT, but impatient people like myself have a hard time getting the energy to watch things like that. But I gotta say, despite that, I loved every second of Barry Lyndon.     ",
      "y-tu-mama-tambien": "10/10 MAMACITA     ",
      "paris-is-burning": "9/10 watched for classPretty much flawless filmmaking from start to finish. The way it gets so much across in such a short period of time without feeling so dense is amazing. Holds your attention with not only the camerawork but structure. As a film it's perfect but I'm not quite sure how to feel about the whole backstory behind it with the director not having experienced this side of life herself. From what I know.     ",
      "shrek-retold": "9/10 Glad this exists for multiple reasons     ",
      "medicine-for-melancholy": "7/10 My least favorite Barry Jenkins film is still a pretty good film. His ability to capture the details of his stories through sound and visuals still exists at this time in his career. The performances are pretty...bad (sorry) but whatcha gonna do at this level, ya know? This man was able to do a lot with what he was working with here and that alone was super exciting to watch.     ",
      "the-strange-thing-about-the-johnsons": "7/10 How does one....attend Thanksgiving....after making this?     ",
      "greener-grass": "7/10 Equally as bizarre and hilarious as the feature length version. It's not AS good, which is why I don't know if I want to suggest that any of you watch it before watching the feature incase you're let down (in my opinion this is best experienced with a crowd) but if you're really just dying to figure out why I love this whole thing so much, it's on Vimeo.  This style of humor is exactly what I aim to make some day and I don't know if that's something to be proud of or not.     ",
      "the-wife-2017": "6/10 Mr. Castleman: Without this woman, I am nothing.The Wife(2018): Lol same!     ",
      "paddleton": "8/10 Easily a top 5 in terms of saddest movies I've seen. Nothing like a good cry on a Saturday night. Mark Duplass and Ray Romano both give some GREAT performances in this that I already know will be insanely overlooked.  There were moments that felt so real and others that feel a little cliché and I would've liked some more consistency but damn. The end (the scene) is one of the most heartbreakingly realistic things I've ever seen in film. Props to the performances and direction because it was truly unlike anything I've seen before. This was much better than I expected.     ",
      "late-afternoon": "9/10 Oscars Short #8:') Oh this is just so damn good on so many levels.   That's gonna do it for the shorts, already seen Bao and I'm skipping Detainment after hearing about the backstory behind it (don't wanna support that)     ",
      "skin-2018-1": "1/10 Oscars Shorts #7This is, I kid you not, one of the worst things I've ever seen.     ",
      "marguerite-2017": "7/10 Oscar Shorts #6*sobbing*\"...gay rights\"     ",
      "fauve": "9/10 Oscar Shorts #5  ....very tempted to hit this with the 5. this should win mhm. yup.     ",
      "mother-2017-1": "8/10 Oscar Shorts #4  Excuse me um what the fuck? Literally shaking. This was beyond stressful to watch. Impressive performances and production all around but god damn what the hell.     ",
      "one-small-step-2018": "7/10 Oscars Shorts #3  2018 really was the year for visually stunning movies about grieving astronauts     ",
      "weekends-2017": "8/10 Oscar Shorts #2Beautifully animated. Great use of space and color. Also ‘3 Gymnopédies: No. 1'.  That's all.     ",
      "animal-behaviour": "3/10 Oscar Shorts #1A few funny bits but for the most part a really bland short that didn't really do anything...at all? I have no clue how this got nominated lol     ",
      "paddington-2": "9/10 So wholesome. So pure.     ",
      "love-2015": "8/10 If there's any filmmaker out there who has the vision and confidence to make the next 2001, it's Gaspar Noé. Hate him all you want, I sure as hell do sometimes (refer to my Irreversible review) but he's unarguably one of the most exciting filmmakers...ever? Yeah, ever.   I hate how this is getting labeled as just porn. The excessive amounts of sex is not the flaw of this film. The sex, if anything, tells the emotional arc of this shitty...     ",
      "were-the-millers": "6/10 Lol     ",
      "do-the-right-thing": "10/10 this movie is fffrriggin great     ",
      "fork-in-the-road": "10/10 Whoever the FUCK added this on here and wrote that synopsis, I love you.     ",
      "the-lego-movie-2-the-second-part": "8/10 I have a LEGO brick tattoo. Even if this movie did have 3 seconds of Batman flossing, it's gonna take a lot for me not to really like these movies.  (Also maybe the best end credits sequence I've ever seen)     ",
      "ryan-hamilton-happy-face": "9/10 I watched this awhile ago but wanted to log because I'm realizing it's an extremely underrated special and I need more people to watch this guy. Reminds me of John Mulaney in a lot of ways.     ",
      "velvet-buzzsaw": "4/10 Dan Gilroy visited Chicago to see The Bean and went \"See that? Let's put HOLES in it\"     ",
      "late-night": "8/10 Alright this was such a good way to end my Sundance trip. It's safe, it's basic, but it's very charming and actually pretty funny. After watching a bunch of really heavy things in such a short period of time, it feels nice to come back to earth a little bit and laugh at Mindy getting hit with a trash bag.  Can't tell why I teared up at the end. Was it really the movie? Was it that Maggie Rogers song? Was it the fact that I have to go back to Chicago? AHHH     ",
      "mope": "2/10 Oh this is just awful!The porn industry is a fascinating and terrifying topic, something that you rarely see touched on in film because it's just...a lot. That being said I was genuinely excited to see Mope. But no, this movie is just a disaster. It focuses more on \"PORN CRAZY\" and less on why it is the way it is. As a result you get a film that's essentially saying nothing and leaves you feeling like you need to take the longest shower of your life.     ",
      "the-souvenir": "10/10 masterpiece     ",
      "big-time-adolescence": "8/10 As expected, I'm a big time fan of Big Time Adolescence. A hilarious yet depressing coming of age story? Ofcourse. Only solidifies my stance on Pete Davidson being one of my favorite celebrities working today. I didn't do the things this kid did, but I really felt what he felt in high school, and I love how well this film portrayed that. It's essentially a better Mid90s. High school boys need a really good coming of age film, and I feel like this is exactly that.     ",
      "them-that-follow": "7/10 JESUS CHRIST (literally)I despise the fact that the first 45 minutes of this is so empty because the second half is near perfect. Such a great build up and perfect pacing. Amazing performances from literally everyone (protect Olivia Colman at all costs) and just some great looking cinematography. This gets a big FUCK YEAH from me.     ",
      "sweetheart-2019": "4/10 Sadly sort of a disappointment. Nothing necessarily HORRIBLE aside from some cringey performances. It just got old really fast.     ",
      "the-last-black-man-in-san-francisco": "8/10 Took me a bit to warm up to this and just how different it is. Truly a breath of fresh air both in it's story and filmmaking. It's very dense and there's a lot that happened so I might have to revisit this the next time I get the chance but man. Great performances, great ending, and the music.....god DAMN.     ",
      "rbg": "7/10 Watched on the AIRPLANE. Pretty good, yeah.     ",
      "a-woman-under-the-influence": "8/10 Man, I really don't know. Similar to 'Faces', this shit is just so hard to get through. Took 4 breaks just to do something else for a few minutes. I really really hate saying things like this but I appreciate films like this more than I enjoy watching them. This thing is oozing with talent. Some of the best acting I've ever seen coupled with amazing direction and don't even get me started on the cinematography. I'm a fool for...     ",
      "antichrist": "7/10 I hate this man     ",
      "vice-2018": "8/10 Ugggghhhh I'm too young and uninformed about politics to understand how much of this was accurate or how good of a job they did at portraying Dick. So with that being said I guess that's why I like it a bit more than the rest of Letterboxd. I loved the performances, I actually dug how unsubtle it is, despite some messiness and a few cringey scenes I'm sorry to say that I genuinely enjoyed this.     ",
      "the-tree-of-life-2011": "10/10 Holy, and I mean this in the most genuine way possible, shit.  Edit: I was going to leave it at that but I just can't lol. I gotta keep going wow wow wow FUCK. Also I'm totally about to just say what everyone already knows but fuck it.   Yeah as pretentious as this is about to sound, this isn't even a film. It is but it's not using filmmaking in a way to tell any particular story. It miraculously all...     ",
      "piper": "10/10 One of the best looking short films out there ugh     ",
      "fyre-2019": "10/10 Imagine a scenario where Letterboxd tries to throw a festival. Everyone on Letterboxd shows up to some Landmark theatre and the only movie playing on every screen is Vice and people proceed to riot like they did in this.     ",
      "vertigo": "9/10 Yeah, yeah, yeah, I'm only just now seeing it, shut up     ",
      "faces-1968": "9/10 Easily goes down as one of the hardest films to get through. There are really not that many scenes in this thing, especially for its length, but a million different things happened. Hundreds of emotions and unexpected turns happen in the span of 20 minutes. It's moving at such a fast pace but feels like it stays in one spot which reallyyy throws off your sense of time. It's fascinating yet grueling to sit through at times. I'm kind of on the same board as a lot of the other reviews I've seen. Like yeah, I kinda hated it, but I love it.     ",
      "cold-war-2018": "9/10 Man falling in love with upcoming singer? Gorgeous black and white cinematography? 4:3 aspect ratio? Yup, it's a 2018 film!     ",
      "sunset-boulevard": "8/10 I watched this back in September and toootally forgot to log it. I guess...that says something about the film? Was consistently entertained and invested throughout but never found myself extremely blown away by anything. Maybe I wasn't in the right mood that day?? Perhaps I'll give it a rewatch.   SORRY     ",
      "roma-2018": "10/10 It's been awhile since a film has left me completely speechless. Like, the kind of speechless where I was so overwhelmed that it wasn't until my walk home that I started breaking down. It's been awhile since I got lost in a film completely and forgot about literally everything in the most beautiful way possible. It's been awhile since I watched something special and one of a kind, something that makes me depressed to think I'll never see it for...     ",
      "its-a-disaster": "7/10 very specific type of comedy that happened to be my type     ",
      "shadows-1958": "7/10 Hard to critique something that's had such a heavy influence on some of my favorite films of all time and the film industry in general. First out of the five John Cassavetes films that I'm planning on watching over the course of this month.     ",
      "bohemian-rhapsody": "4/10 Hm. It wasn't....HORRIBLE. But yeah. From my general knowledge of Freddie, as well as what this movie is saying, he was the epitome of pushing boundaries and thinking outside the box and this movie is literally the fucking box. Straight Outta Compton and this felt so similar in how they were shot and told and they are about two COMPLETELY different groups. That's an issue. Everything besides Rami's performance and the cinematography was just okay. That being said it was...     ",
      "black-mirror-shut-up-and-dance": "9/10 I'm gonna throw up     ",
      "black-mirror-fifteen-million-merits": "8/10 I suppose I'll log these? I mean like if they're on Letterboxd might as well, right? Yeah this was sick. Score was very PDL. Daniel Kaluuya is a GOD.     ",
      "bird-box": "3/10 hidden meaning: they keep the blind fold on sandra bullock so you can't see her rolling her eyes at how ridiculously stupid and boring this movie is.     ",
      "black-mirror-bandersnatch": "7/10 Not gonna lie, this was so fun lol. Leave it to Black Mirror to not only get the chance to do this idea but do it in the most hilarious and disturbing way possible. It's way too WE LIVE IN A SOCIETY a lot of the time but towards the end I feel they were pretty aware how ridiculous it is. I've watched a few Black Mirror episodes and really enjoyed them so this really makes me want to plow through the rest.     ",
      "spotlight": "8/10 The scene where the kids sing Silent Night is just....so...good.     ",
      "spider-man-into-the-spider-verse": "9/10 I'm so overwhelmed. What do I even say that hasn't already been said. Could go on about the colors, the animation, the action sequences, the everything really. But for now I'm just gonna process the fact that Nic Cage shows up twice in my top 10 list this year.     ",
      "if-beale-street-could-talk": "9/10 Barry Jenkins could film himself taking a shit and it'd probably be one of the most beautiful things I'll ever see.     ",
      "elf": "7/10 It's all fun and games until you realize your diet isn't far from Buddy's.     ",
      "leave-no-trace": "7/10 As 2018 comes closer to an end I'm doing my best to catch up on some movies I missed this year (as you can tell from my inconsistent Letterboxd activity, I'm doing a pretty bad job so far.) I HEAVILY regret not catching this in theatres. Beautifully shot film. I, like most people, was totally moved by it and was on the verge of tears by the end. At times this film is almost hard to watch, and the fact...     ",
      "shoplifters": "9/10 I just....like....how could you not love this?  BEST SCORE OF THE YEAR     ",
      "the-rider": "7/10 Good     ",
      "a-charlie-brown-christmas": "10/10 literally perfection     ",
      "the-lobster": "9/10 imagine directing this     ",
      "lover-2018": "5/10 Before even getting into the review I just wanna acknowledge how much respect I have for Ralph for really doing it and making a feature. Regardless of the result, it was ambitious for his age and for his resources and I personally find it super inspiring. Now as for the movie. The music was definitely my favorite part. It was one of the main aspects that didn't feel very \"student film\". That and the cinematography. Aside from some shots that...     ",
      "thoroughbreds-2017": "7/10 Anya Taylor-Joy: The queen of being in movies that are shot really well and have a lot of potential but come out underwhelming.  I don't exactly know what it is that I didn't like about this but there was something I didn't like. Every technical aspect was phenomenal. Great cinematography, great editing, great sound design, etc. And also some pretty great performances. But wow just imagine Yorgos Lanthimos getting his hands on this lmfao. In fact this is an open letter to Yorgos to PLEASE BUT ANYA IN YOUR NEXT MOVIE, THANKS.     ",
      "forty-guns": "5/10 Well it was certainly a movie!     ",
      "ralph-breaks-the-internet": "7/10 Ya know what? I'll say it, that Slaughter Race song deserves a nom for best original song. Yeah this movie is fucking ridiculous. Like it's trying aggressively hard to be relatable and hip, more than anything I've seen before. And honestly sometimes it succeeds and it's pretty silly (I feel like a lame dad for laughing at the Ted Talk joke.) Other times are painful to sit through (basically the whole Buzztube virality thing was awful.) Also, not sure who...     ",
      "can-you-ever-forgive-me": "8/10 My most unexpected cry this year. Not once but TWICE did I shed a tear during this. But seriously, I only went to see this because I heard it had some good acting and my mom insisted I see it and it was sooo much better than I expected. It did an AMAZING job at making me connect to the characters. There were a lot of technical stuff and a few flat parts but other than that, I really liked it. Might raise the score later but for now I'm feeling a 4.     ",
      "overlord-2018": "6/10 This was very fun....or I mean the last 30 minutes were. The rest wasn't bad by any means, though I will say the dialogue was god awful in some scenes (nothing more generic than a good ‘CAN SOMEBODY PLEASE TELL ME WHAT THE FUCK IS GOING ON HERE.) But yeah, after getting through the end I was kinda bummed that so much potential was wasted for the first 2/3 of this. But to highlight some positives, BIG shoutout to whoever...     ",
      "wreck-it-ralph": "7/10 Watched this morning for the first time and forgot to log. Yeah this is super charming and entertaining. Some great voice acting too. Feel like there was a lot of potential that wasn't utilized but I guess if it had been it would have been a mess. I don't know, it's rare that I find just a simple and fun animated film nowadays that isn't as corny and painful as ‘The Grinch' or as deep and sad as ‘Coco'.  This was fun. I liked this.     ",
      "burning-2018": "8/10 I watched this, The Favourite, At Eternity's Gate, and fucking The House That Jack Built all in one week. I need to get my ass to the AMC and see Ralph Breaks the Internet or something because I can't do this heavy shit anymore.     ",
      "the-house-that-jack-built-2018": "8/10 Hauled ass from the airport to see this and boy am I glad I did. Gonna wait this one out for a star rating just because it's one of those that'll morph in terms of quality over time. Enjoyed it a lot. It was, embarrassingly, my first Lars Von Trier film and I kiiind of regret it. I know enough about him and his films to recognize his references to his own work in the film but there was definitely...     ",
      "green-book": "6/10 A movie with the goal of appealing to everyone somehow manages to be so damn unlikeable and easy to hate. But somehow it actually worked and got me to not despise it's corniness. Could it be Mahershala's amazing performance? Could it be Viggo's pretty good performance? Could it be the manipulative ass score? (I'm so fed up with this bland ass ‘best picture' music in all these dramas)  I'm looking at this a lot like how I looked at Love,...     ",
      "harry-potter-and-the-philosophers-stone": "6/10 *me checking how much time I have left 40 minutes into the movies*\"ugggghhhh\"*james franco with a noose around his neck looks over and smiles*\"first time?\"  (yes, this was my first time and yes I found out how to reference buster scruggs in this review)     ",
      "paterson": "9/10 I'm so overwhelmed. So many god damn motifs. This was like an episode of Louie but much better. I have a billion things to say about this. I need to watch it again or something and take notes and then write a biiiig fucking paper analyzing what all the little details mean. What's with all the twins? What's with the fireball thing? What's with the circles? What's with the black and white? What the FUCK is up with the Moonrise...     ",
      "at-eternitys-gate": "10/10 At Eternity's Gate is the ultimate tribute to art. It's use of visuals, sound, and writing all culminate into something as beautiful and complex as a Van Gogh painting. It had my attention from beginning to end, there was not a thing I didn't enjoy or appreciate about it, and there were multiple scenes and lines that hit me directly in the heart. I can see this being a hit or miss for a lot of people but when it hits...it is absolutely amazing.     ",
      "the-ballad-of-buster-scruggs": "8/10 Finally got around to it. Some people I know have loved this a lot and others haven't and I can see why it's like that. I'm definitely on the side that likes it a lot. The Meal Ticket and Prospector stories were definitely my favorite. As a lot of people have been saying, this thing feels like it's 3 hours long which bummed me out because while that final part was written incredibly well, I felt like it needed to...     ",
      "airplane": "9/10 Every Thanksgiving my family watches this and it never gets old. I've seen it over 10 times and I'm still discovering new jokes. One of my favorite comedies of all time...maybe my favorite.     ",
      "cam": "5/10 eh     ",
      "widows-2018": "8/10    Yes. Papa likes this one quite a bit. Papa loves a perfect third act. Papa loves a perfect cast with perfect performances. Papa loves a good twist. Papa loves good camerawork and editing. Papa loves watching Chicago films in Chicago.  Most importantly, papa loves his DANIEL KALUUYA OH MY GOD HE WAS SO GOOD.    I don't know why I went with the uncomfortable \"papa\" thing, it has nothing to do with the film. But yeah, good movie.     ",
      "boy-erased": "7/10 I'd like to publically apologize to everyone in the theatre for accidentally  burping during one of the sad scenes. -Liked this a bit more than I thought I would. At the same time though it says a lot that this LGBTQ movie wanted to make me cry harder than all the others and yet this may be the only LGBTQ film I haven't cried at lol.  It flowed insanely well in a way that made me completely engulfed in what was happening (props to the editors)  but I never felt any emotional attachment which is...surprising.     ",
      "the-lorax-2012": "2/10 seriously, fuck this movie  (my reasoning behind watching this and the grinch will make sense in like a week)     ",
      "the-grinch": "4/10 Where do I start.- Not a half star movie and I fully expected it to be that.- Animation was pretty good and interesting to look at- Kenan Thompson should do more voice acting - This was literally 10 minutes stretched out to 90 - It gets old after 15 minutes- If it wasn't Tyler I would have despised the fact that there was rap in this- FUCKING BROCKHAMPTON IS IN THIS. OUT OF NOWHERE. WHAT THE FUCK.     ",
      "unsane": "6/10 I've been laughing at how it cuts to the credits for like 5 minutes. Looked like something out of a student film lmfao.But aside from that yeah it's alright. Big fan of how it was shot, especually considering how they did it. The dialogue was pretty awful and made the whole thing feel super corny and far from believable. I also feel like this movie was actually trying to say something significant but everything about it made me want...     ",
      "wildlife-2018": "9/10 Protect Paul Dano at all costs.Been very excited to see this for awhile now and it definitely delivered.  Very impressed with the camerawork and how the stability of the technical aspects of the film worked in sync with the stability within the story. That was cool. Lots of little details and parts of it that would be super fun to analyze some day as well. I will say that while I enjoyed the ending, I feel like I was...     ",
      "suspiria-2018": "6/10 i'll never listen to thom yorke's voice the same wayreview coming soon     ",
      "being-john-malkovich": "9/10 Hate films like this because they're so good I usually just don't know where to begin when I have to write about them. It's one of those that takes full advantage of the creative freedom that comes with filmmaking and reminds me why I love this art form so much.  Not a horror film but the existential anxiety that this comes with is enough for me to qualify it as a spooky watch for Halloween this year.     ",
      "hi-stranger": "9/10 This is...one of the best things I've ever experienced.     ",
      "young-frankenstein": "9/10 Embarrassingly haven't seen it until now. I know. Shut up.  This is one of the funniest movies I think I've ever seen. Was literally still laughing after it ended. Thank you Will Wright for forcing me to watch it.  Can't wait for October to be over so friends can stop forcing me to watch classic horror flicks that I'm reluctant about at first but end up loving and then have them laugh at my face at how I'm wrong about everything.     ",
      "bad-times-at-the-el-royale": "8/10 Omg what a load of fun this was. It's a miracle this wasn't a mess.   I think what I loved and appreciated more than anything was how Hollywood this felt. Everything from the cinematography to the writing felt so classic, if that makes sense. This thing is also long and that scared me at first but I didn't feel the runtime at all. Before I knew it the credits started rolling.    A few points dragged pretty hard and it...     ",
      "dr-phibes-rises-again": "3/10 very few things to like about this     ",
      "kikis-delivery-service": "8/10 Lmfao Kiki is the most relatable character in film history.   Maybe not the most imaginative Ghibli movie I've seen but certainly the cutest and most charming. I loved the colors so much, those blues were BLUE.  The stakes are hilariously low in this film but LOOK AT THE CAT HOW COULD YOU NOT LOVE THAT?     ",
      "the-abominable-dr-phibes": "8/10 Watched three movies tonight and this was the last. Dr. Phibes you absolute madman.     ",
      "house-on-haunted-hill": "8/10 just a bunch of smart people being idiots  very fun     ",
      "white-zombie": "6/10 jealous of whoever got hired to do the vulture noises   fun story with some great music. but looool at those transitions.     ",
      "first-man": "9/10 :) deciding if I do a video on it :)     ",
      "beautiful-boy-2018": "8/10 review coming soon  rip mac miller     ",
      "robots": "8/10 I watched it at the airport because I was bored. I have a real score but I don't know if I'm ready to reveal what I really think about this movie to the rest of the world. I really like how a lot of people can't tell if I hate it or genuinely love it. All I gotta say is...is...uhm...  GET UP OFFA THAT THANG     ",
      "se7en": "8/10 Yeah, yeah, yeah, haven't seen it until now. Whatever.It's undeniably great but I really didn't understand what was so special up until the last 20 minutes. Those last 20 minutes are great lol. But yeah, the rest of it really just felt super well done but lacked any sort of flavor. Like at the end of every scene I wanted to know what would happen next but at the same time if my laptop all of a sudden died,...     ",
      "mid90s": "7/10 video review soon     ",
      "tron": "4/10 Was shown a clip of this in class today and it intrigued me how much tedious work went into the vfx behind it. It looked very choppy and cheap and dated yet very cool at the same time.  So that being said as soon as I got home I decided to give the full thang a watch.  All I'm gonna say is, I got about as much out of seeing the clip in class as I did watching the entire...     ",
      "the-sisters-brothers": "9/10 Looooved. Mostly because of the cast and their performances. John C. Reilly kills it. Probably gonna see again.  Check it out     ",
      "her": "7/10 Saw this for the first time a few weeks ago and forgot to review it. It seems like something I'd really like because the world-building is AWESOME and the cinematography and overall mood is very \"Karsten\" according to my friend. Unfortunately it didn't hit as much as I thought it would and was definitely uncomfortable (as expected). I definitely want to see it again, though.     ",
      "the-longest-summer-in-america": "10/10 never thought i'd ever see anthony fantano on a giant movie screen. yet here we are.     ",
      "white-boy-rick-2018": "4/10 in one month I will have forgotten I saw this. this movie didn't do anything necessarily wrong and I think that's the issue. nothing relatively unique or interesting happened. only time I was really like \"oh my god\" was when Danny Brown showed up and did his classic Danny Brown laugh.     ",
      "pine": "9/10 the best god damn movie of all time wow! and how about that SCORE? damn, talented dude...     ",
      "so-is-this": "9/10 I hate film school     ",
      "bottle-rocket-1996": "7/10 2nd watch.  Much to like, much to dislike. I still find this pretty entertaining and charming despite how much of a mess it is. Nobody involved in the film really knows 100% of what they're doing but it still manages to work. Even my least favorite Wes film is still a pretty good film.     ",
      "hoodwinked": "7/10 one of the funniest animated films i've seen with some of the worst animation i've seen     ",
      "madelines-madeline": "7/10 jokey review:.....what  actual review: it took me a little bit to wrap my head around what I had just seen. this is a movie that takes so many risks and anyone who cares at all about movies should check it out. i honestly don't know how to talk about it because honestly i can't exactly say i've seen anything like it. i'm also just not sure i have a full grasp on everything that happened in the film. what i do know and can say is that i'm sure as hell not gonna forget about this one.     ",
      "only-god-forgives": "5/10 'Only God Forgives' is a bad movie disguised as a good one.  This is a movie where I feel like your level of enjoyment depends entirely on how you approach it. Some people go into it wanting a surreal visual experience, others want a compelling story, others want cool fights and blood. The issue with this film is that it can't make up it's damn mind with what it wants to do.  When it focuses entirely on being an *experience*,...     ",
      "searching-2018": "8/10 this was really great. honestly could have been a masterpiece if some of it was a bit more believable. but man, I know this has been said thousands of times by now but I cannot IMAGINE the headache this was to edit.   Also, convinced john cho is excellent in everything he is in, cannot wait for more of him.     ",
      "mommy-2014": "10/10 O N E H U N D R E D M O V I E S ! ! !(video coming soon)  Sometimes I watch a movie and from the first few minutes can tell it's going to be some shit that I'll love. This was one of them. Matter fact, just by looking at the poster and knowing the synopsis, I knew this would be up my alley. Within the first few minutes you know how this film is...     ",
      "breathless": "6/10 this movie (oh sorry, this FILM) gave me lung cancer  sorry i guess i need to see it again, i didn't really give a hoot about anything happening. aesthetically it was pleasing i guess but that can only get you so far. good score.      ",
      "suspiria": "6/10 Great colors and very goofy but not as good as I thought it was going to be. Excited for Luca Guadagnino's remake.     ",
      "inception": "9/10 I have a penis, ofcourse I loved this.     ",
      "trainspotting": "8/10 you know how you can smell certain movies? yeah, this one smells like cigarettes and feces.     ",
      "rear-window": "10/10 take a shot every time james stewart goes \"now wait a minute\"     ",
      "pans-labyrinth": "8/10 Gotta revisit. My sister is moving in to college tomorrow, I just uploaded a video, and I also am in the middle of editing another video so needless to say...I didn't really give this my full attention. But with how little time I have to plow through the remaining 8 movies I'm gonna review it anyway.  Beautiful cinematography, loved the set design, and Guillermo del Toro just knows how to make you get emotional over shit you normally wouldn't get emotional about. Again, deserves a rewatch.     ",
      "the-terminator": "6/10 How can something be so fun yet so boring at the same time.     ",
      "apocalypse-now": "9/10 Wow lol. Pretty amazing. If I had to describe it in one word it'd be \"crisp\".     ",
      "12-angry-men": "10/10 A new favorite. I feel dumb trying to summarize what I loved about an already established masterpiece because I know so many others have done so much better. All I'll say is that it's perfect in pretty much every way. A film that does literally no wrong and goes above and beyond what it needed to do. Gonna watch it again as soon as I get through these next 10 films.  MASTAPIECE      ",
      "the-miseducation-of-cameron-post": "7/10 This movie felt like it set me up for a lot and then I only got a little bit out of it. Still pretty good, worth checking out if you're interested in seeing more LGBTQ films. Just wish it had more.  Essentially just ‘One Flew Over the Cuckoos Nest' but for the gay community.     ",
      "dr-strangelove-or-how-i-learned-to-stop-worrying-and-love-the-bomb": "8/10 great cinematography, great performances, and very funny. i think i was supposed to love this more and i probably will someday, just not now.     ",
      "to-all-the-boys-ive-loved-before": "5/10 We're cornering in on very few remaining films in my 100 Summer films list and they all seem sorta heavy so tonight I just decided to watch some light ass shit.   This is by no means a bad movie, just very much not my thang at all. Despite that it still managed to hold my attention which is worth praising. The only things I really enjoyed about it was the cuteness and the somewhat interesting story. Not much else. But again, not a bad movie, definitely a good one for all the younger folks out there.     ",
      "adaptation": "10/10 Whoever told me to add this to the 100 Summer Movies list, thank you. I think I just fell in love with film all over again.     ",
      "psycho": "9/10 I have like nothing to say about this. Not in like a \"DUDE I AM SPEECHLESS\" way, I just have nothing new to say about it. Yeah, it's good. Okay on to the next one.     ",
      "eighth-grade": "9/10 Not ready for a score. All I'll say is that it's this year's Lady Bird but a completely different movie. Cried from laughing and from crying. I love Bo Burnham, I love Elsie Fisher, and ofcourse...I love A24. UGH     ",
      "demetri-martin-the-overthinker": "7/10 One of my favorite comedians. I know it'd probably be terrible, but I really want Demetri to make a movie.  EDIT: apparently he did make a movie, apparently it's not great     ",
      "inherent-vice": "8/10 yeah. definitely need to watch this again. but yes, it's pretty fantastic.     ",
      "guy-and-madeline-on-a-park-bench": "8/10 Man. Damien Chazelle really loves his jazz, man. Also I know it's like really amateurish and low budget but why does this have a 3.0 average rating? I really liked it idk     ",
      "blackkklansman": "8/10 There have been several great films this summer that have addressed race issues in America and police brutality and they've all done so in incredibly unique and memorable ways. This one seemed to hit the most. Not a film that necessarily feels like it should be critiqued, just one that needs to be seen. Does it have it's flaws? Of course, but they feel so small and unnecessary to address when putting this film in the context of the world we're living in and have been living in for so long. Left the theatre pissed off.     ",
      "the-seventh-seal": "9/10 Oh, this was great. Took me a little bit to get into it and get used to it's tone (I'm like that with most religious films), but once I was in it....I was in it. Great ending and also LOVED how it was shot. The framing was super interesting and I basically liked looking at every shot.     ",
      "casablanca": "7/10 Three times. Three separate times I have tried to watch this, falling asleep each time and never being able to finish it. Not sure if I should blame the movie or my horrible sleep schedule, but it took way longer to watch this than it should've. Anyways, yeah it's fine but not my type of thing.     ",
      "the-secret-life-of-walter-mitty-2013": "6/10 I understand this hitting for a lot of people because yeah, it's good. Something about it just never stuck with me, though. Can't tell if it's the awkward dialogue, the SpyKids-esque CGI, or a few of the uncomfortable performances, but something just made me not love it as much I was supposed to. BUT the cinematography was surprisingly extremely good.     ",
      "red-beard": "10/10 Just gonna come right out and say it...better than ‘Seven Samurai'. This had my attention from beginning to end. Everything about it was flawless, not to mention how moved I was by the end. It tackles the idea of death as well as mental health and the morals surrounding that (and much more), and I'm probably gonna remember what I learned from this film forever. I can't believe I'm saying this about a 3 hour long black&white film from the 60s but I'm PROBABLY gonna watch it again soon. Loved it.     ",
      "the-red-turtle": "9/10 When trying to figure out what exactly ‘The Red Turtle' was about, I kinda realized it was about everything. It addressed life, death, love, hate, adolescence, curiosity, the human race's reliance on nature and nature's reliance on the human race. It tells these topics with such care and fragility that while it may be dense, it stills feels incredibly atmospheric. And it does all of this under beautifully immersive animation and a runtime of only an hour and 20 minutes.     ",
      "isle-of-dogs-2018": "9/10 it good     ",
      "a-clockwork-orange": "8/10 Pretty amazing as a whole thing but I just wish the middle was as interesting and surreal as the beginning and end.  Deserves a rewatch. Great poster.     ",
      "fat-girl": "5/10 I thought a few parts were well done but I was basically underwhelmed for most of it and then the ending was just way too much. I was just not enjoying my time watching this and yeah I know that might be the point but also I just feel like it could've been told a bit more interestingly. Men are trash, though.     ",
      "the-master-2012": "9/10 Oh jeez, that was something.   Uhhh, I don't know, nothing I say can really properly describe how beautiful I thought this film was. Beautiful in it's writing, performances, and obviously cinematography. I am seriously amazed a story like this was told so well and in such a fascinating way. Going to be thinking about this one for awhile.     ",
      "blindspotting": "9/10 came out of the theatre shaking. still have much to process but yeah everyone should be seeing this. gonna go listen to clipping now because daveed diggs is the best.     ",
      "close-up": "9/10 A beautifully bare-boned film that I can truly say is unlike anything I've seen. Probably not for everyone but the story is soo damn interesting to me. I'll leave it at that.  I'm also just realizing this was my 69th out of 100 films this summer and I totally regret not wathing ‘Love' instead.     ",
      "mission-impossible-fallout": "8/10 3rd act is perfection. Tom you crazy fuck.   (Still deciding on a score)     ",
      "die-hard": "8/10 This movie really made me think a lot about how movies really shouldn't have to make you think a lot. This is one of those that proves you really don't have to say SHIT to make an entertaining film. The editing, camerawork, performances, and direction are all on the same page with what they wanted this movie to be. Nice way to start the day. Merry xmas <3     ",
      "nocturnal-animals": "7/10 A movie with this great of a story doesn't deserve the half-assed cinematography, overly dramatic score, and ATROCIOUS editing that it came with.     ",
      "rashomon": "8/10 my third kurosawa. feminist but also totally not, amazing camerawork, overall a good time that'll probably be stuck in my head for the next few days.     ",
      "ex-machina-2015": "9/10 Oscar Issac would make a great Tony Stark.     ",
      "mishima-a-life-in-four-chapters": "10/10 Overwhelmingly beautiful to a point where I definitely owe it a revisit because before I could fully digest one line, we were on to another even more layered piece of writing. Maybe one of the best written films I've seen, one of my new favorite endings, and EASILY my new favorite score.  I am so late to this train but Paul Schrader is the freaking MAN.     ",
      "rushmore": "8/10 Saw this a few years ago and rewatched last night. Still think it's very enoyable but some moments are unbearably dull.  But come on, the dude saved Latin.     ",
      "raging-bull": "8/10 Up until the halfway point of this I was sort of interested but at the same time not at all engaged with what I was watching or what would happen next. Then the last half happened.  I couldn't look away and I grew such an appreciation for this story and how it was told.  Each shot, cut, and line is so carefully put together to make it what it is and the result is something so authentic and terrifying to...     ",
      "hot-summer-nights": "4/10 If the editing wasn't such a disaster, if they focused less on being so trendy and more on the writing, if this town where supposedly everyone smokes weed had characters that seemed like they actually smoke weed, and if the whole thing just made more sense...  we might actually have something great here.     ",
      "my-neighbor-totoro": "10/10 Gonna come right out and say it. It was better than Spirited Away.  While Spirited Away is definitely more epic and has a lot more ideas to it, Totoro has a lot more heart and personality. For the first time in a long time I can genuinely say I feel like a kid again and I can't thank this film enough for giving me that feeling. There were many times as a kid, and even now, where I just wanted...     ",
      "persona": "9/10 Confused but I think it was really good. Lol     ",
      "eyes-without-a-face": "8/10 hot stuff     ",
      "three-identical-strangers": "7/10 Good, but also had a few boring spots which sucks because it's a really fascinating story. Also felt soooo long for only being an hour and 45.     ",
      "set-it-up": "3/10 The funniest part is the lack of Pete Davidson despite him being the only one on the fucking poster for the movie (on Netflix, not here).     ",
      "almost-famous": "8/10 Pros: Frances McDormand and the gay drummer.Con: Patrick Fugit's entire performance.  Billy Crudup was also SOOOOO good in this, Russell's whole character in general was just amazing to me.   *I'M ALSO OFFICIALLY HALFWAY THROUGH THIS DAMN SUMMER LIST*     ",
      "et-the-extra-terrestrial": "4/10 Redeemed myself after bashing CMBYN so now I'm gonna fuck it all back up and go after E.T. Feel free to attack me as much as you want in the comments for not enjoying this.  This is easily my least favorite thing Spielberg has done. Had I seen it as a child, maybe I would have liked it more, in fact I definitely would have liked it more. But seeing it now was grueling and felt like a chore to...     ",
      "sorry-to-bother-you": "7/10 my goodness lol(review on YT coming soon)     ",
      "eraserhead": "8/10 We've all been there.  (In all seriousness this was my introduction to David Lynch and I have to say, definitely intrigued and excited to watch more of his stuff)     ",
      "call-me-by-your-name": "8/10 I have no idea how to feel about this. It was a great movie but I could not get over how uncomfortable the age difference made me and how that was never really addressed. Maybe I missed something. Aside from that this film addressed romance SOO well and boy oh boy that monologue in the end. Definitely check it out.     ",
      "under-the-skin-2013": "9/10 Never in a million years did I think a movie that would make me contemplate my existence would also have Darude - Sandstorm in it.     ",
      "the-emoji-movie": "1/10 I mean like...     ",
      "submarine": "7/10 Did I just follow up a Wes Anderson ripoff with another....Wes Anderson....ripoff? Yes, but this one was significantly better.  Checks off every box of the \"quirky movie\" list, sometimes it works, other times it's irritatingly unoriginal (how many times are we gonna see an angsty white male protagonist with girl problems jump into a swimming pool fully clothes while an indie song plays in the back). But overall, it's a good watch.     ",
      "the-longest-week": "3/10 If Wes Anderson didn't already exist I guess this would be fine...except it still lacks any sort of ANYTHING to make me care at all.  Also who told me to add this to the summer100 list? Whoever you are, fuck you.     ",
      "clueless": "7/10 A much different film than The Holy Mountain.     ",
      "the-holy-mountain": "9/10 Finally got around to this thang.  Really enjoyed it, specifically the ending. Really drove home a lot of interesting approaches to how society looks at desire and success. Few pretty pretentious spots here and there, but does that matter? Does anything even matter? Does this review even matter?     ",
      "your-name": "6/10 Gonna be honest, really wish I liked this a bit more.  It felt like 5 different types of movies were happening and as a result it came out messy. Like it was one build up of piano music after another that each lasted 5 minutes and got irritatingly repetitive after awhile. I was attached to it and it was undeniably very beautiful visually (specifically that scene at around the one hour mark), but I really just wasn't digging how they approached telling the story.  SORRY     ",
      "boogie-nights": "9/10 GOD ONLY KNOWS WHAT I'D BE WITHOUT YOUUUUUUUU     ",
      "baywatch": "6/10 THIS. IS. WHAT. TAG. SHOULD. HAVE. BEEN.     ",
      "daisies": "7/10 Women ruleMen are lame   I love colors     ",
      "requiem-for-a-dream": "8/10 Gonna sit on this for a lil bit and rate later.But jesus christ I don't even wanna take Advil after watching this. I hate Darren Aronofsky and all the anxiety he has given me with his films.  Gonna go check on my mom now.     ",
      "chungking-express": "6/10 I wanted to like it....so badly....but I didn't care about anything that was happening.     ",
      "the-godfather": "10/10 I was sooooo ready to say this was overhyped but nope, it's as good as everyone says it is. On to part 2.     ",
      "jurassic-world-fallen-kingdom": "5/10 I really don't know. I feel guilty for not giving it my full attention but at the same time I feel like it delivered me the most half-assed, unimportant, and unnecessary movie I've seen in awhile. BUT , it was entertaining. I'm not a huge Jurassic Park/World fan but I keep seeing these movies and I keep secretly enjoying myself.  Oh but I will say this had the worst performances of the year, hands down.     ",
      "a-trip-to-the-moon": "8/10 Loving this new Damien Chazelle movie but where was Ryan Gosling?     ",
      "american-psycho": "7/10 A bit....underwhelming...if I'm being honest. Definitely a good movie but not anything that really hit me in any particular way.     ",
      "little-miss-sunshine": "10/10 Been meaning to watch this for a while now and sheesh I loved it. What a smart and special movie with such a great underlying message.   I live for this cheeseball indie sundance shit.     ",
      "tag-2018": "2/10 The only thing dumber than this movie is me for thinking this movie would be good     ",
      "incredibles-2": "9/10 Can't believe I just finished what was 2 years of anticipation. Much to say, review coming at some point!     ",
      "thor-ragnarok": "5/10 When something exciting was happening it was fun but when anything remotely unexciting was going on it felt like a chore to keep watching because believe it or not, I couldn't care less about Thor.     ",
      "it-follows": "8/10 Huh. That was really cool. Loved the score and the way it was shot, so unique. It's so close to being a masterpiece to me but it's missing something that I can't put my finger on. Really great, though. Definitely going to be checking it out again.  Even more excited for Under the Silver Lake now.     ",
      "bao-2018": "9/10 I love Pixar again!     ",
      "the-incredibles": "10/10 Rewatched because I'm making a little video on it or whatever and that's all I'll say for now.     ",
      "a-short-vision": "9/10 *Thank you Will Ackerman for recommending this*Great animation but not something I should have watched before going to bed. Really dig the simplicity of it, though.     ",
      "donnie-darko": "7/10 Ugh lol, like Jake did a good job and the concept is super cool but I hate how it was executed. This movie would be a masterpiece if it didn't act like it was a masterpiece the entire time.     ",
      "the-theory-of-everything-2014": "3/10 What is this CBS in the morning  ass bullshit?     ",
      "oceans-eight": "1/10 I think they edited this in.....iMovie.....     ",
      "dogtooth": "9/10 Sheesh, this is disturbing on so many different levels. Yorgos Lanthimos must have the most awkward ass family get togethers.     ",
      "sing-street": "7/10 Awkward and fun. I can see why a lot of people love it but it didn't seem to hit me in any particular way, just kinda meh. Good stuff, tho.     ",
      "singin-in-the-rain": "10/10 I'm late to the party but yeah, it's as good as people make it seem.One of the more entertaining films I've seen, not a single dull moment. Also Cosmo is the best part of it.     ",
      "the-shining": "10/10 watched in 35mm at music box  friggin love it, nothing to say that hasn't already been said  *MASTAPIECE*     ",
      "american-beauty": "4/10 A perfect movie. That's been said a million times but yeah. That's all.     ",
      "drive-2011": "9/10 Yes, I just saw it for the first timeYes, I loved everything about itYes, Ryan Gosling     ",
      "beyond-the-black-rainbow": "9/10 Last week I showed my roommate my favorite movie of all time (Mr. Fox), this week he showed me his...basically the same movie (sarcasm).~I don't really know where to begin and I'm not going to bother getting analytical so I'll just state my general reactions and thoughts. This movie made me go \"please for the love of god speed the hell up\" while simultaneously making me go \"alright wait stop..wait...GO BACK NO...WHAt-WHAT THE FUCK IS HAPPENING\".   Regardless of...     ",
      "boy-2010": "7/10 Short, sweet, and technically flawless. Would easily be a 5/5 but something about it just didn't stick as much as I would have wanted it to. It was like really good chicken without any sauce (I sound like an old man, what the heck).     ",
      "megamind": "7/10 Does it Whip??? Figure out on episode 2! coming soon     ",
      "we-need-to-talk-about-kevin": "9/10 Starting my 100 Summer Films early because that's a lot of movies. What a way to start. Not sure what to say without turning this into a 10 page paper. Amazing movie all around.     ",
      "deadpool-2": "6/10 main channel tomorrow     ",
      "swiss-army-man": "9/10 HEY!!! I LOVE IT     ",
      "disobedience-2017": "5/10 Forgettable, lots of filler, very dull colors, but still a pretty good movie ¯ _(ツ)_/¯     ",
      "columbus-2017": "9/10 1. One of the best shot films I've seen in a while. Every single shot is so carefully framed and makes you want to pause and just look at it for a while.2. This movie feels like it was made for people to write essays about it. Metaphors are being thrown at you left and right to a point where I don't know what is and isn't symbolic.3. I all of a sudden want to visit Columbus very badly.     ",
      "spider-man-homecoming": "7/10 Somehow exactly what I was expecting yet way more than what I was expecting. Ridiculously fun and entertaining. Just felt like a straight up fun super hero flick which I surprisingly can't say I've seen in a while. Obviously it had it's issues here and there. For one, until the last 45 minutes it felt like a bunch of different action scenes and that nothing was really progressing. Was still entertaining regardless but it didn't feel like it was going anywhere for a little bit there. Anyways, very fun, glad I saw it, probably going to watch it again at some point.     ",
      "tully-2018": "8/10 Not sure if I want to review it on the main channel. Saw it though and I really enjoyed it, will go in depth at a later timeUPDATE:Yeah, I'm gonna review on main channel so look forward to that     ",
      "fantastic-planet": "8/10 one of them odd movies, ya know?     ",
      "avengers-infinity-war": "8/10 Review going up on the channel     ",
      "lean-on-pete": "8/10 the horse movie     ",
      "mad-max-fury-road": "9/10 i livei diei live again     ",
      "minding-the-gap": "9/10 beautiful beautiful beautiful beautiful     ",
      "the-lego-movie": "10/10 mastapiece     ",
      "you-were-never-really-here": "8/10 I'm sad     ",
      "ready-player-one": "3/10 I don't know. Had a cool ending, the first half was ASS though. Fun, I think? Bleh     ",
      "american-graffiti": "8/10 Very very very good monologue in here near the end that I loved.     ",
      "a-fantastic-woman": "9/10 HOLY COW     ",
      "a-quiet-place-2018": "7/10 doing a video review on it (meaning no score on here), just wanted to log it     ",
      "life-is-sweet": "8/10 Life Is Sweet more like this uh..this *cough* this MOVIE is...sweet.     ",
      "the-death-of-stalin": "7/10 Had to be pee VERY badly halfway through this thing soo that had an impact but I enjoyed it! Very funny, surprisingly interesting for a historical film (that genre usually isn't my cup of tea), and some great performances.     ",
      "seven-samurai": "10/10 One of those where you finish it and kinda just sit there in disbelief that this is a movie that exists. Sheesh, what a monster.     ",
      "a-ghost-story-2017": "9/10 I decided to randomly give this thing a watch because Amazon Prime babyy and my god.A friend labeled it as one of the most beautiful films he's ever seen and I can't really put it better myself. It is incredibly smart, the score is completely hypnotizing, there is so much crammed into such a short run time but it doesn't feel too packed, and oh my gosh the cinematography made me DROOL. I can't emphasize how surprised I am...     ",
      "game-night": "5/10 A few really funny scenes. Too many jokes and scenes and subplots that went on foreeeeever. Pretty fun, not something I'd ever watch again, though.     ",
      "love-simon": "7/10 YA KNOW WHAT  I LIKED IT A LOT(full in depth review will be up for the Patreon peeps later tonight)     ",
      "twister": "3/10 My mom saw this on TV and was like \"Let's watch Twister!!!\" and I clocked out right then and there     ",
      "the-shape-of-water": "7/10 Boy oh boy, this is an odd one. The way it told the story was very hypnotic and the pace was pretty much flawless. On top of that, this film is beautiful in both it's visuals and it's writing. Also one of the better endings I've seen this year.  My issue is that the tone seemed to be a little all over the place. Couldn't really tell what exactly I was supposed to be watching or feeling in a couple of the scenes. I also wish the rest of the film took itself as serious as the ending did.     ",
      "drunken-angel": "9/10 Getting a FilmStruck account was the best decision of 2018 lol     ",
      "three-colours-blue": "9/10 Not in the mood to get into this but there were like a million things being said in almost every shot and i love that about this film     ",
      "coherence": "8/10 This gave me more anxiety than any film I've ever seen and I'm going to be legitimately traumatized for the next days/months/years FUCK     ",
      "three-billboards-outside-ebbing-missouri": "8/10 MAN was this great. Every scene was unpredictable, it was funny, some nice social commentary, great performances, overall really great. Definitely see it if you get the chance.     ",
      "annihilation": "8/10    This (the score) is probably going to be edited over time, but I wanted to get out my thoughts while they're fresh:  This is a movie everyone should have to sit through. I don't think it's necessarily important because of any political reasons or anything truly meaningful, but it puts you in a mindstate that very few films (at least that I've seen) have put me in.  I would love to see a recording of me watching this because I...     ",
      "creep-2": "8/10 I love this series so much     ",
      "lou-2017": "8/10 I went to see all the nominated animated shorts for this year and I'm not gonna write about every one of them but I had to say something for this bad boy. This is, I kid you not, the best thing Pixar has made in years..... YEARS.     ",
      "rocky": "8/10 watched this in class today. it's like 10% boxing which was kinda hilarious to me but it was very good.     ",
      "the-post-2017": "8/10 I loooooooove how this was shot and the overall look and style of it. I don't know man, wasn't expecting much but I ended up really enjoying it. Briefly forgot how good Spielberg is at what he does.     ",
      "thelma-louise": "8/10 Watched 4 class. Soooo unbelievably fun and entertaining and badass. I see myself watching this over and over again in the future. Also lol Ridley Scott.     ",
      "phantom-thread": "9/10 I mean yeah it was great but damn the driving in this gave me more anxiety than the driving in Baby Driver     ",
      "moon": "5/10 Watched for class today. I'm not sure if I'm just a dumbass but it felt a little messy in terms of how it was trying to tell it's message. I mean I suppose it's a hard concept to pull off but I don't know, was frustrating to watch because of how much I wish I understood what was happening the entire time.     ",
      "frances-ha": "9/10 Really liked this. Slowly realizing Greta Gerwig has my exact sense of humor and pulls it off insanely well. Just felt like a movie that was right up my alley in terms of a tone.     ",
      "the-silence-of-the-lambs": "10/10 Just watched for the first time and I mean yeah I can't really find anything wrong with it and I loved it a lot and kinda wanna see it again like right now     ",
      "mother-2017": "6/10 I don't know     ",
      "lars-and-the-real-girl": "8/10 Watched for a class. I saw this a few years ago (also for a class) and really liked it and this time around it was just as good. I guess I can only see you liking this if you're into quirky films with lonely protagonists that live in the middle of nowhere. If you're not into any of those things you'll probably hate this thing, I don't know I like this a lot.     ",
      "one-flew-over-the-cuckoos-nest": "9/10 👍🏼     ",
      "i-tonya": "8/10 I, Tonya is a film I've been hearing about for a few months now as the trailer has been shoved down my throat at every movie I've gone to. I've been hearing about how fantastic Margot Robbie is as Tonya so I figured I should probably see this.  First off, this movie was a hell of a lot more than I thought it'd be. I mean this thing really goes places you don't want it to go but they end...     ",
      "wonder-2017": "4/10 This is like if Bed Bath & Beyond made a movie     ",
      "scott-pilgrim-vs-the-world": "8/10 Watched this again with the family. My dad hated this thing. While I will admit some scenes are too cringe to enjoy, this movie is so undeniably fun.     ",
      "split-2016": "6/10 This was almost really good. There were some really stunning shots here and there and I'll admit I was spooked when \"the beast\" happened, but like this movie did not know how to end.     ",
      "the-sound-of-music": "4/10 Hey, I know a lot of people love this movie but like....not my thing. I don't know, man. It's long, it's a little boring imo, not my thing. SORRRYYY!!     ",
      "shaun-of-the-dead": "9/10 Just rewatched it with my pops. He fell asleep but I loved it just as much the second time. Such a goofy ride, not sure how you can't smile while watching this.     ",
      "captain-fantastic": "8/10 Wowwwww, was not expecting that much of an emotional ride. Beautifully shot, really sad, kind of confused on where to stand on the whole thing.  I cannot recommend it enough. Half star off for the song they sang near the end, sorry. It was a little awkward and threw me off a bit ¯ _(ツ)_/¯     ",
      "the-big-sick": "7/10 Ugh, got me in the feels quite a bit. Hm, just gonna um...leave it at that.     ",
      "film:151796": "3/10 Lol forgot I saw this. Pretty funny, kinda disappointing, very forgettable.     ",
      "moana-2016": "7/10 Saw it over Thanksgiving for the first time. Really good animation, nice soundtrack, overall really fun film. The plot seemed a little messy and too all over the place while at the same time kinda bland so there's that but eh, worth checking out.     ",
      "the-room": "2/10 Listen man...this thing is so bad from a technical standpoint (and from every other standpoint) but as James Franco has been saying in every interview, there's something really good about it. I'll just leave it at that.     ",
      "jim-andy-the-great-beyond": "7/10 Pretty disturbing in a really weird way. I enjoyed it but not sure I'd ever watch again.     ",
      "the-disaster-artist": "7/10 I am so glad this wasn't a disappointment. One of the funniest films I've seen in awhile and also one of the most inspiring. Very important film to see as a film major.     ",
      "olafs-frozen-adventure": "2/10 This sucks.     ",
      "the-boss-baby": "6/10 Hahahahahahahahahahahahahaha. I actually really liked it.     ",
      "pirates-of-the-caribbean-dead-men-tell-no-tales": "4/10 This movie was so boring, dog.     ",
      "don-jon": "7/10 I really don't care what anyone says, I could watch this movie over and over again and still love it.     ",
      "coco-2017": "8/10 Loved it. Amazing animation, super colorful and overall exciting. Might be Pixar's best work in terms of animation. In terms of a story I feel like it had some more potential for humor in it, but oh well. Liked it a lot.     ",
      "dunkirk-2017": "7/10 While it does feel like a movie I should like because everyone else likes it, I still really like it. AMAZINGLY shot and great performances all around. I have nothing to say that hasn't already been said about it.     ",
      "manchester-by-the-sea": "7/10 Not sure I could watch it again, but that doesn't mean this wasn't a great film. Sooo well written and amazingly shot. Don't really need to say much about the performances. Really well done.     ",
      "hail-caesar-2016": "5/10 Wasn't bad, wasn't great. One of the most average films I've ever seen. Pretty disappointing considering what I was expecting but oh well.     ",
      "deadpool": "9/10 Lol I really liked it. Super funny and awesome watching this kind of story done on such a high budget.     ",
      "sausage-party": "1/10 I really wanted to like this film. Especially considering it would have been a great breakthrough for adult animation but I can't think of a more immature and lazy way this could have been done. Not really funny at all and horribly animated. While it sure isn't the worst thing I've ever seen I might go ahead and label it as my least favorite movie just because of how offensive, unnecessary, stupid, abd just fucking horrible it is.     ",
      "the-jungle-book-2016": "7/10 Good date film. Few corny moments here and there but great adaptation.     ",
      "captain-america-civil-war": "5/10 Much better than what I expected. Definitely made Iron Man a bit more interesting than he's been as of recent. Great action sequences. Like most Marvel films the colour correcting was annoyingly muddy and its stay was a tad overdue but oh well, I enjoyed it.     ",
      "hell-or-high-water": "8/10 Saw this with Will R first quarter, first time at Landmark. Definitely one of my favourites of the past year. Well shot, well written, well acted. Super badass with a soft side to it. Should have received a bit more attention in my opinion.     ",
      "finding-dory": "8/10 While I am totally against Pixar's recent sequel phase, I think this film gets much more hate than it deserves. Really well done besides some of the excessive Nemo references in the beginning. Loved it.     ",
      "kubo-and-the-two-strings": "9/10 Beautifully animated, definitely need to watch again.     ",
      "la-la-land": "9/10 Love this movie more than I love myself     ",
      "arrival-2016": "9/10 Saw this with my friend Nihal last minute the last night it was showing. Really had no expectations based on what I had been hearing. Usually not a sci-fi and was pleasantly surprised when I realised it wasn't exactly that. Totally mind blowing and stunningly shot. Overall great film.     ",
      "rogue-one-a-star-wars-story": "5/10 My friend put it very well when he described the film as a comic book series that would have gone to waste if not turned into a film. Totally worth making, definitely not unnecessary. I'm sure if I knew a little bit more about the Star Wars franchise I would understand and appreciate more than I did, but not knowing about the world the film is based around for a film entirely made for the people do isn't a reason to get upset about it. Looks great visually and my god that third act was amazing.     ",
      "passengers-2016": "3/10 Haha eh...the beginning was okay but boy oh boy did it go downhill first.     ",
      "get-out-2017": "9/10 Went to this one on a date with my girlfriend, totally lives up to the hype it's gotten. Can't really find a flaw in it. Can't really say it's something I'm able to keep coming back to but from a technical standpoint, absolutely nailed it. Also, that poster looks so slick.     ",
      "the-lego-batman-movie": "6/10 Anything this animation company puts out that involves LEGO is automatically going to go over well for me just because of how crazy good it all looks. Like, dog...it looks so cool. But in terms of the movie, some of the jokes fell a little flat for me and the raps...agh /:     ",
      "guardians-of-the-galaxy-vol-2": "7/10 Much funnier than the first but lacks the same clear and concise storyline. Pretty messy and not very consistent with it's pacing but my god it's colourful as hell and, like I said earlier, very funny. Super fun which is what this franchise is, and should be, all about.     ",
      "rango": "7/10 I remember seeing this when I was in like 7th grade which was right around the time I started getting into film and I remember just being blown away by the visuals and creativity in the animation. Not very memorable or clear in terms of a story, a little messy, but a fun one.     ",
      "napoleon-dynamite": "8/10 I made a video essay about this a little bit ago. I think it's one of my favourite comedies ever and continues to make me laugh despite how many times I've watched this thing. Only giving it 4 because, as much as I defended this in the essay, it really does lack a story and a sense of emotional attachment but who really cares it's hilarious.     ",
      "amy-2015": "10/10 One of if not the best documentary I saw of that year. I saw at the Uptown theater with my mom. It was my first time seeing it but her second. Despite the fact that it was her second time she cried, and I couldn't blame her. Heartbreaking but inspirational.     "
   }
}