{
   "user": "MistaT",
   "reviews": {
      "dune-part-two": "10/10 this masterpiece does for cinema what the mona lisa did for art     ",
      "drive-away-dolls": "5/10 justice for curlie     ",
      "madame-web": "2/10 this makes morbius look like the godfather      ",
      "lisa-frankenstein": "6/10 the tim burtonification of jennifer's body     ",
      "argylle": "4/10 whoever gave henry cavill that haircut needs to be jailed     ",
      "the-beekeeper-2024": "6/10 would make a perfect double feature with bee movie      ",
      "mean-girls-2024": "7/10 reneé rapp is an icon, she's a legend, and she is the moment     ",
      "night-swim-2024": "4/10 personally, i would've just put more chlorine in the pool     ",
      "the-color-purple-2023": "9/10 [oprah voice]: you get an oscar! and you get an oscar! everybody gets an oscar!!!     ",
      "ferrari-2023": "8/10 beep beep so let's-a ride     ",
      "the-iron-claw-2023": "8/10    this is basically the virgin suicides for the boys     ",
      "anyone-but-you": "6/10 i need glen powell to be in at least one romcom a year. this is a demand.     ",
      "rebel-moon-part-one-a-child-of-fire": "3/10 i'm convinced that zack snyder had chatgpt write the screenplay     ",
      "maestro-2023": "8/10 lydia tár would've put this in her letterboxd top four     ",
      "wonka": "7/10 he who controls the chocolate controls the universe     ",
      "poor-things-2023": "10/10 this should be the first movie barbie watches in the real world     ",
      "leave-the-world-behind-2023": "8/10 brb, gonna go clear out the dvd section at target     ",
      "eileen-2023": "7/10 not a cell phone in sight, just two queens living in the moment     ",
      "renaissance-a-film-by-beyonce": "8/10 thank you god for giving us beyoncé     ",
      "may-december": "9/10 academy award winner charles melton has a nice ring to it     ",
      "dream-scenario": "8/10 proof that you can't spell fart without art     ",
      "wish-2023": "4/10 i wish that disney would go back to making animated movies that are actually good     ",
      "napoleon-2023": "7/10 the second best movie about a guy named napoleon     ",
      "saltburn": "9/10 does for bathtubs what call me by your name did for peaches     ",
      "thanksgiving-2023": "8/10 eli roth cooked and addison rae ate     ",
      "the-hunger-games-the-ballad-of-songbirds-snakes": "8/10 yassified eminem enters his reputation era     ",
      "the-marvels": "5/10 let iman vellani run marvel studios     ",
      "the-killer-2023": "8/10 that is indeed what listening to the smiths will do to a mf     ",
      "the-holdovers": "10/10 i'll be rewatching this every christmas for the rest of my life     ",
      "priscilla": "8/10 it has to be said: jacob elordi > austin butler     ",
      "five-nights-at-freddys": "3/10 the audience was scarier than the actual movie     ",
      "pain-hustlers": "4/10 chris evans needs to hustle and find himself a better agent     ",
      "killers-of-the-flower-moon": "9/10 lily gladstone we will get you that oscar     ",
      "taylor-swift-the-eras-tour": "8/10 this was a straight up religious experience     ",
      "totally-killer": "7/10 the back to the futurefication of happy death day      ",
      "the-exorcist-believer": "4/10 this is the type of movie they'd play on repeat in hell     ",
      "fair-play-2023": "6/10 joe jonas and sophie turner be like     ",
      "saw-x": "7/10 amanda & john did nothing wrong     ",
      "the-creator-2023": "8/10 chatgpt punching the air rn     ",
      "no-one-will-save-you": "8/10 the home aloneification of signs      ",
      "a-haunting-in-venice": "6/10 oh what i'd give to participate in a séance with tina fey and michelle yeoh     ",
      "dumb-money": "7/10 paul dano rallying social media users to take down the elite gotta be one of my favorite genres     ",
      "the-nun-ii": "3/10 sister whoopi goldberg would've absolutely bodied valak     ",
      "the-equalizer-3": "6/10 must a movie be good? is it not enough to watch denzel equalize people?     ",
      "bottoms": "9/10 rachel sennott & ayo edebiri could do fight club but brad pitt & edward norton couldn't do bottoms      ",
      "blue-beetle": "7/10 the george lopez renaissance has begun     ",
      "the-last-voyage-of-the-demeter": "5/10 they should've just let dracula drive da boat     ",
      "red-white-royal-blue": "8/10 i want to live in the america where uma thurman is president     ",
      "meg-2-the-trench": "3/10 this is what happens when you order jurassic world from wish     ",
      "teenage-mutant-ninja-turtles-mutant-mayhem": "8/10 yeah i'm gonna need at least 10 more of these     ",
      "haunted-mansion-2023": "5/10 jared leto was the most terrifying part of this movie     ",
      "oppenheimer-2023": "10/10 josh peck goes nuclear (not clickbait)     ",
      "barbie": "10/10 in 50 years ryan gosling's ken performance will still be taught in acting classes     ",
      "they-cloned-tyrone": "7/10 get out, if donald glover directed it     ",
      "theater-camp-2023": "8/10 i would pay top dollar to see joan, still on broadway     ",
      "mission-impossible-dead-reckoning-part-one": "10/10 james bond wishes he was as cool as ethan hunt     ",
      "indiana-jones-and-the-dial-of-destiny": "6/10 sometimes all you really need is the comforting on-screen presence of indiana jones punching nazis     ",
      "joy-ride-2023": "7/10 brownie tuesday needs to drop an album asap     ",
      "insidious-the-red-door": "5/10 new fear unlocked: mri machines     ",
      "asteroid-city": "9/10 the wes andersonification of nope      ",
      "no-hard-feelings-2023": "7/10 andrew barth feldman, how does it feel to live my dream?     ",
      "extraction-2": "7/10 chris hemsworth should hang up thor's hammer and make more of these instead     ",
      "the-flash": "6/10 the cgi in this movie makes superman's mustache removal look like a work of art     ",
      "elemental-2023": "6/10 cute, but they're no sharkboy and lavagirl     ",
      "transformers-rise-of-the-beasts": "6/10 there's just something so satisfying about watching giant robots beat the shit out of each other     ",
      "spider-man-across-the-spider-verse": "10/10 this masterpiece deserves 6 stars     ",
      "the-little-mermaid-2023": "6/10 when kaiju ursula showed up i lost it     ",
      "sanctuary-2022": "8/10 the craziest episode of succession i've ever seen     ",
      "fast-x": "6/10 jason mamoa could do joker but joaquin phoenix couldn't do fast x      ",
      "guardians-of-the-galaxy-vol-3": "9/10    a cgi raccoon just made me bawl my eyes out     ",
      "peter-pan-wendy": "6/10 jude law looked like he was having fun and that's all that matters     ",
      "are-you-there-god-its-me-margaret": "8/10 rachel mcadams is god's gift to humanity     ",
      "sisu-2022": "8/10 this dude was definitely john wick's grandpa     ",
      "ghosted-2023": "3/10 this was written by chatgpt and you can't convince me otherwise     ",
      "beau-is-afraid": "8/10 the greatest cinematic depiction of mommy issues since psycho (1960)      ",
      "evil-dead-rise": "7/10 this movie does for elevators what barbarian did for airbnbs     ",
      "renfield": "6/10 nic cage could do twilight but robert pattinson couldn't do renfield      ",
      "the-super-mario-bros-movie": "7/10 jack black as bowser gotta be one of the greatest castings of all time     ",
      "how-to-blow-up-a-pipeline": "8/10 i hope my rating doesn't get me put on a government watchlist     ",
      "air-2023": "8/10 this is basically moneyball for sneakerheads     ",
      "murder-mystery-2": "4/10 do not order knives out from shein     ",
      "rye-lane": "8/10 heartbroken over the fact that love guac'tually isn't real     ",
      "tetris": "6/10 that \"holding out for a hero\" needle drop sent me into orbit     ",
      "dungeons-dragons-honor-among-thieves": "8/10 i want at least 10 more d&d movies. this is a demand.     ",
      "john-wick-chapter-4": "10/10 find someone who loves you as much as john wick loves dogs     ",
      "boston-strangler": "6/10 loretta & jean could've solved the scranton strangler case     ",
      "shazam-fury-of-the-gods": "4/10 just when i thought the dceu couldn't get any worse, they had to go and ruin skittles for me too     ",
      "inside-2023": "7/10 i love it when willem dafoe plays characters who slowly go insane     ",
      "scream-vi": "8/10 i desperately need to see mindy's letterboxd account     ",
      "65": "2/10 adam driver's after earth      ",
      "creed-iii": "7/10 desperately need to see adonis and jake paul face off in creed iv      ",
      "cocaine-bear": "7/10 nancy reagan would've put this in her letterboxd top four     ",
      "ant-man-and-the-wasp-quantumania": "6/10    sorry modok but mr. electric did it better     ",
      "knock-at-the-cabin": "6/10 the rock wishes he had bautista's range     ",
      "you-people-2023": "5/10 \"a netflix original\" yeah we can tell     ",
      "infinity-pool": "8/10 by far the weirdest episode of the white lotus yet     ",
      "missing-2023": "8/10 and that, kids, is why you should ALWAYS enable two-factor authentication     ",
      "a-man-called-otto": "6/10 the disneyfication of gran torino (2008)      ",
      "the-pale-blue-eye": "4/10 edgar allan poe wants what benoit blanc has     ",
      "m3gan": "7/10 i would pay good money to see a cage match between tiffany valentine & m3gan     ",
      "white-noise-2022": "8/10 the ohio-fication of don't look up (2021)      ",
      "roald-dahls-matilda-the-musical": "7/10 ‘revolting children' gotta be the banger of the century     ",
      "women-talking": "8/10 every man should be ben whishaw and if you're a man and you're not ben whishaw you should be asking yourself why am i not ben whishaw     ",
      "babylon-2022": "10/10 in the name of the father (boogie nights), the son (the wolf of wall street), and the holy spirit (babylon)     ",
      "puss-in-boots-the-last-wish": "9/10 a wonderful addition to the scu (shrek cinematic universe)     ",
      "avatar-the-way-of-water": "10/10 packing my bags for pandora as we speak     ",
      "the-whale-2022": "8/10 brendan fraser we will get you that oscar     ",
      "empire-of-light": "4/10 just watch the nicole kidman amc ad instead     ",
      "guillermo-del-toros-pinocchio": "8/10 pinocchio is the anti-fascist icon we all deserve     ",
      "violent-night": "7/10 the die hardification of home alone (1990)      ",
      "the-guardians-of-the-galaxy-holiday-special": "7/10 cosmo the spacedog could've defeated thanos     ",
      "glass-onion": "10/10 rip agatha christie, you would've loved glass onion     ",
      "disenchanted": "4/10 giselle and wanda maximoff would've been besties     ",
      "bones-and-all": "9/10 timothée & taylor literally ate this up and left no crumbs     ",
      "the-menu-2022": "8/10    eat the rich: the movie     ",
      "spirited": "6/10 yet another groundbreaking performance from ryan reynolds as himself     ",
      "the-wonder": "7/10 miss flo literally ate and left no crumbs     ",
      "black-panther-wakanda-forever": "8/10 ugh that was crazy i've never actually experienced that sort of atmosphere before, it was absolutely electric, the passion-     ",
      "weird-the-al-yankovic-story-2022": "8/10 elvis (2022) found dead in a ditch     ",
      "enola-holmes-2": "6/10 needed less fourth-wall breaking and more chad sherlock holmes     ",
      "wendell-wild": "7/10 i fully support and believe in key & peele world domination     ",
      "the-good-nurse": "6/10 eddie redmayne was born to play creepy little psychopaths     ",
      "black-adam": "5/10 pierce brosnan as doctor fate is easily one of the best comic book film castings of all time     ",
      "my-policeman": "5/10 harry styles needs to fire tommy wiseau and get a new acting coach     ",
      "halloween-ends": "5/10 at this point haddonfield needs to be nuked      ",
      "werewolf-by-night": "8/10 this truly was a graveyard smash!      ",
      "triangle-of-sadness": "9/10 we live in a society: the movie     ",
      "hocus-pocus-2": "6/10 there are two types of people in this world: those who support sanderson sister supremacy & trash     ",
      "blonde-2022": "2/10 if you watched this movie for ana de armas, you may be entitled to financial compensation     ",
      "smile-2022": "6/10 jump scare: the movie     ",
      "dont-worry-darling": "4/10 breaking news: florence \"miss flo\" pugh has reportedly been hospitalized due to severe back pain caused by carrying this ENTIRE MOVIE!      ",
      "do-revenge": "8/10    the yassification of strangers on a train (1951)      ",
      "the-woman-king": "8/10 i believe in viola davis supremacy     ",
      "pearl-2022": "8/10 goodbye hot girl summer, hello feral girl fall     ",
      "see-how-they-run-2022": "7/10 the wes andersonification of knives out (2019)      ",
      "barbarian-2022": "8/10 bad times at the barbary airbnb     ",
      "three-thousand-years-of-longing": "8/10 my wish would be to watch idris elba's genie bitch slap will smith's genie     ",
      "orphan-first-kill": "6/10 she's an icon, she's a legend, and she is the moment!     ",
      "prey-2022": "7/10    i love the fact that it took the predators almost 300 years to recover from naru's ass whooping     ",
      "bullet-train": "9/10 agatha christie eat your heart out     ",
      "bodies-bodies-bodies": "7/10 kanye's movie of the year     ",
      "not-okay": "6/10 the tiktokification of dear evan hansen (2021)      ",
      "the-gray-man-2022": "5/10 the biggest takeaway from this movie is that ana de armas needs to get her own stand-alone spy movie ASAP!      ",
      "nope": "10/10 this movie does for cloud spotting what jaws did for swimming     ",
      "thor-love-and-thunder": "5/10 easily the best use of goats in film since the witch (2015)      ",
      "minions-the-rise-of-gru": "6/10 after seeing all the shit that gru has put them through i'm shocked the minions haven't unionized yet     ",
      "hustle-2022": "7/10 i am so grateful to be alive during the adam sandler renaissance     ",
      "jurassic-world-dominion": "4/10 needed way more jeff goldblum     ",
      "fire-island-2022": "8/10 now THIS is how you do a rom com     ",
      "chip-n-dale-rescue-rangers": "8/10 space jam: a new legacy found dead in a ditch     ",
      "men-2022": "5/10    all i can really say is that watching a man give birth FOUR TIMES was not on my 2022 bingo card     ",
      "senior-year-2022": "4/10 yet another terrible addition to the nhscu (netflix high school cinematic universe)     ",
      "doctor-strange-in-the-multiverse-of-madness": "6/10    when wanda strolled into the illuminati hq barefoot i just know that quentin tarantino went absolutely FERAL      ",
      "the-bad-guys-2022": "7/10 the furrification of ocean's eleven (2001)      ",
      "the-unbearable-weight-of-massive-talent": "6/10 i want someone to love me the same way nic cage loves himself     ",
      "the-northman": "10/10 amleth: in my defense, your honor, i was in goblin mode when everything went down     ",
      "fantastic-beasts-the-secrets-of-dumbledore": "3/10 warner bros needs to avada kedavra this entire franchise     ",
      "the-bubble-2022": "4/10 imagine how much better this would have been if lexi howard had directed it     ",
      "morbius": "2/10 jared leto is like king midas except everything he touches turns to shit     ",
      "ambulance-2022": "7/10 the cinematic equivalent of a 5 star GTA police chase     ",
      "the-lost-city-2022": "6/10 sometimes all you really need is the comforting on-screen presence of sandra bullock & channing tatum     ",
      "windfall": "4/10 if jason segel broke into my house he could take anything he wanted     ",
      "the-outfit-2022": "6/10 move over michael corleone, richie boyle is officially the sexiest mobster in cinema     ",
      "deep-water-2022": "3/10 vic van allen proud graduate of the amy dunne school of psychology     ",
      "x-2022": "8/10 the pornification of the texas chainsaw massacre (1974)     ",
      "turning-red": "8/10 pixar really decided to give us a movie about what it would be like if puberty gained consciousness and i'm here for it!     ",
      "everything-everywhere-all-at-once": "10/10 this movie should be required viewing for every man, woman, and child on earth.     ",
      "the-adam-project": "5/10 shawn levy really should have called this \"30 going on 13\" instead     ",
      "the-batman": "10/10 mark my words this movie will be studied in film school for generations     ",
      "no-exit-2022": "6/10 none of this would have happened if darby had allstate roadside assistance     ",
      "texas-chainsaw-massacre": "3/10 this literally happened to my friend laurie 4 years ago     ",
      "kimi": "7/10 the yassification of rear window (1954)     ",
      "cha-cha-real-smooth": "9/10 the world needs more people like andrew     ",
      "dual-2022": "7/10 the same exact shit happened to my friend nebula     ",
      "when-you-finish-saving-the-world": "3/10 i'm convinced that jesse eisenberg was still in character as mark zuckerberg when he made this movie     ",
      "fresh-2022": "8/10    i just know that armie hammer LOVED this     "
   }
}