{
   "user": "Regretti",
   "reviews": {
      "the-40-year-old-virgin": "7/10 Bro is just ace     ",
      "the-departed": "9/10 Dropkick murphys 🫡🫡👍👍     ",
      "star-wars-episode-i-the-phantom-menace": "9/10 I think jar jar strikes a nerve within the deeply disturbed and causes them to ignore every good part of this movie. It's the only explanation of the hate train that I can understand     ",
      "brokeback-mountain": "8/10 do you think joe biden has seen this     ",
      "sound-of-metal": "10/10 this one speaks to me. competent, humanly, and eye-opening     ",
      "a-few-good-men": "8/10 🦅🦅🦅🦅🇺🇸🇺🇸🇺🇸🇺🇸🪖🪖🪖🎖️🎖️🔫🔫🎆🎆     ",
      "lock-stock-and-two-smoking-barrels": "8/10 This movie is so incredibly yellow. It has jaundice     ",
      "boogie-nights": "9/10 chill partying quickly turns into GTA missions     ",
      "jerry-marge-go-large": "7/10 needs aaron paul and giancarlo esposito     ",
      "saltburn": "4/10 No thanks     ",
      "clueless": "6/10 icky     ",
      "ford-v-ferrari": "7/10    if only henry ford was in that car explosion     ",
      "gladiator-2000": "7/10 mf doom     ",
      "everything-everywhere-all-at-once": "10/10 It's not overrated get realWatch it with your mom     ",
      "10-things-i-hate-about-you": "8/10 where was the ska band at MY prom     ",
      "five-nights-at-freddys": "5/10 Tone all over the place, but good set design and ironic value     ",
      "weird-the-al-yankovic-story-2022": "9/10 what The Pick of Destiny wanted to be     ",
      "drive-2011": "8/10 Had a good time laughing at every unnecessarily long pause in dialogue and every unrealistic explosion of bloodhe also drive good nice     ",
      "the-batman": "8/10 possibly the wettest version of gotham     ",
      "kung-fu-panda": "8/10 It's better then you think it'd be     ",
      "oppenheimer-2023": "8/10 My le bomb... it, le killed people?     ",
      "over-the-hedge": "8/10 shit's got ben folds doing the music     ",
      "the-big-short": "8/10 Way way way better than I expected     ",
      "65": "4/10 I'd say just watch Jurassic park     ",
      "the-menu-2022": "7/10 evil ratatouille     ",
      "national-treasure": "7/10 it has a very obvious woman written by a man but it's still pretty fun     ",
      "nacho-libre": "9/10 every frame a painting     ",
      "philadelphia": "8/10 the opera part was pretty artistic yo     ",
      "puss-in-boots-the-last-wish": "9/10 !!!     ",
      "chef": "8/10 that shit look delicious     ",
      "klaus": "8/10 very pleasant chrimmas movie     ",
      "oceans-twelve": "6/10 kinda hard to follow     ",
      "oceans-eleven-2001": "7/10 don cheadle word of the day: terrorism     ",
      "the-grand-budapest-hotel": "10/10 Stylish and quirky, quirky and stylish.     ",
      "hop": "4/10 It is what it is     ",
      "knives-out-2019": "9/10 rian johnson should do more like this he's good at iti think the vomit thing is a dumb concept but the film makes great use of it, so in that sense it's definitely forgivablephrases used in the film include SJW and liberal snowflake     ",
      "casino-royale-2006": "7/10    another one for the \"never trust a thot\" collection     ",
      "kingsman-the-golden-circle": "7/10 this is cool just has some sequel tropes and a weaker plot     ",
      "kingsman-the-secret-service": "9/10 feels like a really nice blend of james bond, the dark knight, john wick, etc  the film has its own rules which sometimes makes it confusing but sometimes are incredibly fun. overall glad i watched it     ",
      "dead-poets-society": "9/10 excellent characters and themes, feels like i watched it at the right time personally     ",
      "the-fourth-kind": "3/10 Fakest \"actual footage\" I've ever seen, and oversaturated with suspense.     ",
      "the-good-the-bad-and-the-ugly": "10/10 A masterpiece of narrative, characters, score, setting, and entertainment. A truly genre defining classic.     ",
      "interstellar": "6/10 it had its epic nolan moments but also feels like it wastes a good bit of its own runtime     ",
      "goodfellas": "9/10 some of the most stress i felt while watching a movie, well done     ",
      "sherlock-holmes-2009": "6/10 Hans zimmers a cheeky bloke innit     ",
      "good-time": "8/10 Beta test of uncut gems     ",
      "tiger-king": "8/10 The insanity of this just keeps ramping up it's hilarious     ",
      "good-will-hunting": "10/10 dayum chief     ",
      "there-will-be-blood": "7/10 There was a fair amount of blood overall. Mostly oil though     ",
      "macbeth-2010": "3/10 I'm technically not done but I've seen enough. Not really worth the watch     ",
      "12-angry-men": "9/10 Top-notch screenplay carries this film to moon bruh. Characters are actual humans that you don't doubt for a second     ",
      "popstar-never-stop-never-stopping": "7/10 Laughed a couple of times     ",
      "slow-west": "7/10 Unique coloring and composition for a western, almost making it Wes Anderson-esque. The movie feels like a bright painting of the west. The painting-like nature of everything sets it up well for a subversive end. Maybe a little thin on supporting the character arcs.  A case study on how chasing hoes will bring your downfall     ",
      "django-unchained": "10/10 certified jam movie  stays a 4.5 until the last 20ish minutes where it's a 5     ",
      "once-upon-a-time-in-hollywood": "10/10 what a gotdamn wild ride, i actually didn't mind the first two acts because there was enough minor conflict to please my monkey brain and it all just felt slice-of-life-ish.  too much lady feet tho, i'm not afraid to kinkshamealso i wouldn't have minded if it was even more on the nose with the charles manson parallels     ",
      "inglourious-basterds": "9/10 Honestly wouldn't have minded if Brad Pitt's character was in every second of this movie     ",
      "zodiac": "8/10 I enjoyed it overall. The long stretches of Mark Ruffalo in the second act killed some of my interest though.     ",
      "home-alone": "4/10 It's okay but I think it needs trump in it. Hopefully the sequels can improve it in that way     ",
      "pirates-of-the-caribbean-the-curse-of-the-black-pearl": "9/10 Objectively this movie is probably just decent, but man, I just really like it. The two hours just fly by. Minor flaws be damned, the movie's still fun, especially when it isn't taking itself too seriously and is instead hyping itself up with that iconic Hans Zimmer score. Learning the characters bit by bit is what makes this so rewatchable for me. Gone are the days that a PotC movie is directed by Verbinski, has its original writers, and stars...     ",
      "once-upon-a-time-in-the-west": "7/10 It's a nice western but you really start to notice how confusing or unexplained things tend to be. What could've done the movie better was some more explanatory dialogue or flow between locations. Morricone is on point as always, and there is definitely some wit in the characters, but I can't say the movie amounts to any of the films in the Dollars Trilogy, especially the 2nd and 3rd ones.     ",
      "lorenzos-oil": "6/10 Hahahahahahahaha How The Fuck Is Crying At Movies Real Hahahaha Dude It's Like A Few Hours Of Development Like Dude They're Limited Ass Characters Haha     ",
      "animal-farm-1999": "4/10 Watched this in school. Bad in a funny kind of way. My favorite part was when they couldn't commit to having 100% puppets so the rats are completely computer generated (and sometimes the pigs).     ",
      "mad-max-fury-road": "10/10 There was clearly some genius at play in making the cars go vroom vroom. Characters are written and performed well too. No complaints all around (just maybe a nitpick or two).     ",
      "for-a-few-dollars-more": "9/10 Greatly improves upon the negatives of Fistful of Dollars, which was already a good movie. For A Few Dollars more is very confident in the directions it takes.  By the way Ennio Morricone is a god     ",
      "a-fistful-of-dollars": "8/10 I liked it. A fun story whose only real issues are some practical effects and the corny acting following a person getting shot. Both of which Leone corrects in later parts of the Dollars Trilogy.     ",
      "burning-cane": "6/10 Great cinematography, but just so slow paced that I dozed off for 15 minutes. Sorry Phillip.  (Saw this through a mandatory screening at NOCCA)     ",
      "pirates-of-the-caribbean-dead-mans-chest": "8/10 I don't remember how good the movie was but the soundtrack good     ",
      "joker-2019": "9/10 i liked the stairs and the clown makeup. would watch again     ",
      "john-wick-chapter-3-parabellum": "9/10 Though the spontaneous story and repetitive lighting may get under one's skin, the second-to-none action sequences effectively overshadow these shortcomings, showcasing that John Wick 3 nails absurdly entertaining fights and choreography.     "
   }
}