{
   "user": "sapphicquinn",
   "reviews": {
      "priscilla": "10/10 tw: abuse  \"this is what i did not know until now [...] it is poison. all day and night, until i ran, i was drinking poison.\" - in the dream house, carmen maria machado   There is a sense of bittersweet tragedy to the final shot of priscilla. The triumphant image of her driving away, literally and metaphorically freeing herself from elvis, is contrasted by the use of ‘i will always love you' as a needle drop; even after everything she...     ",
      "spider-man-across-the-spider-verse": " Spider-Verse 2 Best Picture 2022 has a nice ring to it     ",
      "guardians-of-the-galaxy-vol-3": "10/10 \"he makes us laugh and he loves us, that's his purpose.\"  This was so much sadder than i was expecting it to be lol  Who would have thought that if you get talented people to make these and actually let them make the film they want to make without micromanaging them and forcing it to connect to 10 disney+ shows that only 7 people will actually watch then they end up being very good  if i could give this an extra five stars for the florence & the machine needle drop then i would     ",
      "evil-dead-rise": "10/10 Saw this in dolby... i have heard things that i will never be able to unhear     ",
      "the-social-network": "10/10 Honestly ashamed it took me this long to watch this film. I really am dumb huh 😔     ",
      "the-evil-dead": "5/10 Just throw the whole cabin away     ",
      "babylon-2022": "8/10 La la land's evil horny twin     ",
      "john-wick-chapter-4": "10/10 They should play the last hour of this on a loop at the louvre     ",
      "scream-vi": "8/10 Not going to lie the letterboxd insult hurt a little     ",
      "scream-2022": "6/10    Turns out fanfiction was the real killer all along     ",
      "cocaine-bear": "2/10 The only funny part of this to me was an editing transition during the last 30 minutes which was so bad that i'm starting to think i fell asleep and imagined it     ",
      "magic-mike-xxl": "10/10 This generation's the godfather part 2     ",
      "magic-mikes-last-dance": "6/10 A little disappointing but unfortunately very few films can be as good as magic mike xxl     ",
      "bones-and-all": "10/10 Great first date movie actually     ",
      "skinamarink": "8/10 A film about a demon who just wants to play with some lego     ",
      "knock-at-the-cabin": "10/10 Very fitting that the only openly homophobic character is the one played by someone who was a part of the harry potter franchise     ",
      "suspiria-2018": "10/10 Suspiria (1977) walked so Suspiria (2018) could RUN. I don't know if this is an unpopular opinion but I think I like this more than the original. Mainly because it improves upon a lot of the issues the original had. Mainly with the story which feels a lot more engaging in this with an underlying mystery keeping the story interesting. I also think that the much longer runtime helps develop the characters, story and even build up the atmosphere a...     ",
      "titane": "8/10 Cars 4 was a lot darker than i was expecting     ",
      "puss-in-boots-the-last-wish": "8/10 Wasn't expecting 2022 to have a pinocchio and puss in boots film which both dealt with mortality, the inevitability of death and the fleeting nature of our lives and those we care about but i'm glad we got them i guess     ",
      "jackass-number-two": "7/10 the musical sequence in jackass 2 >>>> la la land     ",
      "guillermo-del-toros-pinocchio": "10/10 It's so unfair that i can't carry around a mini ewan mcgregor with me in my pocket     ",
      "decision-to-leave": "10/10 I would have done all of that for her too tbh     ",
      "twin-peaks-fire-walk-with-me": "10/10 \"And the angel's wouldn't help you. Because they've all gone away.\"Subconsciously decided to myself that i'd finally get around to watching twin peaks last week while looking at the criterion for this. A week later, after watching all 2 seasons and fwwm, i can confidently say that yeah... pretty good tbh. Can't speak for the return as i haven't seen it yet but i think (so far) this is the series' highlight. Less of a prequel and almost more of an...     ",
      "bodies-bodies-bodies": "8/10 I'd love to know what agatha christie would have thought about this     ",
      "spirited": "3/10 Honestly maybe the grinch had a point     ",
      "the-banshees-of-inisherin": "10/10 That one unemployed friend at 2pm on a tuesday:     ",
      "hellbender": "10/10 This is my lady bird     ",
      "avatar-the-way-of-water": "8/10 [George costanza voice]: the sea was angry that day my friends     ",
      "the-girl-with-the-dragon-tattoo-2011": "10/10 Rooney Mara as a hacker goth wearing a \"fuck you you fucking fuck\" shirt might be the best thing ever put to film     ",
      "the-fabelmans": "10/10 I made you look like you could fly.  We need to find a way to ensure that spielberg never stops making films     ",
      "aftersun": "10/10 this is our last dance.  Absolutely devastating. Paul mescal is a gift to this world.     ",
      "midnight-mass-2021": "10/10 This is so preacher's daughter by ethel cain coded     ",
      "eyes-wide-shut": "10/10 A film so good it might have been the catalyst for a divorce     ",
      "violent-night": "2/10 Feels like an almost 2 hour long family guy cutaway gag     ",
      "glass-onion": "8/10 I really hope rian johnson and daniel craig get to make like 30 more of these     ",
      "tar-2022": "8/10 Do you think she would have had stans     ",
      "knives-out-2019": "10/10 EVERYONE👏SAY👏THANK👏YOU👏RIAN👏JOHNSON👏     ",
      "the-menu-2022": "8/10    [sorrowfully] babe would you still like me if i was a s'more :(     ",
      "black-panther-wakanda-forever": "4/10 Why did martin freeman have almost the same amount of screen time as michaela coel     ",
      "poppy-never-find-my-place-live-from-house-of-blues": " [poppy while holding a garfield plush before performing hysteria]: do it for him :)     ",
      "smile-2022": "6/10 Can we have it follows?  We have it follows at home.  The it follows at home:     ",
      "pearl-2022": "8/10 It's so cool that the ethel cain biopic was made this soon     ",
      "evil-dead": "8/10 The people who made this woke up, threw their hands in the air, said \"fuck it\" and then proceeded to go absolutely insane     ",
      "nope": "10/10 we don't deserve the impossible  Jordan peele's brain should be in the louvre     ",
      "barbarian-2022": "6/10 When the mommy kink goes too far     ",
      "black-adam": "2/10 The reason he's called the rock is because he has the acting range of one     ",
      "cure": "8/10 Ironically this film had me hypnotised     ",
      "folklore-the-long-pond-studio-sessions": "10/10 \"Everyone needed a good cry as well as us\"Thanks Taylor I'm still fucking sobbing 4 months later     ",
      "the-cabinet-of-dr-caligari-1920": "7/10 omg i can't believe timothée chalamet did all of that     ",
      "bros": "4/10 Why weren't there any charli xcx needle drops?     ",
      "halloween-ends": "7/10 Corey in the house     ",
      "hellraiser-iii-hell-on-earth": "6/10 We've got to bring back horror films having heavy metal songs play during the credits     ",
      "hellbound-hellraiser-ii": "8/10 Ngl if pinhead told me \"we have eternity to know your flesh\" i wouldn't know whether to be scared or horny     ",
      "hellraiser": "8/10 The forbidden rubick's cube     ",
      "werewolf-by-night": "3/10 Kind of impressive how the cgi in marvel stuff recently has managed to keep getting progressively worse     ",
      "dont-worry-darling": "3/10 Harry styles went to the tommy wiseau school of acting     ",
      "hellraiser-2022": "6/10 oh no she's hot     ",
      "dead-end-2003": "6/10 Leonardo dicaprio pointing at screen image but it's me every time ray wise shouted laura in this     ",
      "blonde-2022": "2/10 tonight's episode: the writer's barely-disguised fetish     ",
      "moonage-daydream": "10/10 \"it's what you do in life that's important, not how much time you have.\"  Incredibly overwhelming in its presentation and yet still manages to be frequently beautiful and life affirming. Seeing this in imax felt like a religious experience.     ",
      "avatar": "10/10 Whatever the vfx team who worked on this were paid it wasn't enough     ",
      "do-revenge": "2/10 The ai system that netflix is using to generate an endless stream of this type of film needs to be found and destroyed as quickly as possible     ",
      "the-woman-king": "8/10 2022 is the year that hollywood realised the coolest thing that you can show a person doing in an action film is them using a knife attached to rope as a weapon     ",
      "jaws": "8/10 I would have tried to befriend the shark but that's just me     ",
      "x-2022": "2/10 executive producer: sam levinson  And with that everything was explained     ",
      "see-how-they-run-2022": "8/10 The whodunnit renaissance is thriving     ",
      "spencer-2021": "9/10 I have a lot of thoughts about this and at least half of them are about how far i am willing to go in order to get kristen stewart her oscar     ",
      "thor-love-and-thunder": "1/10 Films were a mistake     ",
      "minions-the-rise-of-gru": "4/10 Where were the phoebe bridgers and caroline polachek minions     ",
      "three-thousand-years-of-longing": "10/10 I want our solitudes to be together      ",
      "the-black-phone": "5/10 ... the opening credits were cool i guess     ",
      "resurrection-2022": "7/10 Can the academy awards please give rebecca hall an oscar because i'm scared what she might do if she is snubbed again     ",
      "watcher": "8/10 Never opening my curtains ever again ❤️     ",
      "orphan-first-kill": "6/10 Titane (2021) but camp     ",
      "orphan": "7/10 Esther would have loved lana del rey     ",
      "creep-2": "8/10    Good for her     ",
      "the-happening": "6/10 WE ATE TIRAMISU TOGETHER AND THAT WAS IT     ",
      "glass-2019": "10/10 I wasn't a mistake, mama. No, you were spectacular.   I need to lie down and cry for a little bit     ",
      "bullet-train": "2/10 I don't know how but we need to find a way to ensure that the deadpool films were never made in order to prevent the irreversible damage they have caused     ",
      "lightyear-2022": "4/10 We have to stop letting ai make films     ",
      "not-okay": "4/10 Not good     ",
      "mommy-2014": "8/10 No way home level crowd reaction but it's during the aspect ratio changes in mommy     ",
      "jackass-forever": "8/10 Johnny knoxville's the end of evangelion     ",
      "jackass-35": "8/10 50% of these films is saw level torture and the other 50% is homoeroticism     ",
      "jackass-3d": "7/10 Dying to know what scorsese's thoughts on these films are     ",
      "get-out-2017": "10/10 Fuck tea 😡 all my homies hate tea 🚫     ",
      "the-gray-man-2022": "3/10 The two paintball episodes of community which joe russo directed are more stylised and better directed than the $200 million dollar action film he directed with his brother 11 years later     ",
      "inland-empire": "8/10 David lynch had $10, a digital camera, and a dream     ",
      "elvis-2022": "7/10 Felt like i was watching an almost three hour long twitter fancam     ",
      "ready-or-not-2019": "9/10 I hate children and rich people so yes this was very much a serve.     ",
      "charli-xcx-alone-together": "8/10 God is a woman and her name is charli xcx     ",
      "the-last-disagreement": "10/10 let it all burn down, burn it to the ground, we'll be safe and sound, when it all burns down.   Against all authority except mommy     ",
      "romeo-juliet-1996": "6/10 There is nothing inside baz luhrmann's head except a monkey clapping cymbals     ",
      "evangelion-20-you-can-not-advance": "8/10 it's the end of the world   Holy shit lol     ",
      "doctor-strange-in-the-multiverse-of-madness": "3/10 Across the spider-verse we need you now more than ever     ",
      "evangelion-10-you-are-not-alone": "7/10 I'm sooooooooooo drunk @misato  misaaattttoooooooooooo😭😭😭😭😭     ",
      "crimes-of-the-future-2022": "7/10 i'm real when i shop my face      ",
      "birds-of-prey-and-the-fantabulous-emancipation-of-one-harley-quinn": "10/10 Must a movie be good? Is it not enough to see a group of bisexuals and lesbians led by Margot Robbie team up to fight Ewan McGregor and his boyfriend?     ",
      "cha-cha-real-smooth": "4/10 Do not order worst person in the world from shein     ",
      "the-novice": "6/10 I'm mid but i'm proud     ",
      "the-worst-person-in-the-world": "10/10 I'm in this photo and i don't like it     ",
      "the-batman": " It should be illegal for studios to release trailers for films that look this good and then go \"ok wait a year ❤️\"  Edit: ok now two years 😭😭     ",
      "spiderhead": "4/10 Finished watching this 3 hours ago and i've already forgotten everything about it     ",
      "neon-genesis-evangelion-the-end-of-evangelion": "10/10 \"Why are you here?\"\"Is it ok for me to be here?\"Felt this on a molecular level. I don't think i've ever seen a piece of media which represented the loneliness and isolation i've felt for almost all of my life as perfectly as Evangelion. The constant longing for any sort of connection in order to make all the suffering and sadness feel worthwhile, while at the same time refusing to reflect on myself and try to understand why...     ",
      "watchmen": "8/10 I could fix him (doctor manhattan)     ",
      "jurassic-world-dominion": "1/10 Nobody does it like colin trevorrow     ",
      "jackass-the-movie": "6/10 The nicole kidman cinema ad but she's watching jackass: the movie instead     ",
      "watchmen-2019": "10/10 \"Jon, come back, where are you?\"\"I'm in every moment we were together, all at once.\"  Probably the best comic book related piece of tv/film ever made     ",
      "top-gun-maverick": "9/10 Exquisite piece of dad movie filmmaking     ",
      "mission-impossible-fallout": "8/10 dudes rock     ",
      "videodrome": "7/10 David cronenberg sure is one wacky guy     ",
      "silent-hill-revelation-3d": "6/10 Some garbage is ok     ",
      "silent-hill": "7/10 Next year's met gala theme should be silent hill     ",
      "mission-impossible-rogue-nation": "8/10 [chanting] SIR, HUNT IS THE LIVING MANIFESTATION OF DESTINY. AND HE HAS MADE YOU HIS MISSION.     ",
      "men-2022": "2/10 \"what the fuck do you mean women are paid less than men??????\"Alex Garland, 2021 (probably)     ",
      "top-gun": "4/10 I feel the need for s[leep]peed     ",
      "everything-everywhere-all-at-once": "10/10 In every universe, there's always something to love. No matter how insignificant, everything matters.      ",
      "jackass-45": "10/10    Got to see steve-o eat sushi out of another man's ass in 4k hd with my parents  movies have the power to change the world ❤️     ",
      "drag-me-to-hell": "6/10 More films should thoroughly hate their main character as much as this does     ",
      "mulholland-drive": "8/10 nobody:  david lynch: and then we throw in some creepy old people     ",
      "a-silent-voice": "10/10 I love violently emptying my tear ducts     ",
      "ambulance-2022": "8/10 The pandemic has definitely melted my brain because there is no way that i almost cried during a michael bay film     ",
      "twin-peaks-the-return": "10/10 Didn't understand a single second of this. 5 stars.     ",
      "were-all-going-to-the-worlds-fair": "10/10 \"i am turning into plastic. why does it feel so good?\"  I have no words lol     ",
      "the-northman": "9/10 (the north)man this rules     ",
      "twin-peaks": "10/10 brb going to sit in a dark room and drink 12 gallons of coffee     ",
      "the-unbearable-weight-of-massive-talent": "6/10 Should have just been a feature length version of the scene where nicolas cage and pedro pascal watch paddington 2 together     ",
      "house": "10/10 Going to need about 3-5 business days to process what I just watched     ",
      "belle-2021": "10/10 There is a place for you here.     ",
      "sonic-the-hedgehog-2": "7/10 2 hour long proof that nothing can prevent from idris elba from being one of the sexiest men alive     ",
      "blade-runner-2049": "8/10 I want to fuck neon     ",
      "asako-i-ii": "10/10 \"Everything up until now feels more like a long dream. It was a really happy dream. I felt like I'd matured. But now i'm awake, and I... haven't changed at all.\"Nothing better than watching a film and instantly knowing that it's going to become one of your favourites     ",
      "operation-mincemeat-2022": "6/10 Mediocre dramas based on true stories that nobody under the age of 50 will see are the backbone of the uk film industry     ",
      "the-bubble-2022": "2/10 When future generations look back on the covid era this is what they'll see     ",
      "moon-knight-2022": "3/10 Oscar isaac blink three times if you are being held captive by disney     ",
      "death-on-the-nile-2022": "4/10 Kenneth branagh: [jolts awake in a cold sweat at 3am] but how did poirot get his moustache?     ",
      "morbius": "1/10 The #1 hit film of 2003     ",
      "drive-my-car": "10/10 Here's how drive my car can still win best picture     ",
      "the-matrix-resurrections": "10/10 We are never going to get a franchise as cool, innovative, and creative as the matrix ever again     ",
      "the-lost-city-2022": "6/10 A better uncharted film than the actual uncharted film     ",
      "coda-2021": "4/10 Congratulations to the disney channel for finally having one of their films win best picture     ",
      "reservoir-dogs": "7/10 Mr white and mr orange were about 70% gayer in this than they needed to be and i'm very thankful for it     ",
      "the-bad-guys-2022": "8/10    I'm just really happy that richard ayoade voicing an evil guinea pig is something that exists     ",
      "the-dark-knight": "8/10 ⚠️Controversial opinion‼️ This film's pretty good actually 😳😳     ",
      "whiplash-2014": "10/10 If scientists can turn stress into electricity, then watching this is going to make people unstoppable     ",
      "windfall": "4/10 We simply do not deserve jesse plemons     ",
      "the-house-of-the-devil": "6/10 The scariest part of this was the lena dunham cameo     ",
      "deep-water-2022": "4/10 When will sam levinson's reign of terror end     ",
      "the-innkeepers": "6/10 I FUCKING LOVE SLOW BURN HORROR FILMS  THE JOY I GAIN FROM WAITING AN HOUR FOR SOMETHING CREEPY OR UNSETTLING TO HAPPEN IS FUCKING UNIMAGINABLE     ",
      "pulp-fiction": "8/10 Getting a lot of birds of prey vibes from this     ",
      "curtains": "4/10 Never watch a film because of an instagram edit you saw of it... that shit will kill you     ",
      "spider-man-no-way-home": "4/10 If you showed this film to a victorian child it would probably kill them     ",
      "turning-red": "8/10 disney: cool film you've got there  pixar: thanks we're really proud of it and think it will look great in cinemas   disney:   pixar: you're going to release it in cinemas... right?  disney: [quickly creating disney+ profile pictures for it]     ",
      "battle-royale": "8/10 If I had to murder someone I had a crush on it would probably go like \"so um 👉👈 would it be ok if i stabbed you 😳 or we could just hang out if you'd rather do that instead 🥺💞\"     ",
      "fresh-2022": "8/10    Takes eating ass to a whole new level     ",
      "spirited-away": "8/10 I'm assuming this is the type of vacation that david lynch would organise for his family     ",
      "the-lego-batman-movie": "8/10 Matt Reeves and Robert Pattinson have some COMPETITION.      ",
      "cyrano-2021": "8/10 Shoutout to joe wright period pieces about yearning... gotta be one of my favourite genders     ",
      "west-side-story-2021": "10/10 As far as apologies for ready player one go this was pretty good     ",
      "licorice-pizza": "8/10 When is it going to be my turn to fall in love with one of the haim sisters     ",
      "puella-magi-madoka-magica": "10/10 cute! [gutteral screaming]     ",
      "puella-magi-madoka-magica-the-movie-part-iii-rebellion": "10/10 The yassification of end of evangelion     ",
      "texas-chainsaw-massacre": "2/10 There needs to be scientific research into how netflix manages to consistently choose the worst films for their exclusive content     ",
      "the-power-of-the-dog": "7/10 Jonny greenwood is going to be competing against himself at the oscars for best original score this year     ",
      "psycho": "6/10 me (an empath) sensing that there is something wrong with norman bates     ",
      "hamlet-1996": "4/10 Kenneth branagh must be stopped     ",
      "your-name": "10/10 Still a beautifully animated and emotionally charged film brimming with heart and humour. Also the soundtrack is *top tier.*     ",
      "uncharted-2022": "2/10 Congratulations to sony for hitting a new low     ",
      "kimi": "5/10 of course you have blue hair and pronouns     ",
      "annihilation": "8/10 paramount: so alex what is this film abou-alex garland: i have riddle     ",
      "the-girl-who-leapt-through-time": "10/10 the owner of this account is currently trying to stop crying and screaming over:I'll be waiting in the future. I'll be right there. I'll run there.  they'll be back in a little while     ",
      "pans-labyrinth": "7/10 ofelia: the world is a cruel and unjust place. there is no harmony in the universe. the only constant is suffering.  *minutes later*  ofelia: OMG FAUN     ",
      "neon-genesis-evangelion": "10/10 What 0 pussy does to a mf     ",
      "ex-machina-2015": "9/10 holy shit is that a charli xcx reference     ",
      "the-house-2022-1": "6/10    Idk just move out or something     ",
      "euphoria-fck-anyone-whos-not-a-sea-blob": "10/10 Me: I'm going to try and not cry my eyes out during this episode   *Liability by Lorde plays during the opening scene*  Me [already crying]: oh no     ",
      "the-kings-man": "4/10 Every film should have a little stanley tucci cameo, as a treat     ",
      "nightmare-alley-2021": "6/10 Willem dafoe looked like he was having fun and at the end of the day that's all that matters     ",
      "donnie-darko": "10/10 The first time I watched this was about 5 years ago and since then I've watched it at least 3 more times and yet I still do not understand a single second of it     ",
      "the-tragedy-of-macbeth": "6/10 You know an a24 film is going to bang when the dad from the witch shows up     ",
      "eternals": "9/10 I love steven universe     ",
      "eternal-sunshine-of-the-spotless-mind": "8/10 Just fell to my knees in the middle of a road     ",
      "oldboy": "10/10 Lee woo-jin is without question the biggest hater in cinematic history     ",
      "perfect-blue": "10/10 Deeply unsettling. Satoshi Kon's directing and slow buildup adds a lot to the film and the almost nightmare esque feel to the film keeps the viewer in a constant state of dread. Some of the imagery is visually striking and the soundtrack adds a haunting ambience to everything.   Perfect Blue is a masterclass of psychological horror and lingers long after the film ends.     ",
      "raw-2016": "10/10 The superior coming of age film     ",
      "scream-4": "4/10 Why is this directed like a disney channel original movie     ",
      "ghost-in-the-shell": "7/10 Really glad they never made a live action american adaptation of this that would be such a bad idea     ",
      "amy-2015": "8/10 brb going to lock myself in a room and stay there until i stop crying     ",
      "under-the-skin-2013": "7/10 nobody:me: so it's like meat by poppy     ",
      "scream-2": "6/10    Dewey in every scream film: i lived bitch     ",
      "the-matrix": "8/10 Not to sound like i've travelled back in time 22 years but this is literally the coolest film ever made...sorry but i don't make the rules     ",
      "spider-man-into-the-spider-verse": "10/10 Easily the best Spider - man film and probably my favourite comic book film.     ",
      "the-lost-daughter-2021": "6/10 Wake up babe new mommy issues film just dropped     ",
      "death-to-2021": "1/10 Netflix please fucking stop     ",
      "antlers": "4/10 Jesse plemons is fighting for his life to stay awake in this     ",
      "west-side-story": "6/10 On the one hand i do prefer the new west side story a lot more however this version doesn't have ansel elgort so maybe this is the better one     ",
      "belladonna-of-sadness": "8/10 Idk what the fuck even     ",
      "gremlins": "8/10 Gizmo: *breathes*Me: do you know that I would literally die for you. Please understand this.     ",
      "encanto": "6/10 The disneyfication of tom wambsgans     ",
      "dont-look-up-2021": "4/10 Who did adam mckay have to blackmail in order to make his $75 million dollar 2 hour long snl sketch     ",
      "the-matrix-revolutions": "7/10 Either you think the matrix sequels are good or you're wrong     ",
      "the-grand-budapest-hotel": "10/10 Willem dafoe is just a little too good at playing villains for me to feel safe in a room alone with him     ",
      "batman-returns": "8/10 #makecomicbookfilmshornyagain     ",
      "another-round": "7/10    the first 110 minutes: there is no harmony in the universe. the only constant is suffering.   the last 5 minutes: mads mikkelsen dancing :)     ",
      "the-shining": "8/10 Marriage Story is a lot more intense than I remembered     ",
      "the-nightmare-before-christmas": "8/10 When taylor swift wrote \"he's so tall and handsome as hell, he's so bad but he does it so well\" she was actually referring to jack skellington     ",
      "gone-girl": "10/10 Straight people really just be like that sometimes     ",
      "kikis-delivery-service": "9/10 Do you think that kiki (a witch) ever attended the markos dance company when she grew up?     ",
      "hawkeye-2021": "5/10 It took them 9 years but they finally got me to care about the bow and arrow man     ",
      "the-snowman-2017": "2/10 Imagine that someone you love has been brutally murdered and the detective who comes to ask you some questions introduces himself as harry hole     ",
      "paddington": "8/10 Where is his academy award @theOscars 🤨🙄     ",
      "spider-man-3": "6/10 me after i listened to i disagree for the first time     ",
      "millennium-actress": "10/10 I THINK I'VE SEEN THIS FILM BEFORE AND I DIDN'T LIKE THE ENDING     ",
      "the-lego-movie": "10/10 r.i.p. karl marx you would have loved the lego movie     ",
      "benedetta": "2/10 I just know that if this was distributed by a24 they would already be selling $40 hand carved wooden virgin mary dildos     ",
      "ghostbusters-afterlife": "3/10 \"50 references you missed\" youtubers are preparing 11 videos for this film as we speak     ",
      "star-wars-the-last-jedi": "9/10 Wow what a great film i can't wait to see how this trilogy ends     ",
      "fantastic-mr-fox": "8/10 wes anderson: hey willem, i'm making a new film and there's a role i think you would be perfect for  willem dafoe: sounds great, who am i playing?  wes anderson: a tall alcoholic rat who attempts to kidnap the main character's son   willem dafoe:  wes anderson:  willem dafoe:  wes anderson: he has a southern accent btw     ",
      "okja": "10/10 Okja having her own cast and crew page despite the fact that she is a fictional character is still one of the cutest and most wholesome things I've ever seen     ",
      "house-of-gucci": "4/10 Why is jared leto's audition tape for the mario movie 2 and a half hours long     ",
      "the-electrical-life-of-louis-wain": "10/10 \"Just remember, however hard things get, however much you feel like you're struggling, the world is full of beauty. And it's up to you to capture it, Louis.\"  Really surprised by how much I loved this considering it wasn't at all on my radar until seeing the same trailer for it every time I've been to see Spencer. All of the performances are great, in particular Benedict Cumberbatch who is so good in this that I'll refrain from calling him...     ",
      "king-richard": "8/10 I'm not saying having a beyoncé song in a film makes it better but there is a reason why i gave this film an extra half a star     ",
      "tick-tick-boom-2021": "5/10 ... great andrew garfield, beautiful andrew garfield     ",
      "last-night-in-soho": "3/10 I'm just like eloise because i too am lonely and spend most of my time thinking about anya taylor joy     ",
      "ghostbusters": "4/10 Call ryan bergara and shane madej instead     ",
      "the-dark-knight-rises": "6/10 Christopher nolan films are sound mixed by the same person who created the the iphone alarm     ",
      "shang-chi-and-the-legend-of-the-ten-rings": "8/10 I don't know which was sexier: the action sequences or tony leung     ",
      "venom-let-there-be-carnage": "6/10 Fellas is it gay to want to kiss the alien that is inside your body     ",
      "all-too-well-the-short-film": " hey i'm martin scorsese  and...?  and i'm-  TAYLOR SWIFT???     ",
      "red-notice": "2/10    I didn't think this could get any worse and then ed sheeran showed up and i lost the will to live     ",
      "jackie-2016": "7/10 Feel like shit #natalieportman     ",
      "american-psycho": "8/10 tw // jared leto     ",
      "red-riding-hood-2011": "2/10 great unsolved mysteries:•who was jack the ripper? •what happened to db cooper?•why was leonardo dicaprio a producer on red riding hood?     ",
      "carrie-1976": "8/10 this is my joker     ",
      "normal-people-2020": "10/10 Alexa, play Nobody by Mitski     ",
      "scott-pilgrim-vs-the-world": "9/10 Things I like about this film:  10. The film 9. Brie Larson as Envy Adams8. Brie Larson as Envy Adams7.  Brie Larson as Envy Adams6. Brie Larson as Envy Adams5. Brie Larson as Envy Adams4. Brie Larson as Envy Adams3. Brie Larson as Envy Adams2. Brie Larson as Envy Adams1.  Brie Larson as Envy Adams     ",
      "the-harder-they-fall-2021": "8/10 me pretending to be a horse so idris elba and jonathan majors can ride me: neigh 🐴     ",
      "coherence": "6/10 The title of this is kind of a lie considering that i didn't understand a single second of it     ",
      "girl-interrupted": "8/10 I've almost been admitted to a psych ward by my parents a few times but they've never gone through with it however if clea duvall was my roommate and angelina jolie was there... catch me singing downtown with my ward besties     ",
      "lake-mungo": "9/10 I hope this doesn't sound hyperbolic and I know this phrase tends to get overused a lot but this is honestly one of the scariest films I think I've ever seen. I am *shook.*     ",
      "what-we-do-in-the-shadows": "9/10 Wow, the Australian version of The Office is wild.     ",
      "it-follows": "8/10 i really liked the part where it followed them     ",
      "lamb-2021": "5/10 Give the lamb an oscar     ",
      "always-amber": "10/10 It's such a shame that this has barely gotten any attention. I can easily see this becoming one of my favourite documentaries. I loved the almost homemade feeling it has and how hopeful and empathetic it feels. Please give this more attention, I can't recommended it enough.     ",
      "uzumaki-2000": "5/10 why the fuck     ",
      "the-rocky-horror-picture-show": "10/10 I loved this film so much that in High School I made a presentation on Tim Curry for a Music lesson so yes you could say I'm obsessed.     ",
      "guardians-of-the-galaxy-vol-2": "9/10 If I almost cried at the end of this I didn't bc i did. No I didn't ❤️     ",
      "marrowbone": "8/10 I wanted a good spooky movie with hot people in it but now i want to kill myself     ",
      "hell-house-llc": "7/10 If only they used hotel trivago     ",
      "grave-encounters": "6/10 ryan bergara and shane madej would have done it better     ",
      "zola": "9/10 I can't wait for the a24 TanaCon movie     ",
      "parasite-2019": "10/10 ACADEMY.AWARD.PERIODT.     ",
      "the-french-dispatch": "7/10 \"directed by wes anderson\"Yeah no shit     ",
      "crimson-peak": "8/10 \"What if ghosts had titties?\"-Guillermo del toro (probably)     ",
      "night-teeth": "5/10 Where was amanda seyfried     ",
      "the-thing": "7/10 me: i'm not the thingfriend: why should i believe you?me: dude trust me     ",
      "dune-2021": " ⚠️SERVE INCOMING⚠️     ",
      "cherry-falls": "7/10 If this happened in real life then mitski fans would be doomed     ",
      "v-h-s": "6/10 So love starved that if someone stalked me while only saying \"i like you\" then i'd probably date them     ",
      "halloween-kills": "2/10 This in fact did not kill     ",
      "v-h-s-2": "8/10 *sees dog*oh no     ",
      "v-h-s-94": "8/10 \"rat man\"That's actually just james corden in his final form     ",
      "halloween-1978": "6/10 laurie: men that don't speak>>>>>>  michael myers: that's me 🙋‍♀️ i don't have shit to say to anyone     ",
      "climax-2018": "10/10 Gaspar Noé please seek therapy     ",
      "evil-dead-ii": "5/10 cocaine was a very popular drug during the 80's     ",
      "the-night-house": "5/10 The drhcu (depressed rebecca hall cinematic universe)     ",
      "muppets-haunted-mansion": "6/10 #savekermit     ",
      "an-american-werewolf-in-london": "6/10 David: I became a werewolf and killed people Alex: I love you but please stop becoming a werewolf or give me a call. I cannot support hate. Please stop this. I know this isn't your heart.      ",
      "scream": "8/10 Killer: what's your favourite scary movie  Me: idk check my letterboxd     ",
      "inside-2007": "7/10 If you think about it this is just breaking dawn part 1     ",
      "free-guy": "2/10 Bitch you're not the lego movie     ",
      "candyman-2021": "8/10 If saying candyman in the mirror 5 times summoned yahya abdul mateen II then i don't care if i die... i am willing to take those risks     ",
      "no-time-to-die-2021": "8/10 There may have been no time to die but there was certainly plenty of time for me to cry my eyes out     ",
      "skyfall": "7/10 It's crazy how this and No Time to Die are the only Bond films     ",
      "the-guilty-2021": "5/10 Jake gyllenhaal: what's your emergenc-Caller: damn bitch you smell like that?     ",
      "casino-royale-2006": "7/10 So when are we going to get the james bond and kakegurui crossover     ",
      "squid-game": "7/10 Everyone: what should we do???Me trying to date saebyeok: sooo what is your favourite taylor swift album 💞💗     ",
      "the-many-saints-of-newark": "7/10 me: i'm going to see the sopranos prequelfriend: but you haven't seen the showme: ... but jon bernthal     ",
      "beetlejuice": "8/10 Fuck beetlejuice how can i summon goth winona ryder     ",
      "once-upon-a-time-in-hollywood": "8/10    Brad Pitt did that.      ",
      "the-amazing-spider-man-2": "3/10    I haven't been the same since 10 year old me saw gwen stacy die     ",
      "dear-evan-hansen": "1/10 Maybe we owe cats an apology     ",
      "city-of-god": "10/10 It should be illegal for films to be this good     ",
      "paprika-2006": "7/10 Christopher nolan you have some explaining to do bitch     ",
      "thelma-2017": "8/10 Marvel: we're going to have the first on-screen gay superhero  Thelma: think again sweetie     ",
      "lady-macbeth": "3/10 Florence pugh in this be like: [to the tune of nobody by mitski] my god i'm so horny     ",
      "hot-fuzz": "8/10 Olivia colman saying \"nothing like a bit of girl on girl\" and then winning an oscar for her performance in a film about girl on girl 11 years later is kind of beautiful tbh     ",
      "the-matrix-reloaded": "7/10 I will be personally suing every person who ever told me that none of the matrix sequels are good     ",
      "the-suicide-squad": "9/10 Turns out that the real suicide squad was the friends we made along the way     ",
      "the-guilty-2018": "8/10 This film is guilty for almost giving me several heart attacks     ",
      "the-voyeurs-2021": "4/10 Hitch(cock)     ",
      "funeral-parade-of-roses": "10/10 Yeah sex is cool but you ever watched a film and it instantly becomes one of your favourites     ",
      "the-great-gatsby-2013": "2/10 Baz luhrmann you will pay for your crimes     ",
      "howls-moving-castle": "9/10 Howl: i see no point in living if i can't be beautiful  Me: can we make out now     ",
      "the-raid-2011": "7/10 They sure did do some raiding     ",
      "kate": "3/10 I want mary elizabeth winstead to take me out  Like on a date or with a gun?  Surprise me     ",
      "let-the-right-one-in": "7/10 Me: umm if this is a coming of age film then where's the pool scene???  100 minutes later: oh      ",
      "malignant-2021": "4/10 Is it really a james wan horror film if there isn't a dilf played by patrick wilson?     ",
      "halloween-2018": "6/10 Idk maybe he was just in a silly goofy mood     ",
      "weathering-with-you": "10/10 I know it's only January but every other film this year can go home, this is the only one that matters. Sorry to every other film.     ",
      "in-secret": "6/10 Be horny do crime     ",
      "hush-2016": "6/10 *sweating and crying profusely*Is the cat okay tho     ",
      "cinderella-2021": "2/10 James corden stars in bad musicals like he's collecting the infinity stones     ",
      "hes-all-that": "2/10 Maybe films were a mistake     ",
      "when-marnie-was-there": "7/10 Me watching this: are they... you kno-Studio ghibli: [punches me in the stomach] no     ",
      "us-2019": "7/10 While I think Get Out did some things better, Us is definitely more ambitious and because of that it gets a lot of things right but also some things wrong.   The first half is very strong but unfortunately the second half doesn't feel as well executed and a lot of what made the first act so engaging is lost, though the ending definitely delivered on what the first act had set up so perfectly.   Jordan Peele's directing is once again...     ",
      "spider-man": "6/10 You know i'm something of a lighthouse keeper myself     ",
      "portrait-of-a-lady-on-fire": "10/10 As Mitski once said: my god I'm so lonely      ",
      "villains-2019": "7/10 If maika monroe and bill skarsgård broke into my house i would simply do whatever they wanted     ",
      "fright-night-2011": "7/10 The grip that the sexy vampire genre had on society in the early 2010's needs to be written about in history books     ",
      "love-exposure": "10/10 Literally the best film ever made tbh     ",
      "dont-breathe-2016": "7/10 I love the anti-basement genre     ",
      "candyman": "8/10 If Candyman was real I would simply just not say his name 5 times in the mirror 😌     ",
      "snake-eyes-gi-joe-origins": "4/10 Pros: watching henry golding and samara weaving be hot for 2 hours  Cons: everything else     ",
      "spider-man-far-from-home": "6/10 While Homecoming felt like a much more consistent and overall stronger film, Far From Home manages to follow it up with a story that's both unexpected in some places and another great entry in the mcu.     ",
      "stillwater-2021": "5/10 Kind of weird that the runtime for this on here says 139 minutes even though it feels like it's actually 8 hours long     ",
      "something-must-break": "9/10 The something in the title is actually referring to my heart     ",
      "black-bear": "6/10 I could fix her     ",
      "annette": "6/10 The don't get married to adam driver cinematic universe     ",
      "the-green-knight": "7/10 I can't wait for a24 to start selling green knight cum belt merchandise     ",
      "reminiscence-2021": "5/10 I feel like if christopher nolan ever listened to ribs by lorde then he would have made this     ",
      "pride-prejudice": "8/10 All people in period piece films know is dance, yearn, be horny, and boiled potatoes     ",
      "election": "8/10 This is actually a psychological horror film     ",
      "frances-ha": "9/10 Cinema? More like Frances CineHa.      ",
      "cruel-intentions": "4/10 The original gone girl     ",
      "i-lost-my-body": "8/10 I find it kind of hard to watch other animated romance films since i know that none of them will ever be as good as your name but this was a nice attempt     ",
      "beckett": "6/10 After watching this and gone girl if i ever see boyd holbrook in public then i am running in the opposite direction     ",
      "the-kid-detective": "7/10 Thirsting over adam brody is so much fun and then BOOM the last 20 minutes     ",
      "clue": "8/10 It would have been better with a detective who has a southern accent played by daniel craig but it was still pretty good i guess     ",
      "amelie": "8/10 Depression rates would drop to zero if we got an amélie and paddington crossover     ",
      "water-lilies": "7/10 What if we were besties but i'm actually in love with you and i also steal out of your trash     ",
      "the-piano-teacher": "8/10 Michael haneke terrifies me     ",
      "the-lure": "7/10 Gonna tell my kids this was the little mermaid     ",
      "the-kissing-booth-3": "2/10 Starting to think that jacob elordi getting a concussion while filming euphoria was actually him trying to kill himself after being told he had to be in two more kissing booth films     ",
      "mother-2017": "6/10 This must be how joe alwyn feels all the time     ",
      "thirteen": "8/10 Mean girls but for ppl who listen to sky ferreira and fiona apple     ",
      "love-rosie": "8/10 Yearning is so cool i wish love was real     ",
      "the-meg": "2/10 the fast and furiousification of jaws     ",
      "the-perks-of-being-a-wallflower": "4/10 Currently planning to throw myself out a window     ",
      "pleasantville": "5/10 Proof that having a fiona apple song in a film instantly makes it better     ",
      "the-art-of-self-defense-2019": "8/10 When imogen poots said \"i am in the dominant position\" i genuinely thought that i was going to pass out     ",
      "atonement": "10/10 brb gonna go kill myself     ",
      "black-swan": "10/10 Darren aronofsky watching perfect blue: this is so cool but what if it was horny and gay     ",
      "little-girl-2020": "10/10 Quite possibly the most heartbreaking yet simultaneously beautiful and touching film I've seen all year. Why the fuck is this not getting more attention.     ",
      "jungle-cruise": "6/10 Can someone please remind jack whitehall that he isn't funny     ",
      "suicide-squad-2016": "3/10 Margot Robbie's back must hurt after having to carry this entire film     ",
      "predators": "6/10 a group of characters in any piece of fictional media: work together   me [crying]: chosen family 💞🥺     ",
      "logan-lucky": "7/10 I have nothing but love for the daniel craig with a southern accent cinematic universe     ",
      "500-days-of-summer": "6/10 Is there a bigger red flag than a man whose favourite band is the smiths?     ",
      "chronicle": "8/10    dane dehaan in this: murders several people and almost destroys half of seattle   me: I could fix him 💞     ",
      "jolt": "3/10 Moral of the story: never date jai courtney     ",
      "the-last-letter-from-your-lover": "6/10 how does this film about an illicit affair that stars taylor swift's boyfriend not have the song illicit affairs by taylor swift     ",
      "the-hours": "6/10 When your circle small but y'all gay and depressed af     ",
      "a-clockwork-orange": "6/10 Idk why people say the characters in this film speak in a made up language when that is actually just how bri ish people talk     ",
      "old-2021": "6/10 Someone needs to stop eliza scanlen from going anywhere near beaches     ",
      "guardians-of-the-galaxy": "9/10 [bob odenkirk in little women voice] my little guardians of the galaxy     ",
      "rope": "5/10 Me and who?     ",
      "nightcrawler": "8/10 I wouldn't be surprised if it turned out that this was a jake gyllenhaal biopic     ",
      "memories-of-murder": "8/10 me watching zodiac: yeah this is cool but there isn't much of people getting drop-kicked  me watching memories of murder: perfect 👏much better 🤌     ",
      "my-babysitters-a-vampire": "7/10 is there anything better than two boyfriends and their lesbian vampire babysitter?     ",
      "a-classic-horror-story": "4/10 the matilda lutz covered in blood cinematic universe     ",
      "the-virgin-suicides": "8/10    R.i.p. lisbon sisters you would have loved taylor swift     ",
      "pig-2021": "7/10 Why am i crying over nicolas cage and his pig     ",
      "barb-star-go-to-vista-del-mar": "7/10 Do you think they ever explored each other's bodies     ",
      "black-widow-2021": "6/10 This is the third piece of marvel content this year about grief and trauma... are the marvel writers ok? Has anyone checked up on them recently?     ",
      "space-jam-a-new-legacy": "2/10 The person who cast zendaya as lola bunny deserves a raise     ",
      "fear-street-1666": "3/10 Ummm where was black phillip???     ",
      "supernova-2020": "8/10 Starting to wish that cinemas gave you tissues for sad films so nobody can see you sobbing     ",
      "gunpowder-milkshake": "4/10 Did someone blackmail a netflix executive in order to put this on there     ",
      "a-girl-walks-home-alone-at-night": "8/10 A vampire skater gf is not a want it is a need     ",
      "loki-2021": "6/10 My brain: Don't say it don't say it don't say it don't say it don't say it don't say it don't say it  Me: Loki? More like I low-key want to fuck him  My brain: *sobbing*     ",
      "do-the-right-thing": "9/10 this spike lee guy is a pretty good director     ",
      "till-death-2021": "8/10 If i'm in a relationship with someone and they ask if i want to come to a secluded lake house with them I am filing a restraining order     ",
      "basic-instinct": "6/10 a nice wholesome film to start the week with     ",
      "blair-witch": "6/10 The Blair Witch finally conquered her fear of making public appearances, so proud of her ❤️     ",
      "a-cure-for-wellness": "6/10 Somehow this isn't the only film dane dehaan is in where eels are an important part of the plot     ",
      "in-the-heights": "8/10 The last musical I saw at the cinema was Cats so this was a nice change of pace     ",
      "fear-street-1978": "3/10 Why does netflix keep raising their subscription prices when their exclusive content seems to keep getting worse     ",
      "kill-bill-vol-1": "7/10 Refreshing to watch a tarantino film where he remembered to film the actual actors and not just their feet     ",
      "no-sudden-move": "7/10 I'm convinced that matt damon just walks on to film sets and asks to be in a scene     ",
      "midsommar": "8/10 Oof.      ",
      "fast-furious-presents-hobbs-shaw": "3/10 This movie feels like the result of one of those \"forcing a bot to watch 100 hours of ....\" if the bot was forced to watch every bad action movie from the past 20 years. Completely shallow, repetitive and like the series it's a part of, it goes on for way too long.     ",
      "cruella": "10/10 Yes I haven't watched this. Yes I know it doesn't come out for another 3 months... but I already know it's going to be a 5/5 ❤️     ",
      "the-blair-witch-project": "8/10 Turns out that it was anya taylor joy all along     ",
      "fear-street-1994": "3/10 Bri ish people reading the title of this like \"holy shit that's where I live innit\"     ",
      "the-tomorrow-war": "4/10 Hollywood can you please stop trying to make us like chris pratt     ",
      "i-daniel-blake": "9/10 More like I, can't stop crying     ",
      "luca-2021": "9/10 Another great addition to the fish people cinematic universe     ",
      "hitmans-wifes-bodyguard": "4/10 To be honest I'd gladly watch another 6 of these rather than suffer through a third deadpool film so whatever keeps ryan reynolds busy I guess     ",
      "f9": "5/10 I will only give one of these films a positive rating when they finally include a vroom vroom by charli xcx needle drop     ",
      "spontaneous": "8/10 I can't believe they gave one of the most unique and interesting coming of age films of the past decade one of the worst posters I've ever fucking seen     ",
      "eraserhead": "7/10 david lynch's children: hi dad   david lynch: such a pointless creature     ",
      "the-fate-of-the-furious": "3/10 I too would abandon my friends and family for charlize theron     ",
      "nobody-2021": "8/10 This happened to my friend John     ",
      "christine-2016": "10/10 My heart is in about 500 different pieces, I am fucking shaken     ",
      "insidious": "7/10 Oh well, I wasn't planning on sleeping tonight anyway     ",
      "the-father-2020": "8/10 Lorde was right when she said \"and I've never felt more alone it feels so scary getting old\"     ",
      "the-conjuring-2": "7/10 At least ghosts have the courtesy to knock on your bedroom door before throwing furniture across the room     ",
      "possibly-in-michigan": "9/10    Besties eat their stalker together. Sorry but I don't make the rules.     ",
      "the-game": "7/10 Yeah sex is cool but watching a david fincher film for the first time is better     ",
      "the-conjuring-the-devil-made-me-do-it": "6/10 Nothing but love and respect for dilf patrick wilson and milf vera farmiga     ",
      "a-quiet-place-part-ii": "5/10 For a film called \"a quiet place\" the people in the cinema that I went to sure didn't shut the fuck up     ",
      "spiral-from-the-book-of-saw": "5/10 I admire the fact that this is still edited like a film from 2007     ",
      "james-acaster-cold-lasagne-hate-myself-1999": "9/10 After watching this the episode of him on bake off now feels like uncut gems     ",
      "the-amazing-spider-man": "8/10 This film fucking rips idc     ",
      "one-hour-photo": "8/10 On second thought maybe I will private my instagram account     ",
      "bo-burnham-inside": "6/10 Bo Burnham during lockdown: wrote, edited and directed the entirety of this   Me during lockdown: watched birds of prey over 30 times and cried myself to sleep on a daily basis     ",
      "collateral": "8/10 Me: I hate filmbros  Me watching filmbro movies: that's some good fucking shit right there     ",
      "one-hundred-and-one-dalmatians": "7/10 The way Cruella is the best thing in anything related to this franchise     ",
      "102-dalmatians": "4/10 6 year old me had the worst taste in film     ",
      "the-muppets": "10/10 Cinema/ˈsɪnɪmə,ˈsɪnɪmɑː/noun1. the art or technique of making motion pictures.2. this movie     ",
      "james-acaster-repertoire": "9/10 I will never forgive people for not giving this man the same attention they give John Mulaney and Bo Burnham     ",
      "venom-2018": "6/10 I love gay cinema     ",
      "ma-2019": "6/10 It was just too ahead of its time     ",
      "army-of-the-dead-2021": "5/10 Why do films that should only be an 1 hr and 40 minutes insist on being almost 2 and a half hours long     ",
      "trainspotting": "10/10 Watching the toilet scene and the sex scene from this with a class full of people is definitely one of the lowest points in my life     ",
      "now-you-see-me": "6/10 Now why did they cast jesse eisenberg as the \"hot\" magician     ",
      "those-who-wish-me-dead": "4/10 amy adams and angelina jolie both being in films that were released this week only for them to both be really bad feels like a very personal attack against me     ",
      "the-hunger-games": "9/10 The early 2010's were wild you could release a film about teens murdering each other and people were like fuck yes 😤 now this is entertainment 💯 pls give us 3 more of these bitches 👏     ",
      "iron-man-3": "6/10 Every time someone calls this one of the worst mcu films a part of my soul dies     ",
      "the-woman-in-the-window-2021": "2/10 Amy Adams blink twice if you are being held captive by netflix     ",
      "the-hunger-games-mockingjay-part-2": "8/10    Gale in the first 3 films: ummm hiii katniss or should I say katnip haha 🥰  sooo 👉👈 how are you today queen 💞  Gale in this: I am a sociopath and will murder anyone if I have to also peeta sucks lol     ",
      "the-hunger-games-mockingjay-part-1": "9/10 Thinking about when 10 year old me saw this when it came out despite not having seen any of the other hunger games films just because Lorde was on the soundtrack     ",
      "the-hunger-games-catching-fire": "9/10 No better way to spend my birthday than crying throughout the entire first half hour of this     ",
      "the-producers-2005": "2/10 tw // will ferrell singing     ",
      "saw": "9/10 Quentin Tarantino's favourite poster     ",
      "thor-ragnarok": "6/10 i live to serve one person and one person alone, and that person is Tessa Thompson     ",
      "alien-covenant": "7/10 ......  Ridley Scott: I really fucking hate space     ",
      "mainstream-2020": "6/10 Gia Coppola: ok so Andrew for this scen-  Andrew Garfield: GO CRAZY ALALAHHLHA GO STUPID AAHHHHH GO CRAZY GO STUPID AHHAAHHAAH     ",
      "the-final-girls": "5/10 When the bloopers are funnier than the actual film     ",
      "arrival-2016": "7/10 Amy Adams should have won best actress at the 2017 oscars not just because she's incredible in this but because she had to pretend she was in love with jeremy renner     ",
      "superbad": "6/10 Michael Cera my sweet prince     ",
      "unfriended": "2/10 Just use zoom instead lol     ",
      "doctor-strange-2016": "4/10 This could have been one of the sexiest films in the mcu but instead it's just Benedryl Custardbath being boring for 2 hours and Rachel Mcadams not having enough screen time     ",
      "moana-2016": "9/10 If you think about it this is just mad max fury road but better     ",
      "captain-america-civil-war": "6/10 I think we should start calling this Avengers 2 and just pretend that Age of Ultron never happened     ",
      "captain-america-the-winter-soldier": "6/10 When your ex boyfriend comes back into your life and starts causing trouble but you still love him 💔     ",
      "nomadland": "6/10 I want to go on a walk with Frances Mcdormand     ",
      "prometheus": "7/10 Ridley Scott: i want to make a prequel to Alien lol  producer: oh so a film that explores the origin of the aliens  Ridley Scott: [hurriedly sketching a dick shaped spaceship] sorry what did you say     ",
      "the-mitchells-vs-the-machines": "7/10 Phil Lord and Chris Miller need their asses ate     ",
      "moulin-rouge-2001": "7/10 Films starring Ewan Mcgregor that have a musical sequence involving diamonds are a girl's best friend is my favourite genre     ",
      "joker-2019": "1/10 Todd Phillips should never be allowed near a camera ever again     ",
      "sound-of-metal": "8/10 Since I live about 15 minutes away from where Olivia Cooke grew up I will stay here for the rest of my life and hope she comes back one day so I can propose to her <3     ",
      "mortal-kombat-2021": "4/10 The only video game movie I will accept is an animal crossing film in the style of uncut gems where someone is trying to pay off their debt to tom nook     ",
      "the-truman-show": "8/10 people watching the lily show: I love their lack of energy, go girl give us nothing!!!     ",
      "promising-young-woman": "5/10 I'm fully prepared to do whatever it takes for Carey Mulligan to get her Oscar for this     ",
      "love-and-monsters": "7/10 Whenever I see Michael Rooker in anything I can't take him seriously because all I can think about is \"I'M MARY POPPINS Y'ALL\"     ",
      "dont-hug-me-im-scared-2": "8/10 ... ok but the clock is kinda hot-[GUNSHOTS]     ",
      "dont-hug-me-im-scared": "8/10 You just had to be there     ",
      "ed-wood": "5/10 An arrest warrant needs to be put out for David Fincher since he basically stole everything from this for Mank     ",
      "shiva-baby-2020": "9/10 Here's how shiva baby can still win best picture     ",
      "tomboy-2011": "10/10 Nothing like a nice little cry during a Céline Sciamma film     ",
      "the-prestige": "9/10 I miss when you could understand what the characters in a Christopher Nolan film are saying     ",
      "thunder-force": "5/10 Zendaya is Meechee  And Jason Bateman is crab man     ",
      "chaos-walking": "4/10 Tom Holland in his flop era     ",
      "big-little-lies": "9/10 Why do the Skarsgårds insist on playing the most evil characters     ",
      "rocketman-2019": "9/10 This felt a lot like a broadway musical (In a good way). The musical sequences have so much style and their dive into surrealism was so interesting to watch. All the performances were incredible especially Taron Egerton who shows a clear passion for the role and delivers a performance that truly shows off his great acting range.   The set design and costume design for the musical sequences are a joy to look at and really bring a sense of character...     ",
      "death-note-2017": "1/10 The writers of this are fucking cowards for leaving out the gay subtext between Light and L     ",
      "the-garden-of-words": "10/10 If taylor swift ever watches any makoto shinkai films I think they would probably kill her     ",
      "death-note-2006": "10/10 If you knew me in early 2017 during my death note phase... I'm sorry     ",
      "avengers-endgame": "8/10 Me: I like the mcu but I'm not really a huge fan  Also me *cries during the portals scene*     ",
      "never-let-me-go-2010": "7/10 Feel like shit  #keiraknightley     ",
      "split-2016": "6/10    The beast spares Anya Taylor Joy's character because she's suffered... ok so I've been waiting 4 years for Lorde to release new music does that count     ",
      "the-falcon-and-the-winter-soldier": "6/10 Ok but when are Sam and Bucky going to kiss     ",
      "avengers-infinity-war": "6/10    Imagine being 5 years old watching this and seeing spider-man slowly turn into dust as he begs for his life that shit would haunt you lmao     ",
      "bad-trip-2021": "7/10 How is Eric Andre not dead     ",
      "godzilla-vs-kong": "5/10 And they were roommates     ",
      "the-girl-in-the-spiders-web": "2/10 pitch meeting for this film:  producer: ok so we're going to make a sequel to David Fincher's Girl with the Dragon Tattoo  other producer: cool, that film was great  producer: but Fincher isn't returning to direct it  other producer: ok well we can find another great director  producer: and none of the original cast is returning   other producer: wait what-  producer: and instead of adapting the second book in the series we're going to do the fourth one  other producer [crying]: please stop     ",
      "t2-trainspotting": "8/10 This film only disappointing to miserable ppl I be having a ball on this bitch     ",
      "a-ghost-story-2017": "5/10 I agree film, we should throw a sheet over c*sey affle*k so we never have to look at him ever again     ",
      "alien": "8/10 This and a blunt     ",
      "the-empty-man": "5/10 Baby's first babadook     ",
      "zodiac": "9/10    I think my heart left my body during the basement scene.     ",
      "batman-v-superman-dawn-of-justice": "2/10 How the fuck do you make a film called batman vs superman boring     ",
      "sorry-to-bother-you": "8/10 Lakeith Stanfield really is one of the best actors of this generation huh     ",
      "the-lorax-2012": "2/10 The things I do for Taylor Swift     ",
      "about-time": "10/10 I hope wherever Rachel Mcadams is she knows that I would do absolutely anything for her     ",
      "billie-eilish-the-worlds-a-little-blurry": "9/10 \"Billie Eilish's music is kinda boring-\"[GUNSHOT]     ",
      "cherry-2021": "2/10 Editing is my passion ❤️     ",
      "heathers": "8/10 Quentin Tarantino cries himself to sleep every night knowing that he will never write a better piece of dialogue than \"my teenage angst has a body count\"     ",
      "spectre-2015": "5/10 At least Léa Seydoux was pretty     ",
      "wandavision": "6/10 episode 3  No thoughts, just milf Wanda and dilf Vision     ",
      "moxie-2021": "4/10 Who is the person at netflix holding a gun to director's heads and forcing them to open films with the main character writing their university application     ",
      "the-world-to-come": "6/10 I watched this for the plot (gay Vanessa Kirby)     ",
      "taylor-swift-reputation-stadium-tour": "10/10 Can't talk rn I'm doing hot girl shit (rewatching the Reputation stadium tour for the 49th time just to feel something)     ",
      "kong-skull-island": "7/10 Me to my parents: I watched this film in order to understand the new kong vs godzilla film   Why I actually watched the film: Brie Larson 🥰     ",
      "deadpool-2": "3/10 Fuck deadpool when are we getting a Domino franchise     ",
      "1917": "6/10    Tbh I too would fight to save Richard Madden     ",
      "101-dalmatians": "6/10 The amount of power Emma Stone has for making my gay ass rewatch this film     ",
      "the-devil-wears-prada": "7/10 Damien Chazelle making whiplash: what if ✋I made the devil wears prada 🥰🥺 but for the straights 😳😏     ",
      "mean-girls": "9/10 Cultural Impact:           █             █           █             █                                   ＿       Mean             The entire film industry Girls     ",
      "10-things-i-hate-about-you": "9/10 It should be illegal for a cast to be this sexy     ",
      "clueless": "8/10 Watching this a day after rewatching Parasite gave me whiplash     ",
      "framing-britney-spears": "7/10 This just reinforced the fact that I would happily throw Justin Timberlake off a cliff     ",
      "i-care-a-lot": "5/10 I love the be Rosamund Pike do crime genre     ",
      "willys-wonderland": "4/10 Nicolas Cage's agent must hate him     ",
      "dead-pigs": "9/10 Any finger raised against Cathy Yan shall crumble     ",
      "elephant-2003": "3/10 ... well then     ",
      "hustlers-2019": "9/10 Hustlers is its own mood and aesthetic with almost every scene being stylish and eccentric bliss. Give J-Lo the Oscar nomination you cowards.     ",
      "booksmart": "10/10 I'm glad I was able to see this in a cinema because this is probably my favourite film of 2019 so far.   Olivia Wilde's directing feels so fresh and original and the performances all feel so natural mainly because of Kaitlyn  Dever and Beanie Feldstein having great chemistry with each other. Also Billie Lourd manages to steal every scene she's in. The film manages to be consistently funny and not a single joke felt out of place or didn't land.   Overall this is a hilarious and surprisingly touching film with some stand out directing and great performances.     ",
      "emma-2020": "10/10 Oh to be in a quirky romantic period piece comedy with Anya Taylor Joy and Mia Goth     ",
      "john-wick-chapter-3-parabellum": "9/10 John Wick 3 is an increasingly brutal and entertaining sequel that builds upon the excellent world building of its predecessors along with having some exceptional action sequences.     ",
      "changeling": "8/10    If given the chance I too would lie in order to be Angelina Jolie's child     ",
      "judas-and-the-black-messiah": "9/10 So true future academy award winner Daniel Kaluuya     ",
      "to-all-the-boys-always-and-forever": "6/10 This series is like The Kissing Booth films if they were made by people with souls     ",
      "paddington-2": "10/10 I just want to make sandwiches with Paddington, is that so much to ask?     ",
      "the-others": "8/10 Nicole Kidman please hire me as a servant or maid, you don't even have to pay me I would just happily do whatever you tell me to <3     ",
      "malcolm-marie": "8/10 Zendaya has that Oscar in a chokehold     ",
      "miss-americana": "10/10 She's got a point... she's an icon, she's a legend and she is the moment... now come on now.     ",
      "captain-fantastic": "8/10 It's fucked up that I have to study this film for my film studies class considering every time I have to rewatch parts of it I'll probably end up crying my fucking eyes out again     ",
      "uncut-gems": "8/10 Grown Ups 3 was wild.     ",
      "euphoria-trouble-dont-last-always": "10/10 If nobody got me I know Emmy Award winner Zendaya got me     ",
      "saint-maud": "8/10 Maud stop you're scaring the hoes     ",
      "my-neighbor-totoro": "10/10 No offence, but if you don't like this film, you have no soul and I hate you     ",
      "the-wolf-of-wall-street": "9/10 Girls don't want boys, girls want Margot Robbie     ",
      "inception": "8/10 Christopher Nolan and Hans Zimmer: wow do you know what would make this scene even better?  Me: please no, not again I'm begging you-  Christopher Nolan and Hans Zimmer [Simultaneously]:  B̵̢̂̄̂̏͐̕͝w̵̨͚̲͈͕͓͐́́̋̄̽̎͗̔a̸̛͈̲̪̞̭̿̈́̍̈́̈͛͘̕͠ḧ̷̠̰̜̭͎̭͉̰͈̼́̀͘͠h̶̳̰̺̓͛̀͜ḧ̶̢̬̜͖̮̼̱͉́͑̾̂h̵̞̰̪͇̪̯̍̇̉̔̈́̐͘h̷̖̼̥̞̓̂̆͘     ",
      "vertigo": "6/10 Female characters minding their own business:  Alfred Hitchcock: that's nice [gunshot]     ",
      "shirkers": "10/10 There is no limit to the amount of money I would pay in order to watch a finalised version of the original Shirkers film     ",
      "palm-springs-2020": "9/10 Cristin Milioti if you read this I'm free on Thursday night and would like to be stuck in a time loop with you. Please respond to this and then be stuck in a time loop with me on Thursday night when I'm free     ",
      "one-night-in-miami": "9/10 2 time academy award winner Regina King has a nice ring to it     ",
      "marriage-story-2019": "9/10 The amount of Folklore and Evermore lyrics that can be applied to this film is emotionally distressing     ",
      "cats-2019": "2/10 Marty I'm scared     ",
      "compliance": "7/10    The fact that this actually happened is probably going to keep me awake at night for the rest of my life     ",
      "entanglement-2017": "1/10 Choices were made     ",
      "freaky": "8/10 Fuck it, Freaky best picture 2021     ",
      "tenet": "6/10 Inception but it's me breaking into Christopher Nolan's mind to understand what the fuck happened in this film     ",
      "no-country-for-old-men": "8/10 There are multiple violent deaths in this and yet Javier Bardem's haircut is still the scariest thing in it     ",
      "kate-plays-christine": "6/10 Didn't really like this for most of it then the last 10 minutes hit and I feel like I've been punched in the stomach and left outside in a thunderstorm     ",
      "another-me": "2/10 She's so crazzzzyyyy! Love her!!!     ",
      "pieces-of-a-woman": "6/10 Mum come pick me up I'm sad     ",
      "the-nightingale-2018": "5/10 I think I need about 3 months to process this     ",
      "possessor": "6/10 Why use the technology in this film for murder when you could use it to possess Lorde's body and make her release new music     ",
      "an-american-pickle": "6/10 Even though I have now seen this, I am still in shock that this is a real film that was made     ",
      "the-assistant-2019": "9/10 This is a horror film     ",
      "never-rarely-sometimes-always": "10/10 Sorry if there's any mistakes in this review or the tags, it's kinda hard to see atm due to the amount of fucking tears in my eyes     ",
      "minari": " I wish I had a grandma like the one in this, mine just continuously asks me if I have a boyfriend yet     ",
      "death-to-2020": "4/10 At least the tagline on the info page for this is accurate     ",
      "the-lighthouse-2019": "9/10 Me: [crying] Robert Eggers please I just want to understand what the characters in the film are saying-  Robert Eggers: DAMN YE MAD DOG! HARK! LET NEPTUNE STRIKE YE DEAD!     ",
      "wonder-woman-1984": "8/10 Nice to see that the digital fur technology in Cats is still being used     ",
      "soul-2020": "9/10 Yeah therapy's good but you ever cried your fucking eyes out while watching a Pixar film     ",
      "logan-2017": "9/10 I really gave myself no chance of being happy today when deciding to rewatch this     ",
      "ariana-grande-excuse-me-i-love-you": "8/10 Tag yourself, I'm Ariana Grande traumatising her friends by making them watch Midsommar     ",
      "ma-raineys-black-bottom": "10/10 The way everything about this film deserves an Oscar     ",
      "the-ripper-2020": "8/10 Watching all of this last night before going to sleep was definitely... a choice     ",
      "sucker-punch": "4/10 Editor: \"hey Zack don't you think there's a bit too much slow motion in this film-\" [gunshot]     ",
      "fight-club": "7/10 What if we kissed at fight club... haha jk... unless 😏     ",
      "the-prom-2020": "2/10 My family: \"heaven gained another angel today 😭👼💔\"Me in hell: WHERE IS RYAN MURPHY AND JAMES CORDEN     ",
      "where-the-wild-things-are": "9/10 Me: *is 5'5\"*Also me: I would like to hug them     ",
      "hereditary": "10/10 When your circle small but y'all crazy     ",
      "borat-cultural-learnings-of-america-for-make-benefit-glorious-nation-of-kazakhstan": "7/10 Always thinking about how this film has more Oscar nominations than Portrait of a Lady on Fire     ",
      "mank": "5/10 Pretty sure this is David Fincher's way of saying that if he had a time machine he would beat the shit out of Orson Welles     ",
      "ammonite": "3/10 What I wanted: lesbian yearning and beautiful scenery   What I got: 2 hours of sleep     ",
      "nimic": "8/10 Yorgos Lanthimos' therapist doesn't get paid enough     ",
      "the-night-before-2015": "7/10 Michael Shannon immediately makes anything better     ",
      "happiest-season": "6/10 If we're dating and we also happen to meet Aubrey Plaza and she's single... sorry but we're breaking up     ",
      "the-queens-gambit": "10/10 Me: chess seems kinda boring   Anya Taylor Joy: i'm in a series about chess and-  Me: I never said anything bad about chess, chess is my friend     ",
      "borat-subsequent-moviefilm": "8/10 Nice to see that cinema is still thriving     ",
      "the-new-mutants": "6/10 Forgive me cinema, but if I see Anya Taylor Joy and lesbians... I have no choice but to like it 😔😔😔😔     ",
      "hillbilly-elegy": "2/10 This is Amy Adams' revenge for still not winning an Oscar     ",
      "unhinged-2020": "5/10 Well, he sure was unhinged     ",
      "run-2020": "8/10 If Sarah Paulson ever decides to have a child can someone please look out for them     ",
      "jennifers-body": "9/10 Criterion release when?     ",
      "lego-star-wars-holiday-special": "7/10 I choose to believe that this is the 3rd film in the sequel trilogy and Rise of Skywalker simply never happened ❤️     ",
      "good-time": "10/10 This happened to my buddy Eric     ",
      "se7en": "8/10 Crew member: so David, what are we going to do about the lighting for this scene?  David Fincher: no     ",
      "the-hunger": "7/10 Well, they sure were hungry     ",
      "apocalypse-now": "6/10 What the fuck     ",
      "the-haunting-of-bly-manor": "10/10 Mike Flanagan in the studio like \"you dumb motherfuckers want to cry for another 9 hours\"     ",
      "trick-r-treat": "7/10 Sam: *brutally murders someone*  Me: aw he baby 🥺     ",
      "over-the-garden-wall-2014": "9/10 Greg with his silly little frog and the silly little teapot on his head     ",
      "idle-hands": "3/10 Imagine spending years on a screenplay only for it to be turned down by a studio and they greenlight this instead     ",
      "noroi-the-curse": "7/10 Going to be sleeping with every light in my house turned on tonight     ",
      "the-haunting-2018": "5/10 Me: 2.5/5  Victoria Pedretti: hi  Me: hey queen, sorry about that I meant 5/5     ",
      "revenge-2017": "8/10 Go girl give us everything!!     ",
      "the-conjuring": "7/10 How was Joey King better at acting when she was 13 than she is now 😭😭     ",
      "the-witch-2015": "10/10 Me to my parents: did thoust find thy experience of watching thee particular film enjoyable?  Parents [crying]: please stop     ",
      "ghostwatch": "8/10 To be honest, British houses really do just be like that sometimes.     ",
      "youre-next": "5/10 Family gatherings suck.     ",
      "the-wolf-of-snow-hollow": "8/10 Jim Cummings' vocal cords must hate him     ",
      "bad-times-at-the-el-royale": "9/10    Fuck this film for making me desperately want to be kidnapped by Dakota Johnson     ",
      "hubie-halloween": "3/10 Adam Sandler saying he'd make the worst film ever made after he was snubbed by the Oscars for Uncut Gems wasn't a threat, it was a warning     ",
      "scary-stories-to-tell-in-the-dark-2019": "8/10 This is unrelated to the actual film and instead applies to the cinema experience but, people who talk during films don't deserve rights.     ",
      "the-breakfast-club": "5/10 You ever go:  The film: 😴😐🤢🙄😡  One of the characters 💞💗💖💓💝     ",
      "the-social-dilemma": "5/10 Fucked up that an algorithm probably knows the exact time I'm likely to be crying while listening to Phoebe Bridgers every night     ",
      "the-neon-demon": "5/10 Films written by women: exist  Male directors: is for me? 🥺👉👈     ",
      "cursed-films": "9/10 Why aren't we talking more about how good this series is     ",
      "being-john-malkovich": "7/10 I often think about if John Malkovich had said no to being in this film, would that have meant they had to throw the whole film away     ",
      "velvet-goldmine": "7/10 Very kind of this film to invent glitter     ",
      "des-2020": "6/10 David Tennant stay the fuck away from me challenge     ",
      "the-devil-all-the-time": "6/10 do you ever go: 😞😞😞😞😞😞😴😴😴😴😴😴😴🥱🥱🥱🥱the film😐😐😪😪😪😪😪😪🤮🤮🤢🤢🤮🤢🤢🤮😒😒😒🙄🙄🙄🙄🙄🙄🙄🤢🤢🤢🤮  but then: 💗✨💕💞💓💘💕✨💓💗✨💘💗💕💗✨💞💞💗💗✨💓💘💕💖💕✨✨ the cast 💕💘 ✨💓💘💓💗💗✨💞 💗✨💕💞💓💘 💗✨💕💞💓💘✨💘     ",
      "mulan-2020": "4/10 In the same week Disney expected people to pay $30 for this they also took Taylor Swift: City of Lover concert off of Disney+... in other words I'm going to k!ll that fucking mouse     ",
      "the-babysitter-killer-queen": "7/10 What is it with Samara Weaving starring in films that involve human sacrifices and people exploding into bloody messes... is she trying to tell us something     ",
      "edward-scissorhands": "10/10 I too would wreck almost an entire house if Winona Ryder wasn't going out with me     ",
      "bad-education-2019": "10/10 I believe in be gay do crime films supremacy     ",
      "game-night": "9/10 And that's on Rachel McAdams supremacy     ",
      "im-thinking-of-ending-things": "9/10 Have you had an existential crisis while watching a Charlie Kaufman film or are you normal     ",
      "black-panther": "9/10 Rest in peace and power Chadwick Boseman   Your power, strength and inspiration to millions will never be forgotten 🖤     ",
      "a-beautiful-day-in-the-neighborhood": "10/10 I love it when films emotionally wreck me and then feel like a warm hug     ",
      "yes-god-yes-2019": "7/10 I don't think I've ever been more paranoid of my mum walking in on a film I was watching than I was during this     ",
      "sexy-beast": "9/10 Sexy Beast's symbolic boulder walked so Parasite's metaphorical ornamental rock could run      ",
      "spree-2020": "6/10 Joe Keery you're doing amazing sweetie ❤️     ",
      "lady-vengeance": "10/10 lgbtq community: Park Chan-wook no   Park Chan-wook: lgbtq community get behind me   lgbtq community: Park Chan-wook please-  [gunshot]  the entire lgbtq community: PARK CHAN-WOOK!!!!!!!     ",
      "suicide-club": "9/10 Watching this moments after I woke up probably wasn't the best decision for my mental health     ",
      "first-cow": "7/10 I've known Eve the cow for less than 2 hours but I already know that I would do anything to protect her     ",
      "host-2020": "7/10    Nobody:  Literally not a single soul:  Jemma: I'm going to create an environment that is so haunted     ",
      "terminator-dark-fate": "6/10 3 stars for Mackenzie Davis     ",
      "black-is-king": "10/10 Beyoncé said \"I respect the untalented community but it ain't me\"     ",
      "popstar-never-stop-never-stopping": "10/10 Why is this a masterpiece     ",
      "panic-room": "7/10    Jodie Foster setting Jared Leto on fire is something that can be so personal     ",
      "stoker": "10/10 I want to marry Park Chan-wook's filmography     ",
      "the-nice-guys": "10/10 Criterion... your move...     ",
      "the-rental": "6/10    Straight people be like \"weekend getaway with the besties 😍🎉\" and then die     ",
      "searching-2018": "8/10 I am once again searching for reasons why this wasn't nominated for anything     ",
      "the-kissing-booth-2": "1/10 Netflix releasing films like this and then asking for a monthly fee should be illegal     ",
      "the-handmaiden": "10/10 Why did I wait 4 years to watch this     ",
      "crawl-2019": "7/10 Character: gets attacked by an alligator.  Me: did you see the dog tho.   I think this works much better as a thriller rather than a horror film. Some of the jump scares kind of ruined the tension in scenes and there's a few pacing issues towards the second act but it still has some effective moments of tension and the main two performances were great.     ",
      "byzantium": "6/10 Saoirse Ronan as a vampire should be its own genre     ",
      "thoroughbreds-2017": "10/10 If I am killed by Anya Taylor Joy and Olivia Cooke, DO NOT prosecute them. They caught me slipping. That is on me.     ",
      "the-invisible-man-2020": "10/10 hey everyone. i'm sure some of you have seen my stuff and i just wanted to say that i have decided to deactivate and leave this account for the next year or so as I won't have enough time to interact with it or people on it due to having to run Elisabeth Moss' best actress campaign for the 2021 Oscars.     ",
      "eurovision-song-contest-the-story-of-fire-saga": "4/10 Society has progressed past the need for Will Ferrell     ",
      "moonlight-2016": "10/10 My eyes said thank you while watching this     ",
      "a-quiet-place-2018": "8/10 This film is good but I will never forgive John Krasinski for not calling A Quiet Place 2, A Quieter Place     ",
      "the-poughkeepsie-tapes": "3/10 ... um chile anyways so     ",
      "ingrid-goes-west": "9/10 I don't want a stalker unless the stalker is Aubrey Plaza, in which case I give her my permission     ",
      "bo-burnham-what": "6/10 Funny how Mozart's been real quiet since Bo Burnham started making music     ",
      "creep-2014": "8/10 Creep 🤝 Parasite 🤝 Call Me By Your Name  Making you never look at peaches/peach fuzz the same way again     ",
      "waves-2019": "7/10 I may not show it, but I am an emotional wreck     ",
      "blackkklansman": "8/10 White people kinda suck and this is one of the most powerful and important films of recent memory.... That is all.   Also Adam Driver if you read this im free on Thursday night and would like to hang out. Please respond to this and then hang out with me on Thursday night when I'm free.     ",
      "little-women-2019": "10/10 It's fine to not like this film but it means you probably have no heart and I hate you.     ",
      "hannah-gadsby-douglas": "10/10 Hey queen! Girl you have done it again. Constantly raising the bar for us all and doing it flawlessly. I'd say i'm surprised but i know who you are. Girl you make me so proud, and I love you.     ",
      "terminal-2018": "7/10 ~𝐌𝐚𝐫𝐠𝐨𝐭 𝐑𝐨𝐛𝐛𝐢𝐞 𝐚𝐩𝐩𝐫𝐞𝐜𝐢𝐚𝐭𝐢𝐨𝐧 𝐝𝐚𝐲 𝐰𝐚𝐭𝐜𝐡 #𝟏~Must a movie be good? Is it not enough to see Margot Robbie with an English accent killing people in neon lighting?     ",
      "possession": "8/10 What (and I cannot stress this enough) the fuck     ",
      "taylor-swift-city-of-lover-concert": "10/10 Taylor Swift saying \"merci\" singlehandedly increased my serotonin levels     ",
      "scoob": "4/10 Idk what's worse, the film itself or the fact that six credited writers decided to include a Simon Cowell cameo     ",
      "the-last-black-man-in-san-francisco": "9/10 I want every frame of this film injected into my veins     ",
      "but-im-a-cheerleader": "10/10 ⚠️BREAKING NEWS⚠️: all filmmakers have cancelled plans for any upcoming films with the consensus being: \"why bother? Cinema peaked 21 years ago with this masterpiece\"     ",
      "21-jump-street": "9/10    Tbh I don't blame Jonah Hill. I too would almost ruin an undercover operation because I was too attracted to Brie Larson.     ",
      "twilight-2008": "6/10 Robert Pattinson wasn't acting that's just how he is in real life     ",
      "black-christmas-2019": "6/10 😍Killing an entire cult with your besties❤️                       justgirlythings     ",
      "my-spy-2020": "2/10 🌸🌱🧚🏼‍♀️ it's nice that this film was finally released after several delays 🎀✨ 💝 but maybe it should have stayed delayed ❤️🌹💫     ",
      "the-lodge-2019": "8/10    No more children 🚫 society has progressed past the need for children 🚫     ",
      "angus-thongs-and-perfect-snogging": "7/10 \"British people have no culture\" ummm then explain this?     ",
      "i-tonya": "8/10 Can we please talk more about the needle drops in this film     ",
      "the-half-of-it": "7/10 No thoughts, heart full     ",
      "the-loved-ones": "8/10 Excuse me what the fuck     ",
      "22-jump-street": "9/10 Slam... poetry😳🤭YELLING😤😱Angry😡🤬WAVING MY HANDS🤗A LOT😠🤚Specific point of view🤯on things🧐 Cynthia👩! Cyn-thi-a👩👈Jesus😇died😵for our sin-thi-as👏😌! Jesus cried😭😞, runaway🏃‍♀️bride👰 Julia Roberts🙋‍♀️Julia Rob-hurts🤷‍♀️????! Cynthia👉👩! Mmmmmmmm🥰, Cynthia. You're dead. You 👩👈 are = dead💀bop boop🤖beep bop💃bop boop🕺bop. You're dead🙅‍♀️☠️. That's for Cynthia... who's dead👉👩=👻     ",
      "disobedience-2017": "8/10 Dear followers Today I cry at another film about lesbians. Tommorow? Who knows...     ",
      "hannah-gadsby-nanette": "10/10 This is without a doubt one of the best and most important things to come out of Netflix's Stand-Up comedy specials. Personal, funny and emotionally charged by the end.     ",
      "misbehaviour-2020": "8/10 Keira Knightley what if we held hands and destroyed the patriarchy together... haha jk... unless?     ",
      "free-fire": "7/10 While the lack of any emotional attachment or development to the characters lets the film down, the film's comedic writing is well done, the performances are solid and is seeing Armie Hammer, Brie Larson and Cillian Murphy in the same film not enough?     ",
      "trolls-world-tour": "6/10 Nobody:  Trolls: 👁👄👁     ",
      "blockers": "8/10 Why did this almost make me cry     ",
      "tangled-2010": "10/10 Rapunzel has my whole entire heart     ",
      "big-hero-6": "10/10 Feel like shit, just wish Baymax was real so I could hug him 😔     ",
      "the-turning-2020": "2/10 The writers of this film when they couldn't decide how to end it: fuck it, nothing     ",
      "swallow-2019": "7/10 No thoughts head empty     ",
      "easy-a": "9/10 Emma Stone as Olive... that's my aesthetic, that's what I want to achieve      ",
      "prisoners": "10/10 Denis Villeneuve you once again have a bitch shook     ",
      "bombshell-2019": "4/10 ~𝐌𝐚𝐫𝐠𝐨𝐭 𝐑𝐨𝐛𝐛𝐢𝐞 𝐚𝐩𝐩𝐫𝐞𝐜𝐢𝐚𝐭𝐢𝐨𝐧 𝐝𝐚𝐲 𝐰𝐚𝐭𝐜𝐡 #2~Jay Roach and Charles Randolph you're both going to jail for this one     ",
      "downhill-2020": "4/10 This film is just further proof that marrying Will Ferrell would be a mistake     ",
      "lamp-life": "7/10 Using anyone else other than Tom Hanks to voice Woody should be considered a crime     ",
      "the-gentlemen": "6/10 Hugh Grant in this film: be gay, do crime      ",
      "guns-akimbo": "2/10 Samara Weaving I'm gonna get you out of here you shouldn't be in this mess     ",
      "good-will-hunting": "8/10 I miss Robin Williams so much     ",
      "sonic-the-hedgehog": "3/10 I think the fuck not     ",
      "angst": " Seriously though, what the fuck     ",
      "assassination-nation": "5/10 Women <3     ",
      "matches": "8/10 \"Oh this... this is beautiful\"     ",
      "the-personal-history-of-david-copperfield": "7/10 Petition to put Tilda Swinton in everything     ",
      "what-did-jack-do": " Can we please get a crossover film between David Lynch's character in this and Benoit Blanc from Knives Out.     ",
      "little-monsters-2019": "8/10 Lupita Nyong'o is one of the best people currently alive. In this essay, I will-     ",
      "jojo-rabbit": "8/10 Taika honey why'd you have to do that to my heart 🥺     ",
      "pocketering": "7/10 Scorsese could never.     ",
      "shazam": "8/10 Refreshing to see DC release a good film for once.     ",
      "star-wars-the-rise-of-skywalker": "4/10 Oh no     ",
      "the-irishman-2019": "8/10 Me to my friends: I heard you paint houses  My friends: you've said this 47 times in the past week, please stop it's not funny anymore.     ",
      "frozen-2": "6/10 This is the first animated film to make me go \"wow did you see the animation on that leaf, that shit was beautiful.\"     ",
      "doctor-sleep": "6/10 Rebecca Ferguson as Rose The Hat... that's it, that's the review.     ",
      "vox-lux": "9/10 I've never felt more shook than I did the moment I realised Willem Dafoe played a narrator in this.     ",
      "texas-chainsaw-3d": "2/10 I decided to watch this instead of rewatching Paddington 2... I am dumb. The early 2010's era of horror reboots/remakes truly was one of the darkest parts of humanity.     ",
      "zombieland-double-tap": "4/10 Emma Stone you deserve better than this I'm so sorry     ",
      "gemini-man-2019": "5/10 How many Will Smiths could Will Smith smith if Will Smith could smith Will Smith.     ",
      "the-fundamentals-of-caring": "7/10 We don't deserve Paul Rudd.     ",
      "the-king-of-comedy": "9/10 Robert De Niro in this was the original MCU stan.     ",
      "taxi-driver": "8/10 That sure was about a taxi driver.     ",
      "the-wizard-of-oz-1939": "10/10 Saw the remastered 4K version of this in the cinema and I can indeed confirm that this film is still peak cinema. Also The Scarecrow is my spirit animal.     ",
      "2036-nexus-dawn": "5/10 That wasn't even Jared Leto acting, that was just Jared Leto.     ",
      "the-farewell-2019": "10/10 This is the only 2019 film that matters, sorry to every other film but that's the truth.     ",
      "an-inspector-calls": "6/10 Me: this film's kind of dullMe whenever Alastair Sim was on screen: I don't know who this gentleman is, but he is literally just vibing.      ",
      "dave-chappelle-sticks-stones": "1/10 If a twitter account with a joker profile picture was embodied as a stand-up special, this would be the result.     ",
      "greener-grass": "8/10 I'm so ready for the feature length version of this.     ",
      "late-night": "7/10 Pretty cliché in terms of narrative and structure but, it's really funny and sweet. Also Emma Thompson and Mindy Kaling are queens.     ",
      "saving-private-ryan": "8/10 Yeah it was pretty good.     ",
      "it-chapter-two": "4/10 Bill Hader's Oscar campaign starts now.      ",
      "the-banana-splits-movie": "3/10 I wouldn't be surprised if it turned out Warner Brothers got tired of that Five Nights At Freddy's movie being in development hell and they just decided \"fuck it, make it a Banana Splits movie instead.\"  Also I decided to watch this movie instead of Synecdoche New York and I have never regretted a decision as quickly as I did here.     ",
      "clockwork": "7/10 Decent short with some good sound design and atmosphere. I just wish this could one day be restored in a higher video quality.     ",
      "necktie-2013": "9/10 Yorgos Lanthimos could make a film of him just cooking for 2 hours and I'd still probably give it 5 stars.     ",
      "ghost-stories-2017": "6/10 The film has a solid premise, great performances and directing along with some pretty effective horror but, it's the execution that lets it down. The second act feels pretty dull and while the ending starts off interesting the plot twist feels kind of disappointing.     ",
      "the-hole-in-the-ground-2019": "6/10 It shows a lot of promise mainly with its directing and soundtrack but it the rest is kind of disappointing. There are some decent scares and moments of tension sprinkled throughout and some of the atmosphere's well done but, because everything feels like it's been done before it feels incredibly predictable at times. Seána Kerslake is decent in the main role and the main child actor is uneven at times but, both manage to be somewhat convincing in the roles.   While the film's tired premise and uneven performances bring it down a bit, it's elevated by some exceptional directing, great soundtrack and somewhat effective scares.     ",
      "whiplash-2013": "7/10 YNCU (Young Neil cinematic universe).  Not nearly as good as the feature length version but, considering this was made with less of a budget it's still pretty impressive. Unfortunately the directing's not as sharp here as it is in the feature length version and the actor playing Andrew in this was kind of bad. J.K Simmons is still one of the scariest and most terrifying characters of the past decade and it still manages to bring that build up of...     ",
      "1-fan-a-darkomentary": " Pretty good mockumentary.   Tbh i would also replace pictures of my family with Jake Gylenhall.     ",
      "it-2017": "8/10 Can't believe I didn't like this back in 2017 smh.   Most of the horror works really well, all the performances are great especially Bill Skarsgård and it's a pretty good adaptation.   Chapter 2 hype.      ",
      "tragedy-girls": "7/10 This not being given a proper release date in the UK is why the UK's politics are a mess.     ",
      "aladdin-2019": "4/10 Whoever decided to put a DJ Khaled song in the credits of this should be fired.     ",
      "la-la-land": "8/10 This film saved cinema.     ",
      "blinded-by-the-light-2019": "8/10 You could say I was BLINDED BY how good this was..... sorry.     ",
      "feast-2014": "9/10 Baeby hongry.      ",
      "bao-2018": "8/10 Pixar is so good that they can make a short film about a dumpling and still have me crying.     ",
      "the-exorcist": "9/10 The first 20 minutes kind of drag on a bit but after that the almost slow burn feel of the film really helps add to the atmosphere. Also William Friedkin's directing is haunting and some of the shots are incredibly striking.     ",
      "sinister": "5/10 There are some aspects here that work for example, there's some decent scares every now and then, the atmosphere is occasionally effective, the soundtrack's surprisingly good and the two main performances were great but, overall it feels really dull and squanders what is actually a pretty creepy concept.     ",
      "juno": "8/10 JK Simmons as a dad > every dad in fiction     ",
      "rockos-modern-life-static-cling": "8/10 Considering I don't have any previous personal attachment to the original show, I never thought I'd be saying that a Rocko's Modern Life reboot is one of my favourite films of the year so far.   This > most reboots from the past 20 years.     ",
      "memento": "9/10 .taerg saw ti haeY     ",
      "frankensteins-monsters-monster-frankenstein": "6/10 This was kind of funny and entertaining in its own way but, I still don't know what it actually is.      ",
      "dont-look-away": "1/10    So did the dad decide that an evil monster stalking their family wasn't something he should have given a heads up on?     ",
      "a-simple-favor": "7/10    This was basically a trashy and messy version of Gone Girl but I'm okay with that I think?     ",
      "office-space": "6/10 Bill Lumbergh > Darth Vader     ",
      "the-invitation-2015": "7/10    Cults and dinner parties make a dangerous combination.     ",
      "eugene-2012": "6/10    My favourite part about this was that the guy could bring basically anything into real life and the first thing he chooses is a singular pea.     ",
      "enter-the-anime": "2/10 The editing in this should be considered a crime.     ",
      "the-favourite": "10/10 Basically perfect. Yorgos can do no wrong.     ",
      "the-machinist": "7/10 Some of the plot feels like it treads familiar ground but, Christian Bale's performance is astonishing and it feels like a Hitcock movie mixed with a Fincher movie on drugs so yeah it was pretty good.     ",
      "cannibal-holocaust": "2/10 While it does deserve some merit mainly with the direction and soundtrack, it trades a good script and meaningful or interesting characters for cheap shock value which makes it an utterly repulsive yet strangely boring viewing experience.     ",
      "kitbull": "8/10 Pixar stop making me cry challenge.     ",
      "i-am-easy-to-find": "9/10 Didn't know it was possible for a film to make me feel every emotion in less than 30 minutes.     ",
      "lady-bird": "7/10 Greta Gerwig SAVED cinema     ",
      "weekend-2011": "9/10 At the gay awards:Call Me By Your Name I'm really happy for you and imma let you finish. But Weekend is one of the best romance films OF ALL TIME!     ",
      "the-descent": "8/10 I would say this ruined cave exploring for me but, I rarely leave my house so that doesn't affect me too much.     ",
      "cop-car": "6/10 Kevin Bacon's mustache in this could start its own cinematic universe.     ",
      "dont-look-now": "8/10 Didn't like it as much as I thought I would and the last 20 minutes are easily the best part of it but, the chilling and almost ethereal atmosphere along with the performances make it a very interesting watch especially due to a lot of the stylistic choices.     ",
      "border-2018": "8/10 David Lynch could never.     ",
      "attack-the-block": "8/10 John Boyega if you read this im free on friday night and would like to hang out. please respond to this and then hang out with me on friday night when I'm free.     ",
      "under-the-silver-lake": "8/10    Considering the somewhat mixed reaction I'd seen to this i was pleasantly surprised. It's a film that I can imagine being stronger on repeat viewings. Unfortunately it feels a bit too long at parts and some of the writing feels a bit messy with some of the story aspects not being fully explored.   The directing is definitely one of the best things about it and feels very reminiscent of mystery/noir films from the golden age of Hollywood. The mystery of...     ",
      "short-term-12-2013": "10/10 Talked to a doctor and they told me to stop watching films that make me cry for 96 minutes straight.   All the performances are great, especially Brie Larson as always and it feels so overwhelmingly kind hearted and charming at times while also balancing some heartbreaking moments.     ",
      "snowpiercer": "9/10    Wow Chris Evans really destroyed an aristocracy huh.     ",
      "spotlight": "9/10 An eye opening and chilling look at the manipulation of people's faith and the importance of journalism.     ",
      "creed-ii": "8/10 While it's not as good as its predecessor and occasionally relies on clichés, the emotional conflict is really engaging and all the performances are once again incredibly believable. I also liked how the villains weren't one dimensional and actually had character and a motivation instead of just being evil Russians.     ",
      "lobservateur": "8/10 Wes Anderson who?     ",
      "rejected": "8/10 I wish I could draw/animate so I could make insane stuff like this.     ",
      "murder-party": "6/10 While it doesn't reach its unhinged potential until the last 30 minutes, there's some good jokes and the concept feels fresh and engaging enough to at least be entertaining. Also who puts raisins in bread?     ",
      "tetsuo-the-iron-man": "7/10 Robert Downey Jr could never. Now don't get me wrong I liked this but, someone needs to go to jail for this. It's pure insanity. Looking at it as a horror film it works pretty well. It's unsettling and it never really makes any sense which adds to the offputting tone.   Honestly this was just Eraserhead but for anime fans and that's ok.     ",
      "eyes-without-a-face": "8/10 A chilling and strangely poetic film. The directing really complimented the dark tone and the slow buildup was well executed.     ",
      "room-237": "5/10 If The Shining leaves the viewer in a trance, Room 237 leaves the viewer bored and kind of confused. While some of the people have some decent points, a majority of them make no sense.   The film exhibits some interesting ideas and a potentially great concept and turns it into something that's underwhelming and seemingly pointless. For me, it hadn't changed anything about The Shining and the way I perceive it which I assume is the purpose. Overall it left me kind of disappointed but not really hating it due to some of the decent ideas presented.     ",
      "mysterious-skin": "8/10 I find it quite difficult to review this. It's incredibly disturbing and uncomfortable at parts and there's some weird choices with the editing every now and then. But, on the whole it's pretty effective.   Apart from some of the child acting, all of the acting feels almost raw especially Joseph Gordon Levitt. The directing feels almost personal and really helps add to the tone and performances.   Watching this made me realise how much I miss Joseph Gordon Levitt being in films.     ",
      "pride-2014": "9/10 I love being gay. This is now a Pride and Imelda Staunton stan account.     ",
      "deliverance": "7/10    Unfortunately the film is at its best during the opening hour and after that it kind of loses steam. Still it's highly unsettling and most of the performances are pretty good. It's also very good for anyone looking for a film where two people try to out-banjo each other.     ",
      "room-2015": "10/10 My heart needs a break rn.     ",
      "repulsion": "8/10 The only bad thing about this was that it was directed by Roman Polanski.     ",
      "first-man": "10/10 Damien Chazelle make a bad film challenge.     ",
      "martyrs": "8/10 Wtf     ",
      "the-dead-dont-die-2019": "6/10    Tilda Swinton being an alien and getting beamed up wasn't in the script, she can just do that.     ",
      "hellboy-2019": "1/10 I hate only watching half of a film and then giving my opinion, mainly because it seems unfair but I think this should be an exception because this film is so painfully bad that I couldn't bare to sit through another hour.     ",
      "a-close-shave-1995": "10/10 Wallace stopped talking to someone because they didn't like cheese.   *Icon*     ",
      "the-wrong-trousers": "10/10 How can a stop motion penguin made of clay evoke such raw menace.   But yeah this is still one of the best pieces of animation of all time. The charming plot, humour and stunning stop motion animation make it a true classic.     ",
      "yesterday-2019": "3/10 \"Just do it\" - a guy in the cinema during a scene between the two main characters.     ",
      "godzilla-king-of-the-monsters-2019": "2/10 A lot of the potentially stunning visuals was obscured by a constant use of rain and abundant use of grey and brown. None of the characters have any development and it's hard to care for any of them when most of their dialogue is exposition. Also the occasional bits of humour were very bad and felt really out of place.     ",
      "brightburn": "5/10 While the film uses its admittedly silly premise for some entertaining horror sequences, the first act is too dull and the script feels lazy.     ",
      "toy-story-4": "9/10 As someone who thought this was completely pointless I was surprised by how good this ended up being. The humour and the more emotional aspects were very well balanced and the animation was stunning at times.     ",
      "toy-story-3": "10/10 Probably my favourite out of the first 3. Emotional, funny and incredibly heartfelt.     ",
      "toy-story-2": "10/10 I think I liked this a bit more. The story is a lot more emotional and has a lot of weight behind it, the animation is significantly better and the humour is almost perfect. I still think the first one is the best but, this definitely improves upon it.     ",
      "toy-story": "10/10 Apart from some of the animation looking a bit dated this is still a classic that manages to hold up 24 years later.     ",
      "this-film-is-not-yet-rated": "8/10 Wow the MPAA sucks     ",
      "dark-phoenix": "2/10 A mess that while hilarious at times due to its sheer incompetence was boring, had a terrible script and had a story that felt scattered and rushed.     ",
      "black-mirror-rachel-jack-and-ashley-too": "2/10 This feels like someone trying to make their own Black Mirror episode but failing to understand what makes Black Mirror good. It's not as clever or interesting as it has been before and the humour is painfully unfunny and incredibly misplaced.     ",
      "burning-2018": "8/10 Apart from pacing issues during the start of the film this is a deeply unsettling character study with some breathtaking directing and genuinely impressive performances.     ",
      "the-lego-movie-2-the-second-part": "8/10 While not as good as the original, it's still a charming, endearing and incredibly well written sequel.     ",
      "pet-sematary-2019": "3/10 It's a shame this is as bad as it is because it had a lot of potential. Unfortunately the pacing is awful, none of the characters are interesting, the directing is lifeless (no pun intended) and the only thing scary about this film are some of the performances. Apart from occasional glimpses of some scary imagery and some pretty decent body horror special effects it's a huge let down. Honestly I'd rather watch the other pet sematary film from 1989 because at least that was entertaining, this is just incredibly dull.     ",
      "batman-1989": "10/10 30th anniversary re-release:  I think watching this in a cinema helped me appreciate it a lot more. Especially with Tim Burton's great directing and Danny Elfman's iconic score standing out a lot more. Jack Nicholson and Michael Keaton both give stand out performances, with Jack Nicholson having so much screen presence and putting everything into the role.     ",
      "john-wick-chapter-2": "9/10 John Wick 2 does everything a good sequel should. It doubles down on the brutal and incredible action and expands on the unique world.     ",
      "bohemian-rhapsody": "1/10 Wasted potential. Rami Malek won an oscar for lip syncing and wearing a hilariously bad fake set of teeth. The editing is shockingly bad, the cinematography is decent at best and considering this is a biopic, it's weird how little this shows about Freddie Mercury's life instead choosing to use a cookie cutter story. The concert sequences in the film are decent but you could watch the real concerts on YouTube for free and get the same experience.   Hopefully Rocketman will do the exact opposite and actually be good.     ",
      "baywatch": "1/10 Aggressively bad     ",
      "the-host": "9/10 A highly effective monster film with a surprisingly emotional core.     ",
      "hop": "1/10 Quick question:  Why?     ",
      "turbo": "1/10 Dreamworks have probably turned down many great scripts yet greenlit a film about racing snails.     ",
      "keith-lemon-the-film": "1/10 This is without a doubt the worst film I have ever seen.     ",
      "the-harry-hill-movie": "1/10 Every now and then I'll remember this exists and wasn't some bizarre fever dream.     "
   }
}