{
   "user": "Schaffrillas",
   "reviews": {
      "click": " I came into this world in a hospital that no longer stands.   The unfortunate truth about our awesome and terrible existence as a species is that the institutions we create will not last forever. Doors will be shuttered, and as the generations march on, so too will our life's work be lost to the cold, unfeeling annals of History.   However, this sentiment need not apply to art.   Indeed, our creations meant to challenge and entertain audiences may endure long after...     ",
      "my-big-fat-greek-wedding": "7/10 Not a competition but the Greek Orthodox church I grew up in is WAY nicer than that one     ",
      "dune-2021": "9/10 Yes yes YESSSSSSSSSS  Denis Villeneuve has this way of bypassing my absurdly short attention span in a way no other filmmaker can. Every scene he shoots is so compelling through its presentation and atmosphere that its overall relevance to the larger story is a moot point. I was glued to my seat during the entirety of what was arguably 2 and a half hours of setup. But when the setup is this rich and nuanced and thoroughly engrossing, how can...     ",
      "luca-2021": "8/10 I want shorter Pixar movies with less ambitious stories filled with likable characters who vibe more and do less and I'm not kidding     ",
      "munchie": "6/10 This is actually a pretty good movie if you get rid of Munchie     ",
      "the-visitor-1979": "3/10    Ever wondered what would happen if you just mashed every 70s movie together with no rhyme or reason? Well here you go!     ",
      "northanger-abbey-2007": "6/10 My gf gaslit me into thinking Captain Tilney was played by Alan Rickman the whole time. I was just like \"Huh. Ok sure I can see it\" and then we found out that it wasn't him afterwards     ",
      "little-women-2019": "9/10 Look all I know is if Timothee Chalamet asked me to marry him I would not fucking hesitate     ",
      "daddy-daughter-trip": "3/10 Dude the fact that less than 200 people have even logged this movie is funnier than any joke in the movie itself. Rob Schneider's career is COOKED man     ",
      "madame-web": "2/10    When she taught them CPR I was like \"Man I hope they use CPR on her in the final battle\" and then THEY DID!!!!!!!!!!!!!!! Poetic cinema     ",
      "the-wedding-singer": "6/10 I liked the part where everybody clapped     ",
      "taylor-tomlinson-have-it-all": "8/10 The funny     ",
      "mickeys-rival": " Watched it for Mortimer (ha cha cha)     ",
      "queen-dracula": "1/10 For once it's my own damn fault I watched this and not William's     ",
      "the-zone-of-interest": "6/10 A chilling directorial achievement with some of the most purposeful sound design I've ever heard. And yet, I couldn't help but feel that the film was very one-note; deliberately so, I'm sure. Even so, the banality of evil can only sustain a horrific on-screen atmosphere for so long. I was chilled to the bone during the first half of the film and only felt that same sensation in fleeting moments during the second half (the piano scene, when the boy...     ",
      "interstellar": "9/10    Top 2 most devastating Matt Damon betrayals  1. When he told Arthur Read he could never eat lunch in this town again2. This movie     ",
      "dunkirk-2017": "5/10 Still does not grab me in the slightest but that's simply a consequence of my incurable aversion to Oscar-nominated war movies and not because of any problems with the film itself. When Cillian Murphy had PTSD I was sad :(     ",
      "tenet": "5/10 Simultaneously Nolan's most ambitious and pedestrian work. Scientists will be studying its unique brand of mediocrity for years to come     ",
      "the-dark-knight-rises": "5/10 Just as good as I remember it!     ",
      "miranda-sings-live-your-welcome": "1/10 i watched this against my will  How was anyone surprised about her being a groomer???     ",
      "the-dark-knight": "10/10 If you told me out of all the Batman movies this is the one where he goes to a rave, I would not believe you     ",
      "inception": "9/10 persona 5     ",
      "the-prestige": "9/10    Hugh Jackman plays his own stunt double     ",
      "batman-begins": "8/10 Could not take Bruce Wayne seriously whenever he wore a suit, like I'm sorry that is just Patrick Bateman to me     ",
      "hercules-in-new-york": "2/10 A hate crime against the Greek people     ",
      "insomnia-2002": "8/10 First 30 minutes: \"Wow this guy is really good at his job\"  30 minutes in: \"Never mind\"     ",
      "memento": "10/10 I use habit and routine to make my life possible. Sammy had no drive, no reason to make it work. Me? Yeah, I got a reason.  Oh so this was as good as everyone else has been saying for decades huh     ",
      "the-web-2013": "10/10 This is still the best thing he's directed     ",
      "the-curse-2023": "8/10    That wasn't CG Nathan Fielder can just do that     ",
      "following": "6/10 Very much feels like a student film trying to emulate Nolan's style, so in other words, the most \"first directorial feature\" movie to ever be a first directorial feature     ",
      "romeo-juliet-sealed-with-a-kiss": "10/10 Mrs. Obama, I've done it. I've stopped seal racism.     ",
      "barbie": "10/10 Ken outta Ken     ",
      "blackberry-2023": "9/10 They should've hired someone who graduated from one of Canada's top business schools with really good grades     ",
      "dreamgirls": "7/10 I somehow didn't realize that was Beyonce until the end credits     ",
      "rye-lane": "9/10 So this is that buddy Eric you guys keep talking about in your reviews     ",
      "robocop": "8/10 I like when the robot fell down the stairs     ",
      "priscilla": "7/10 Every time Elvis mentioned the Colonel I got Tom Hanks ridden war flashbacks     ",
      "american-fiction": "6/10 Compelling social satire plotline forced to fight for screentime with entirely disconnected, rather uninteresting family drama. Many of the ideas in the main plot come out half-baked and unexplored as a result (the musical A Strange Loop covers a lot of similar ground in a more engaging way imo). Still, strong Jeffrey Wright and Sterling K. Brown performances, and genuinely very funny. The RBG posters in the publisher lady's office was a great bit     ",
      "they-cloned-tyrone": "7/10 They really make you wait for the character named Tyrone in this     ",
      "oppenheimer-2023": "9/10 Kinda speechless ngl. Glad I decided to see Barbie tomorrow cause this is NOT a feature you want to pair with anything. Gonna spend the rest of the day lying down, trying to process all of this, and crying. Or maybe I'll just play more Pikmin 4 idk     ",
      "anatomy-of-a-fall": "8/10    Never seen a prosecutor whip out a book report before     ",
      "blue-eye-samurai": "10/10 One of the most insane, vividly compelling action shows I've had the pleasure of seeing in quite some time, taking well-worn and familiar elements and gradually twisting them in ways that genuinely surprised me across the entire season, while tying everything together with one of the most unique and interesting internal conflicts I've seen a protagonist grapple with. A tour-de-force, too good for Netflix, simply earth-shattering in its sheer quality. Watch it immediately to help ensure it doesn't get cancelled before its story concludes.     ",
      "honky-tonk-freeway": "5/10 Kinda just a bunch of nonsense thrown together with no rhyme or reason, but hey, there could've been worse movies to end the year with!     ",
      "fear-shame": "10/10 How is this man real     ",
      "earth-girls-are-easy": "8/10 This is genuinely so good     ",
      "dream-scenario": "9/10 Big fan of the editing and the imaginative concept, not a fan of the Nicholas Braun jumpscare     ",
      "theater-camp-2023": "6/10 Ben Platt redemption arc?     ",
      "bug-buster": "3/10 Once you get past the first 70 minutes out of 90 it's actually pretty fun     ",
      "dungeons-dragons-honor-among-thieves": "8/10 BALDUR'S GATE MENTIONED     ",
      "pokemon-concierge": "7/10 Where Lotad 😡     ",
      "godzilla-minus-one": "8/10 Is it normal to come out of one of these movies having enjoyed the human characters more than Godzilla?     ",
      "chicken-run-dawn-of-the-nugget": "5/10 Mid 2000s direct to DVD ass sequel     ",
      "poor-things-2023": "9/10 Mark Ruffalo looks way too much like Lalo Salamanca in this     ",
      "bottoms": "8/10    It should be illegal for a movie this comedically unhinged to play a liar revealed plotline out so, um, straight     ",
      "silent-night-deadly-night-part-2": "6/10 Garbage Day is 10 times funnier when you know the context     ",
      "the-killer-2023": "6/10 Feels weird to describe a David Fincher movie about a hitman as \"cute\" but that's the general vibe I'm getting. A good time     ",
      "maestro-2023": "6/10 Not the worst Oscar bait I've seen, though considering how desperately Bradley Cooper wants to win one, it is really funny that Carey Mulligan acts circles around him in every scene they're both in     ",
      "teenage-mutant-ninja-turtles-mutant-mayhem": "7/10 They really milked that one joke huh     ",
      "la-jolla-playhouses-the-hunchback-of-notre-dame": "9/10 I would not want to run into Patrick Page in a dark alley     ",
      "rapsittie-street-kids-believe-in-santa": "1/10 ANIMATION. IS. CINEMA.     ",
      "the-boy-and-the-heron": "10/10 His best since Spirited Away. I do not say that lightly.     ",
      "may-december": "9/10 Wanted to crawl out of my own skin for basically the entire runtime     ",
      "grandma-got-run-over-by-a-reindeer": "4/10 no     ",
      "shes-the-man": "6/10 I like how Olivia doesn't even consider the fact that she could be bi, just \"Oh yep I'm gonna date this guy I don't know at all because I fell in love with his sister who was impersonating him\" like ??????????????????     ",
      "chicago": "8/10 Rob Marshall's immediate falloff as a director after this needs to be studied     ",
      "the-holdovers": "10/10 There's a handshake in this that feels more overwhelmingly warm and emotional than most hugs I've seen in movies     ",
      "scott-pilgrim-vs-the-world": "8/10 One of the funniest and most quotable movies ever made. I just wish the story was a bit tighter and the overflow of characters were trimmed down, but overall, I don't think I will ever stop enjoying this movie.     ",
      "eight-crazy-nights": "2/10 Holds the world record for the most times I've asked \"Wait, was that meant to be a joke\" while watching a movie     ",
      "wish-2023": "4/10 I will forget everything about this movie by tomorrow     ",
      "scott-pilgrim-takes-off-2023": "9/10 This is like expecting a Christmas present that's really cool but it's something you already own, and instead you get something brand-new that's equally as cool     ",
      "bride-prejudice": "6/10 #NotMyDarcy     ",
      "killers-of-the-flower-moon": "8/10 I just wanted more Mollie.  I wanted to know her better. I wanted to feel and better understand her love for Ernest more. I wanted her friends and family to privately voice their suspicions of Ernest, only for her to dismiss the idea that he could ever be behind this. The betrayal in this story is raw and potent, and yet, I feel like there could have been so much more to it if the movie elected to give her...     ",
      "clueless": "7/10 Everyone I watched this with erupted with applause when Wallace Shawn first appeared onscreen     ",
      "the-rocky-horror-picture-show": "10/10 In middle school I assumed everybody loved this movie because it was so bad it's good.  Now I realize that everybody loves it because it's just kind of a perfect movie. Like, name a single thing you would change about it. You can't.  Someone showed up to our midnight screening dressed as the Lorax     ",
      "pride-prejudice": "8/10 Mr. Darcy rocking a V neck in the climactic scene. Peak cinema right there     ",
      "camelot": "7/10 They cast the most Italian man alive and said \"Yeah he's French don't question it\"     ",
      "the-wolf-house": "7/10 The type of movie \"animation is cinema\" mfs on Twitter will go their entire life without watching     ",
      "once-upon-a-studio": "9/10 Kind of impossible not to be charmed by; a true labor of love that feels less like \"look at all these things we own\" and more like \"look at all these things we made\". Big fucking difference!  Yeah I teared up a little at the Quasimodo bit what of it     ",
      "past-lives": "8/10 Nora and I have the exact same laptop so every shot of her using it was extremely disorienting. Like I was seeing my laptop inside of my laptop. Laptopception. The movie was great too I guess     ",
      "dear-dictator-2017": "3/10 For some weird reason I have a craving for Subway after watching this!     ",
      "porco-rosso": "7/10    How many innocent people do you think were accidentally killed in that ending dogfight     ",
      "ready-player-one": "3/10 There was not a single frame of this movie where I thought to myself \"Steven Spielberg directed this\"     ",
      "duel": "8/10 Spielberg now: \"I'm a family friendly director!\"  Spielberg during the 70s: \"What if a truck driver wanted to murder you\"     ",
      "schindlers-list": "10/10 As iconic, almost mythic of a filmmaker Steven Spielberg is, this is the sort of film you would never imagine he has in him. Masterpiece in every sense of the word.     ",
      "close-encounters-of-the-third-kind": "8/10 Oh so THAT'S where that scene in Monsters vs Aliens came from     ",
      "west-side-story-2021": "8/10 The shot of the puddle is so breathtaking and it's such a shame Ansel Elgort had to be at the center of it     ",
      "empire-of-the-sun": "6/10 Kind of feels like the exact middle ground between overly whimsical and sentimental Spielberg, and \"director of Schindler's List\" Spielberg. He's getting to the point where he can effectively direct a powerful drama, just give him time.     ",
      "mr-boogedy": "2/10 Better Disney Plus content than Artemis Fowl     ",
      "poison-2023": "9/10 Everybody gangsta until Wes Anderson pulls out the shaky cam     ",
      "the-rat-catcher-2023": "8/10 I know the gimmick is that these are meant to be plays, but c'mon, we were robbed of a stop motion ferret     ",
      "the-wonderful-story-of-henry-sugar": "7/10 Obviously confirms that Benedict Cumberbatch would be a perfect fit for Wes's recurring ensemble, but holy shit, can we get Dev Patel in every Wes Anderson movie from now on?     ",
      "indiana-jones-and-the-kingdom-of-the-crystal-skull": "5/10 A pretty good movie if you turn it off once they get to Peru     ",
      "six-string-samurai": "6/10 Why that kid look like Jake Lloyd tho     ",
      "manos-the-hands-of-fate": "2/10 Manos: The Hands of Fate was praised for its visual effects, performances, production values, direction, score, cinematography, story and emotional depth. Among other awards, it was nominated for 14 Academy Awards and won 11, including Best Picture and Best Director, tying Ben-Hur (1959) for the most Academy Awards won by a film. With an initial worldwide gross of over $1.84 billion, Manos: The Hands of Fate was the first film to reach the billion-dollar mark. It was the highest-grossing film...     ",
      "indiana-jones-and-the-temple-of-doom": "6/10 I don't trust mfs who say this is their favorite Indiana Jones movie     ",
      "minority-report": "9/10 Heavy Rain if it was good     ",
      "sharktopus-vs-whalewolf": "2/10 Best part of the movie was when my girlfriend tweeted this: twitter.com/lavenderwhaley/status/1703200335689310320?t=vQH2Pu3I4jDDXLSV9usj7w&s=19     ",
      "whats-up-balloon-to-the-rescue-2009": "1/10 THE DEMON OF BABYLON DISGUISES HIMSELF WITH THE COAT OF THE RIGHTEOUS     ",
      "the-color-purple": "7/10 Don't really know what to say so I just wanna point out that there's a guy named Adolph Caesar in this. Like what an unfortunate name to have     ",
      "hook": "5/10 One of the most endearing and likable bad movies I've seen :)     ",
      "funny-girl": "7/10 She's so crazzzzzzzzy! Love her!!!!!     ",
      "walle": "9/10 Stunning. Way better for me as an adult than it was as a kid. The fact that Wall-E barely talks and yet manages to be one of the most well-realized and charming characters in animated history speaks volumes. The environmental message is well handled, the romance is believable. The weak villain is really the only thing holding this back from a perfect score.     ",
      "indiana-jones-and-the-last-crusade": "9/10 This movie is Raiders, but better in like, every way. It's exciting, it's super funny, you buy the emotional connection between Indy and his dad, the villains are great, the action is superb, Marcus Brody is such an endlessly entertaining buffoon. Just watch this movie if you enjoy fun. It's the best Indiana Jones movie and one of the best Spielberg movies.     ",
      "the-post-2017": "9/10 Why did Saul Goodman tell the flight attendant he had government secrets on the plane? Is he stupid?     ",
      "war-horse": "3/10 I thought he was gonna kiss the horse multiple times     ",
      "catch-me-if-you-can-2002": "8/10 \"Frank...you're not a Lutheran?\" might be the funniest line in any Spielberg movie     ",
      "muppet-treasure-island": "6/10 The puppetry was very good!     ",
      "munich": "7/10 Good movie but could not take the, uh, climax seriously     ",
      "the-lost-world-jurassic-park": "3/10 Dr. Ian Malcolm was such a better character when I knew less about him.  This is about as bad as the hardcore Crystal Skull haters say Crystal Skull is     ",
      "jurassic-park": "8/10 Dope as hell movie. Would've liked more Jeff Goldblum and less stupid ass kids tho     ",
      "over-the-garden-wall-2014": "7/10 Reminds me of Infinity Train Season 1! You know, the nice, charming, good one that paved the way for the masterpieces that were Seasons 2 and 3  Though to be fair Infinity Train doesn't have Greg     ",
      "amistad": "6/10 I like the part where the movie reaches a natural climax and then it keeps going for 45 more minutes     ",
      "lincoln": "4/10 I've seen this movie three times. I have TRIED to like it.  But goddammit this is one of the most boring films I've ever seen in my life. Daniel Day-Lewis and Tommy Lee Jones are the only things holding this movie together.     ",
      "blood-debts": "2/10 William needs to be stopped     ",
      "the-bfg-2016": "3/10 A giant gets hit in the balls     ",
      "always": "2/10 For the first time when working on one of these ranking videos, I found a movie so boring and bad that I straight-up couldn't finish it in one sitting. I paused it halfway through and watched The Adventures of Tintin. It takes a truly special piece of shit for me to need a palette cleanser by the halfway mark. Fuck this stupid ass creepy as hell big-budget Hallmark movie.     ",
      "the-adventures-of-tintin": "8/10 Dial of Destiny who? In this house we watch the REAL Indiana Jones 5     ",
      "war-of-the-worlds": "8/10 Why tf did they have to show the aliens onscreen, I was actually taking them seriously before then 💀     ",
      "freaked": "8/10 How the fuck was this actually good     ",
      "puss-in-boots-the-last-wish": "9/10 The best animated movie of 2022 and it aint even close     ",
      "faust-love-of-the-damned": "2/10 Fun for the whole family!     ",
      "we-bought-a-zoo": "5/10 My 900th log! I knew I had to do something special for it, which is why I watched peak cinema  Extremely predictable and basic, but also kind of impossible to hate? Like, gosh darn it, Matt Damon is so earnest about buying that fucking zoo that you gotta respect him for it. Glad I was able to find enjoyment in something this schmaltzy considering how the Ted Lasso finale made me want to gouge my eyes out     ",
      "1941": "2/10 I feel like it's usually really reductive to say \"that's two hours of my life I'm never gonna get back\" about a movie  But like     ",
      "super-shark": "3/10 Jerma shark movie Jerma shark movie     ",
      "how-to-take-a-bath-2009": "3/10 Erm what the scallop?     ",
      "ai-artificial-intelligence": "9/10 I promise you will never in a million years guess where the plot of this movie goes     ",
      "cinderella-once-upon-a-time-in-the-west": "2/10 Olivia: I'm going to make my review Rango at homeWilliam: We have Rango at home at homeOlivia: letterboxd.com/livmendel/film/cinderella-once-upon-a-time-in-the-west/     ",
      "the-killing-death": "2/10 This is elder abuse     ",
      "ruby-gillman-teenage-kraken": "3/10 When I'm in a \"most cliche animated film\" competition and my opponent is Ruby Gillman Teenage Kraken: 😱     ",
      "raiders-of-the-lost-ark": "8/10 Belloq really is the most despicable villain ever, he's a Nazi ally AND he's French     ",
      "much-ado-about-nothing": "7/10 If there's one thing Shakespeare was missing, it's brooding Keanu Reeves     ",
      "the-grand-budapest-hotel": "10/10 An utter delight of a film that I continue to revisit on a regular basis. It might actually be Wes Anderson's best movie, which is saying quite a lot.     ",
      "the-french-dispatch": "9/10 Imagine directing this. Wes Anderson you absolute KING     ",
      "beauty-and-the-beast-1991": "10/10 God, what a work of art. Ever since I was a kid, I had a feeling that this movie was a cut above the rest of Disney's works, and boy was that feeling correct. The romance is perfect, the songs are gorgeous, the characters are endearing, and as a bonus, we get the meme dispenser that is Gaston. I love this movie with all my heart and I don't think I'll ever stop loving it.     ",
      "belles-magical-world": "2/10 I never want to see any of these characters again     ",
      "beauty-and-the-beast-the-enchanted-christmas": "4/10 What happened to Figaro's corpse when everyone turned human again? Did his dead organ body turn into a mangled human body? I have questions  EDIT: I got the organ's name wrong I aint fixin it     ",
      "dog-police": "4/10 I am a changed man after watching this     ",
      "moonrise-kingdom": "8/10 Effortlessly charming, refreshingly small-scale ball of whimsy. It's very simple and isn't quite up to the standards of some other Wesley Anderson feature films, but it's still a delightful time     ",
      "the-darjeeling-limited": "8/10 The fact that this came out a year after Cars is so funny to me like Owen Wilson played this broken guy trying to physically and emotionally heal from his wounds and reconnect with his brothers a year after stepping into the voice booth and going \"KACHOW\" 50 times     ",
      "the-life-aquatic-with-steve-zissou": "6/10 We need a spinoff about Willem Dafoe's character pronto     ",
      "lady-bird": "10/10 hella tight movie     ",
      "isle-of-dogs-2018": "6/10 The only time in recorded history when Greta Gerwig made a movie worse     ",
      "fantastic-mr-fox": "9/10 You know how there are some movies that are clearly too good to be on Disney Plus but they somehow are anyway?     ",
      "the-royal-tenenbaums": "9/10 Probably the Wes film that hits the hardest emotionally, I'm gonna be fucked up for at least a week after watching this one     ",
      "nimona-2023": "8/10 Woulda been 5 stars if Todd was voiced by Will Arnett     ",
      "indiana-jones-and-the-dial-of-destiny": "3/10 A near-inconceivable trainwreck. I went in morbidly curious if it was slightly better or worse than Crystal Skull, and instead I got something whose closest kin is Rise of Skywalker, undoing nearly everything from its controversial predecessor but forgetting to fill the gaping hole at its center with anything meaningful or worthwhile.  Boring sidekicks, buffoonish villains who teleport to wherever the plot needs them to be, a complete lack of visual style, trite dialogue outside of a single good one-liner...     ",
      "rushmore": "8/10 Rosemary gave this kid way too many chances like she shoulda just let him fake bleed out in the rain     ",
      "casablanca": "10/10 Rick the coldest mf in fiction     ",
      "bottle-rocket-1996": "6/10 Watching such an unstylized Wes Anderson film is so weird, like it feels like I've stumbled onto some illegal footage I was never meant to see     ",
      "asteroid-city": "7/10 All these famous actors and the one who made me lose my shit the most was Hugo from Succession     ",
      "et-the-extra-terrestrial": "7/10 Why did Eliott's dad hate Mexico 🤨     ",
      "elemental-2023": "5/10 What the fuck was that pruning scene???     ",
      "ernest-goes-to-school": "4/10 The fucking cowboy never came back boooooooo     ",
      "z-o-m-b-i-e-s-3": "5/10 \"Take us to your leader. Your CHEERleader\" gotta be one of the top 10 best lines in fiction     ",
      "spider-man-across-the-spider-verse": "9/10 This is gonna be so lit when I can watch it at 0.75x speed with subtitles     ",
      "saving-private-ryan": "10/10 Watched at a Midas auto repair shop (it was playing on the TV at full volume)     ",
      "high-school-musical-3-senior-year": "6/10 I'm losing my fucking mind because during The Boys Are Back, Chad sings \"Just like a showdown, Will Smith and Bobby De Niro\". As far as I know, the only film Will Smith Robert and De Niro have both appeared in is Shark Tale, where their characters (Oscar and Don Lino, respectively) have a showdown.  High School Musical made an explicit reference to Shark Tale.  Amazing.     ",
      "the-terminal": "8/10 \"And then everybody taped a photocopy of my hand to the wall\" is the new \"And then everybody clapped\"     ",
      "the-sugarland-express": "6/10 Can't believe Spielberg's first ever theatrical work was a GTA movie     ",
      "paw-patrol-the-movie": "1/10 Unwatchable neolib claptrap. Genuinely ungratiating lowest common denominator pop fascism Neolithic capitalist trash, leaving a turgid atmosphere of phonetically unremarkable serendipity in its wake. Culture is dead and the ingrates who support unfathomably inert and artistically barren shovelware such as this must never be allowed to procreate. Cannot wait for said degenerates to share this review and write actual responses to a bunch of random buzzwords I threw together with no rhyme or reason. I have not actually seen this film.     ",
      "guardians-of-the-galaxy-vol-3": "9/10 Makes Thor Love and Thunder look like a preschooler made it     ",
      "the-guardians-of-the-galaxy-holiday-special": "8/10 I love these crazy idiots so much     ",
      "guardians-of-the-galaxy-vol-2": "9/10 I ugly sobbed. I love this movie so fucking much. It's a top 3 MCU movie for me and I could watch it a million times without getting tired of it. I will be making a video about why this is a perfect sequel, don't you worry.     ",
      "guardians-of-the-galaxy": "8/10 Amazing looking water in this movie     ",
      "suzume": "7/10 Suzume runtime: 123 minutes  Suzume runtime if the cat wasn't a little shit: 10 minutes     ",
      "hundreds-of-beavers": "9/10 Fucking incredible, no notes     ",
      "little-red-riding-hood": "4/10 The writer's barely disguised fetish     ",
      "frankenhooker": "6/10 Super crack     ",
      "the-owl-house-watching-and-dreaming": "8/10    I think Belos should've learned his lesson and everyone should've forgiven him for his war crimes, that would've been a very satisfying and justifiable ending     ",
      "the-super-mario-bros-movie": "7/10    THEY FUCKING KILLED KING BOB OMB 😭💔💣     ",
      "kaguya-sama-love-is-war-the-first-kiss-that-never-ends": "8/10 Fuck it I'm reading the manga, I need to know how best boy Ishigami's Christmas Eve went     ",
      "bahubali-2-the-conclusion": "9/10 Bahubali: 2 hours of flashback and then The Conclusion is in the last 30 minutes     ",
      "12-angry-men": "10/10 Someone's gotta make an edit of this movie where they add Ace Attorney music and sound effects     ",
      "john-wick-chapter-4": "7/10 Probably the weakest story in the series yet, one that barely feels like it escalates the overall stakes of the series compared to what 2 and 3 did. This wouldn't be a major complaint had this movie been clocked in at around 120 minutes, but unfortunately this chapter comes across as frustratingly bloated, leaving me tapping my foot waiting for the next action sequence to kick in.  But it still gets a positive score because the action was sick as...     ",
      "all-cheerleaders-die": "2/10 Okay everyone, I love giving shitty movies 5 stars as a joke too, but maybe doing it for this one is a bit too far?     ",
      "bahubali-the-beginning": "7/10 What a great movie, I sure hope it doesn't have an unengaging hour-long flashback sequence at the end     ",
      "everything-everywhere-all-at-once": "8/10 Nothing matters. Everything matters.     ",
      "the-banshees-of-inisherin": "9/10 Kid named Finger     ",
      "the-spongebob-squarepants-movie": "9/10 Had to rewatch this in honor of March 14, THE DAY THAT KRABS FRIES     ",
      "freaky-friday-2003": "9/10 Now that's an Oscar-worthy Jamie Lee Curtis performance     ",
      "soda-cracker": "4/10 Holy shit Soda, it's a helicopter     ",
      "ice-merchants": "7/10 The hats 🥺     ",
      "the-flying-sailor": "4/10 It's the size of this walnut except way smaller     ",
      "an-ostrich-told-me-the-world-is-fake-and-i-think-i-believe-it": "6/10 Baby's first 4th wall break     ",
      "my-year-of-dicks": "9/10 My ace ass thought this was gonna be about a bunch of guys named Richard or something     ",
      "speed-racer": "8/10 Felt like it was made by 12-year olds (non-derogatory)     ",
      "whiplash-2014": "10/10 Yep, still the best movie I've ever seen.#TerenceFletcherIsOverParty     ",
      "la-la-land": "9/10 Rewatched this because Dunkey told me to and surprise surprise it's still magnificent. I'm not super into Ryan Gosling's performance but the gorgeous cinematography, breathtaking musical numbers, electric romantic chemistry, and sublime writing perfectly illustrate why Damien Chazelle is an absolute master of his craft. Not quite as perfect as Whiplash, but it does have the slightly better ending. Hell, maybe the best ending I've ever seen in a movie.     ",
      "all-quiet-on-the-western-front-2022": "5/10 Fine I guess? Well-made, I suppose? I just feel like I've gotten everything I can out of Oscar-nominated war films and I don't need to see any more     ",
      "taylor-tomlinson-look-at-you": "8/10 *insert quote from the special here*     ",
      "women-talking": "8/10 Great movie but why is the color grading like that. Like I get what they're going for but you can make a movie look bleak without making it look like an antidepressants commercial     ",
      "the-lion-king-3-hakuna-matata": "7/10 I swear I've already watched this entire movie 3 times since Disney Plus launched     ",
      "lady-and-the-tramp-ii-scamps-adventure": "3/10 Lady had like 4 minutes of screentime I think     ",
      "the-fox-and-the-hound-2": "4/10 This movie is 69 minutes long     ",
      "bambi-ii": "5/10 Friend Owl really out here finding hot single does in your area     ",
      "from-up-on-poppy-hill": "8/10    Everyone talks about the incest but no one talks about the fact that there are literally characters in this movie named Sora and Riku     ",
      "ride-your-wave": "6/10 Weirdly straightforward for a Masaaki Yuasa joint, with a kinda dumb third act, but hey, any bonus grief counseling I can get through movies is nice 😁     ",
      "tarzan-jane": "2/10 Hey Lois, remember the time Tarzan stopped a spy from toppling the British monarchy?     ",
      "return-to-never-land": "6/10 Missed opportunity to have Captain Hook fight Hitler     ",
      "tarzan-ii": "5/10 Not very good but Zugor deserves the world     ",
      "castle-in-the-sky": "7/10 After watching 20 Disney direct-to-DVD sequels in a row it's nice to watch a real movie instead     ",
      "leroy-stitch": "6/10 LEROOOOOOOOOOOOOOOOOOOOY JENKINS     ",
      "brother-bear-2": "3/10 Who asked for this     ",
      "101-dalmatians-ii-patchs-london-adventure": "7/10 Like if Bolt was good     ",
      "the-jungle-book-2": "5/10 Wow that sure was the first movie again     ",
      "stitch-the-movie": "5/10 Cool overly drawn out TV pilot I guess     ",
      "the-little-mermaid-ariels-beginning": "4/10 Nice to finally get canon confirmation that no one in-universe likes Flounder     ",
      "lilo-stitch-2-stitch-has-a-glitch": "7/10 Yo what the fuck this was actually GOOD?!?     ",
      "atlantis-milos-return": "3/10 The best parts were when James Arnold Taylor used his Johnny Test voice for Milo     ",
      "pocahontas-ii-journey-to-a-new-world": "5/10 How come both Johns had better chemistry with each other than with Pocahontas     ",
      "aladdin-and-the-king-of-thieves": "6/10 The Genie could have solved like 90% of the conflicts in this movie but he was too busy making endless Disney references     ",
      "the-little-mermaid-ii-return-to-the-sea": "4/10 Dares to address the question \"If Ursula is so good why isn't there an Ursula 2\"     ",
      "cinderella-iii-a-twist-in-time": "6/10 Nice of them to forget Anastasia's character arc but make up for that by giving her a different one     ",
      "cinderella-ii-dreams-come-true": "5/10 Was disappointed to find out that Lucifer was not canonically dead after his fall at the end of the first movie     ",
      "the-return-of-jafar": "5/10 Why was Jason Alexander funny in this but terrible in Hunchback     ",
      "elvis-2022": "4/10 Genuinely unbearable! Austin Butler innocent tho     ",
      "mulan-ii": "3/10 So Mushu is the main villain in this, right? We all agree on that?     ",
      "bodies-bodies-bodies": "8/10 Sometimes having stupid characters in a murder mystery is a good thing     ",
      "the-lion-king-ii-simbas-pride": "6/10 Hey wtf they put effort into this     ",
      "the-hunchback-of-notre-dame-ii": "1/10 I'm going to throw up     ",
      "aftersun": "10/10 The kind of movie that makes you sit for 30 minutes and rethink every interaction you've ever had with your parents afterward     ",
      "triangle-of-sadness": "7/10 Maybe the biggest nosedive a film has taken in its third act, ever?     ",
      "tar-2022": "7/10 Ashamed to admit that it took me an hour and 42 minutes to realize that was the same woman from Portrait of a Lady on Fire     ",
      "parasite-2019": "9/10 Let's get one thing straight: Parasite is phenomenal. It's a stunning, subtle, and immensely powerful piece on class warfare and the nature of the human condition. It's also a tense, funny, extremely entertaining film that didn't feel its length at all. Go into it without knowing anything if you can; it made my viewing experience all the more exciting.  But with that said...I didn't really like the ending? Tons of details, character arcs, and storylines felt like they were dropped...     ",
      "the-menu-2022": "9/10    Why am I getting emotional over a cheeseburger     ",
      "see-how-they-run-2022": "6/10 Cute! Wish I liked it more, especially considering that a theatre-related mystery with Saorise Ronan quirkily jotting things down in a lil notebook sounds right up my alley, but oh well     ",
      "dinosaur-hotel-2": "4/10 Best possible way to close out 2022     ",
      "the-fabelmans": "9/10    Imagine getting cucked by Seth Rogen     ",
      "roald-dahls-matilda-the-musical": "7/10 They shoulda just killed Miss Trunchbull fr     ",
      "guillermo-del-toros-pinocchio": "7/10 Patchy the Pirate was in this     ",
      "the-star-wars-holiday-special": "2/10 Better than Rise of Skywalker     ",
      "santa-claus-is-comin-to-town": "8/10 Burgermeister Meisterburger is one of the greatest anime villains of all time     ",
      "home-alone": "7/10 Young Patrick Bateman     ",
      "glass-onion": "9/10 Feel like I've been in crazytown for the past month after a certain bird app event so this movie is exactly the antidote I needed. Spent a good 5 minutes having a cathartic laughing fit as the credits rolled.  Also you are NOT prepared for what Benoit Blanc's first scene in this movie is     ",
      "strange-world-2022": "5/10 ...better than Lightyear, I guess?     ",
      "free-birds": "10/10 I mean it     ",
      "weird-the-al-yankovic-story-2022": "9/10 My 800th log!  Probably the greatest biopic of all time     ",
      "black-panther-wakanda-forever": "7/10    Went in missing Chadwick and T'Challa, came out missing Killmonger on top of them     ",
      "zen-grogu-and-dust-bunnies": "6/10 Cute animation test     ",
      "american-psycho": "8/10 Patrick Bateman is literally just Tohru Adachi     ",
      "the-munsters": "4/10 Can someone please explain the \"I am a Lego Bat\" song  What is the joke there  What does it mean  What the fuck does any of this mean  help     ",
      "marcel-the-shell-with-shoes-on-2021": "7/10 Pretty fucked up that Marcel isn't real :(     ",
      "evil-dead-ii": "8/10 Bruce Campbell's right hand deserves an Academy Award     ",
      "entergalactic": "8/10 Add romcoms to the list of genres that are infinitely better when animated     ",
      "pompo-the-cinephile": "7/10 Who the fuck livestreams a bank meeting     ",
      "werewolf-by-night": "7/10 You're telling me that on top of being a genius composer, Michael Giacchino is also one of the only Marvel directors who knows how to compose cool shots? Wild     ",
      "tangled-2010": "8/10 Fuck that stupid bitch-ass I See the Light song for making me cry again     ",
      "the-princess-and-the-frog": "6/10 That shot of Lawrence's huge ass? Cinema     ",
      "frozen-2013": "6/10 Yeah yeah yeah it's fine, has some good songs and characters but also some bad songs and characters. It's inferior to Tangled and Moana in nearly every way but at least Olaf is funny     ",
      "chicken-little-2005": "2/10 Hahahahahahahahahahahahaha fuck this movie hahahahahahahahahahahahaha     ",
      "the-hunchback-of-notre-dame-1996": "8/10 I can never make up my mind about this one. It's a gigantic tonal mess with awful slapstick and comic relief, but this one ultimately has some of the best dramatic moments and songs in the entire Disney pantheon. The stage adaptation is better but kudos to Disney for really giving it their all with this one and creating a cult classic that's starting to gain more recognition as time goes on     ",
      "tarzan": "6/10 Not a bad movie, but it personally kinda disgusts me. It throws the musical format out the window for horribly implemented samey Phil Collins music that doesn't hold a candle to any other Disney Renaissance soundtrack. Turk is also the most annoying creature on the planet. But there are some good emotional beats and great action to make this still a worthwhile film to watch. It's just not one I revisit, like, ever.     ",
      "pocahontas": "4/10 Equal parts boring and tasteless. Hilariously predictable. Borderline unwatchable if not for the good songs and pretty visuals. Otherwise, get this trash out of my face. How do you follow up Lion King with THIS     ",
      "the-lion-king": "10/10 A near-perfect work of art that can never be replicated. Let's hope nobody is stupid enough to try.     ",
      "aladdin": "8/10 (Was gonna give this a 7 but the supreme perfection of A Whole New World convinced me otherwise)  This is a really solid, enjoyable film. I'm not overly attached to the characters or story of this one, but fantastic songs, one hell of a final battle, and that goddamn amazing Robin Williams performance make this a treat to revisit.     ",
      "the-emperors-new-groove": "8/10 It's honestly kind of miraculous this movie works as well as it does. I feel like the lack of songs is really felt in this one (especially since Snuff Out the Light is a great villain song that was unfairly cut) but the fantastic comedy bits and amazing character development for Kuzco make this such a blast to rewatch over and over     ",
      "hercules-1997": "9/10 I...like this more than Hunchback. I can't believe it either. It's just such a witty, energetic screwball comedy with an amazingly expressive animation style and a story structure that takes full advantage of the fact that it's a musical. Every song is a banger as well. I guess it's tonally inconsistent at times, but really, who cares when the characters are incredible and the story, while basic, is really heartfelt and compelling? I could go on but I'll save it for the video. Bottom line is, this movie slaps.     ",
      "the-great-mouse-detective": "9/10 Maybe definitely the gayest Disney film ever made     ",
      "the-rescuers": "6/10 Bernard out here cosplaying as Mario in his first scene     ",
      "cowboy-bebop": "8/10 The kind of anime that people who have sex can enjoy     ",
      "cowboy-bebop-the-movie": "7/10 I feel like there's at least a dozen other episodes that would've better suited the length of a feature film than this story, but it's hard to complain about getting extra time with these amazing characters.  Still haven't seen the final 4 episodes yet, so no spoilers in the comments! (Oh, wait, never mind >:)     ",
      "melody-time": "3/10 This entire film has already left my brain     ",
      "fun-and-fancy-free": "3/10 Bongo the bear needs to die a slow and painful death     ",
      "make-mine-music": "5/10 Shoutout to Disney for making this as inaccessible to watch as possible  The whale singing opera would never fly in real life     ",
      "the-fox-and-the-hound": "7/10 Tod: \"Hi I'm Tod\"  Copper: \"Nice to meet you I'm Copper\"  The background music: ♬OH THEY'RE THE BEST OF FRIENDS♬     ",
      "suburban-sasquatch": "2/10 Truly the most epic movie of 2004 about a suburban sasquatch     ",
      "hawkeye-2021": "5/10 Not too late to rebrand and become the TDCU (Tony Dalton Cinematic Universe)     ",
      "nathan-for-you-finding-frances": "8/10 You're filming something. It's kind of the purpose, right?     ",
      "dinosaur-hotel": "4/10 Maybe the worst child acting of all time, bravo Vince     ",
      "pinocchio-2022": "3/10 I checked how much time was left in the movie at least once per minute     ",
      "welcome-to-the-club-2022": "2/10 asdfsdlgbiaubgaiuuihiuadhsulfdavpuihfugpsha     ",
      "moon-knight-2022": "6/10 Once it became a completely different show it got pretty good     ",
      "attack-of-the-killer-donuts": "1/10 Sounds like it'd be fun  But no     ",
      "teen-titans-go-to-the-movies": "6/10 It would be so awesome  It would be so cool     ",
      "demon-slayer-kimetsu-no-yaiba-the-movie-mugen-train": "9/10 Season 1: Whoa this is a fun quirky demon slaying adventure! :D  This movie: 💀💀💀😭😭😭     ",
      "baby-driver": "9/10 Been riding a 5-star high with this movie for the past 5 years, but I think it's finally starting to wear off a bit as I can't really justify giving a movie with such a relatively messy screenplay a higher score than Hot Fuzz or Scott Pilgrim. Deborah's entire motives are so whack and incomprehensible, and you could cut a solid 15 minutes out of the final heist preparation to make for a much tighter narrative. And while this didn't...     ",
      "ms-marvel": "7/10 Cute! Make it a 2-hour movie next time     ",
      "dr-alien": "8/10 There is no fucking way this is real     ",
      "ponyo": "7/10 Sosuke's mother is the most irresponsible driver I've ever seen lmao     ",
      "little-italy-2018": "10/10 This is like the third 5-star rating I've given out ironically in the past week but can you really blame me? Frankly, why haven't YOU given this 5 stars? This is a fucking riot of an experience, a film that fully understands how utterly idiotic and terrible it is, and rolls with the insanity throughout its entire runtime. Hayden Christensen, a God Amongst Men, decided to grace us with his amazing fake accent and epic pizza making skills in this...     ",
      "one-hundred-and-one-dalmatians": "7/10 They should make a whole movie about Cruella or something     ",
      "nope": "8/10 Um if it's so hard to get footage of this thing then how did the cameraman of the movie get footage of it so often 🤔🤔🤔     ",
      "hard-ticket-to-hawaii": "4/10 The most epic movie ever made     ",
      "tokyo-godfathers": "6/10 Miyuki's facial expressions were on point     ",
      "neon-genesis-evangelion-the-end-of-evangelion": " ...     ",
      "neon-genesis-evangelion": " uh     ",
      "3-idiots": "7/10 Zoobi Doobi goes fucking hard     ",
      "rrr": "10/10 Easiest 5 stars I've ever given in my life     ",
      "the-bobs-burgers-movie": "6/10 Never seen the show before. This style of humor is solid and seems right up my alley for 22 minute episodes, but it gets a bit tiring after nearly two hours. The bunny girl is fun. Why did they forget it was supposed to be a musical     ",
      "the-empire-strikes-back": "10/10 At the age of 7, I knew practically nothing about Star Wars. It was the Burger King kid's meal toy promotion for Revenge of the Sith that got me fascinated in all these weird aliens and robots. I got the Han Solo toy that came with a carbonite shell to put him into, and had so much fun playing with it. My dad, eager to properly introduce me to one of his favorite franchises, asked, \"Do you want to see...     ",
      "my-big-gay-italian-wedding": "4/10 The ending song remind me of \"Get Up Offa That Thing\" from Robots     ",
      "hop": "1/10 Hop is a 2011 American live-action/computer-animated comedy film produced by Illumination Entertainment, in association with Relativity Media, and distributed by Universal Pictures. The film was directed by Tim Hill and produced by Chris Meledandri and Michele Imperato Stabile, with a screenplay written by Brian Lynch, Cinco Paul, and Ken Daurio. Paul and Daurio also conceived the film's story. The film stars James Marsden, Russell Brand, Kaley Cuoco, Hank Azaria, Gary Cole, Elizabeth Perkins, David Hasselhoff, Chelsea Handler, and Hugh Laurie....     ",
      "sing-2": "6/10 Damn, they finally did it! Illumination made something on par with a C-tier DreamWorks movie! 🤩🤩🤩     ",
      "sing-2016": "4/10 Elton Johnny     ",
      "the-secret-life-of-pets-2": "2/10 This felt like an eternity     ",
      "the-secret-life-of-pets": "3/10 Now I'm just hungry for sausages     ",
      "my-neighbor-totoro": "8/10 Not to imply unoriginality, but the cat bus does remind me of Morgana from Persona 5 🤔 🤔 🤔     ",
      "flubber": "2/10 This is the quintessential example of how not to write a movie     ",
      "the-gingerweed-man": "1/10 Hark Triton, hark! Bellow, bid our father the Sea King rise from the depths full foul in his fury! Black waves teeming with salt foam to smother this young mouth with pungent slime, to choke ye, engorging your organs til' ye turn blue and bloated with bilge and brine and can scream no more -- only when he, crowned in cockle shells with slitherin' tentacle tail and steaming beard take up his fell be-finned arm, his coral-tine trident screeches banshee-like...     ",
      "thor-love-and-thunder": "5/10 The best and most visually interesting part of the movie was the different fonts they used for the credits     ",
      "despicable-me-3": "4/10 I miss my homie Vector     ",
      "despicable-me-2": "5/10 Where is Vector? Is he safe? Is he alright?     ",
      "despicable-me": "7/10 Vector is the reason I work out. I have this fantasy where we start talking at the Vanity Fair Oscars party bar. We exchange a few pleasantries. He asks what I do. I say I loved him in Despicable Me. He laughs. I get my drink.  \"Well, see ya,\" I say and walk away. I've got his attention now. How many guys voluntarily leave a conversation with Vector? He touches his neck as he watches me leave.  Later, as the...     ",
      "minions": "2/10 There was a scene where they try to hang the Minions and I liked that scene     ",
      "the-grinch": "2/10 Wooooooooooooooo you just keep hitting the home runs Illumination     ",
      "the-lorax-2012": "2/10 I think the past 10 years of funny haha memes and epic Danny Devito moments distracted me from the fact that this is heinously awful lmao     ",
      "the-many-adventures-of-winnie-the-pooh": "7/10 Rabbit tries to decorate Pooh's fat ass     ",
      "star-wars": "9/10 Delicious. Finally, some good fucking food.  Watching this movie with fresh eyes, without thinking about the baggage associated with the franchise nowadays, is an absolutely magical experience. The worldbuilding and unfolding mysteries are astounding. The character interactions are my favorite parts; for instance, seeing Han and Obi-Wan play off of each other is great, since their vastly different perspectives make for excellent exchanges. Everyone has great chemistry, the setting is well-defined, the campiness honestly enhances the viewing experience. Only thing...     ",
      "joe-versus-the-volcano": "5/10 Not one Joe Mama joke in the whole thing     ",
      "fantasia": "8/10 Possibly the most timeless film ever made     ",
      "spring-awakening-those-youve-known": "8/10 lea michele shut UP     ",
      "minions-the-rise-of-gru": "4/10 He rose!     ",
      "army-of-darkness": "9/10 Probably my favorite of Raimi's trilogy because the main character is at his most entertaining here, and while I find this one's insane tonal whiplash and absurd out-of-nowhere concepts to be utterly at odds with the previous two films, they're silly and distinct and memorable and fun enough to make this film the most consistently engaging out of the three to me.  ...but enough about Spider-Man 3.     ",
      "the-evil-dead": "7/10 The dead speak!     ",
      "lady-and-the-tramp": "4/10 I hope she made lotsa spaghetti     ",
      "robin-hood": "7/10 It's no \"YTP: Friar's Rubbing Wood - Fall Of Nottingham\" but it ain't half bad     ",
      "obi-wan-kenobi-the-patterson-cut": "6/10 So uncivilized     ",
      "the-hobbit": "5/10 So nice of them to make a spinoff movie about Mip from Smiling Friends     ",
      "the-thing": "9/10 This is the first time I've actually seen Wilford Brimley in something that isn't a YouTube Poop     ",
      "lightyear-2022": "5/10 You are a sad, strange little movie. And you have my pity.     ",
      "yuri-on-ice": "8/10 (between tears) they were...born to make history (breaks out into full-on sobbing)     ",
      "whisper-of-the-heart": "10/10 This hit me so hard in so many ways. I haven't felt this \"seen\" by a movie since I first watched Lady Bird 4 years ago. Fuck, man, this is such a special film in so many ways. Every aspiring artist and dreamer needs to watch this. I'm never gonna be able to listen to Country Roads again without sobbing thanks     ",
      "the-devils-carnival": "6/10 The songs and aesthetic were better than Repo but most importantly it was 30 minutes shorter     ",
      "repo-the-genetic-opera": "4/10 This is like if Morbius was a musical     ",
      "star-wars-episode-i-the-phantom-menace": "4/10 More fun than I remember. The environments and characters either look really good or hysterically bad. Jar Jar and Anakin are annoying but in an amusing sort of way. Watto, Nute Gunray, and Boss Nass are all comedy goldmines. It really is just one of those so bad, it's good movies; all of its blunders are either hilarious or endearing, and I had a great time rewatching it.     ",
      "color-out-of-space": "7/10 Nic Cage should be in every horror movie     ",
      "millennium-actress": "9/10 Movies really are a miraculous thing, aren't they     ",
      "paprika-2006": "6/10 Hmm...I definitely vibed with the animation, sound design, direction, editing, all that good stuff. But to me, this lacked the emotional investment needed for one of these kinds of intentionally confusing and disorienting films to work. Perfect Blue managed to be more overwhelming to the senses AND more emotionally impactful by perfectly getting you into its protagonist's fractured headspace. This, by comparison, felt stretched in far too many directions for me to really connect with anything going on. I also...     ",
      "the-black-cauldron": "3/10 This is like a feature-length version of the Zelda CD-i cutscenes except not funny     ",
      "oliver-company": "4/10 After reviewing the situation, I've come to the conclusion that I cannot stand the Oliver Twist story no matter how it's adapted     ",
      "the-sword-in-the-stone": "4/10 It should be illegal for a movie about a wizard to be this boring     ",
      "peter-pan": "8/10 Honestly could have been the best classic Disney movie if it wasn't for... (gestures to the racism)     ",
      "top-gun-maverick": "8/10 You're telling me that cute lil kid from the first movie grew up to become Miles Teller? Tragic     ",
      "top-gun": "5/10 I might be the only person who's ever noticed this but this movie has gay undertones?????????     ",
      "nukie": "2/10 Genuinely so awful that I started crying at the end. Highly recommend     ",
      "monster-high-why-do-ghouls-fall-in-love": "6/10 Oscar-worthy cinematography     ",
      "the-aristocats": "6/10 There's no way EVERYBODY wants to be a cat     ",
      "bo-burnham-the-inside-outtakes": "8/10 Well, well, look who's inside again.     ",
      "morbius": "10/10 Watched the first 10 minutes of this and decided it was all I needed to see.     ",
      "toradora": "7/10 Very good when Taiga is not beating the shit out of Ryuji     ",
      "sk8-the-infinity": "7/10 Roy Fire Emblem and his gay lover battle homoerotic vampire Phoenix Wright in a skateboarding competition     ",
      "monster-high-boo-york-boo-york": "5/10 There were monsters and they were high     ",
      "bubble-2022": "5/10 The animation was very good!!  ...I liked The Bad Guys a little better if that helps you sleep at night     ",
      "night-is-short-walk-on-girl": "8/10 I want to live in Masaaki Yuasa's wacky incomprehensible gorgeous life-affirming world     ",
      "good-burger": "5/10 Am I sleep-deprived or was Ed genuinely funny     ",
      "chip-n-dale-rescue-rangers": "6/10 The first huge IP crossover film in a while that didn't make me want to die!     ",
      "sleeping-beauty": "7/10 \"Now shall you deal with me, O Prince, and all the powers of hell\" rawest line in a Disney movie fr     ",
      "belle-2021": "9/10 First of all, I think this might be the most gorgeous animation I've ever seen in a movie? I am so jealous of everyone who got to see this in theaters.  Second, the meaningful and profound lengths this movie's narrative goes to in order to subvert expectations is just incredible. This obviously was never gonna work as a straight-up Beauty and the Beast remake, which is why I was so pleased to see this movie evoke that story's premise and...     ",
      "lupin-the-third-the-castle-of-cagliostro": "7/10 This Miyazaki guy is going places     ",
      "akira": "7/10 Tetsuo the Iron Man     ",
      "moby-the-void-pacific-choir-are-you-lost-in-the-world-like-me": "2/10 I'm beginning to think that smartphones are actually making us less connected.     ",
      "mickey-donald-goofy-the-three-musketeers": "6/10 Pete got the best ass in all of France     ",
      "the-spirit-of-43": " Donald Duck commits tax fraud     ",
      "cinderella": "4/10 The dog in this is named Bruno, how come we don't talk about that     ",
      "the-magic-rosette": "8/10 Not as good as Morbius but whatever     ",
      "konga-tnt": "1/10 Just a puppet on a lonely stringOh, who would ever want to be King (Kong)     ",
      "uhf": "6/10 What if we kissed at Spatula City 🥺 👉👈     ",
      "chud-ii-bud-the-chud": "8/10 The biggest quality increase from the first movie to the second in cinematic history     ",
      "doctor-strange-in-the-multiverse-of-madness": "6/10 Eyyy my 700th log!   One of the most fucking bizarre, structurally and tonally incoherent films in the entire MCU, but it did have some epic Sam Raimi moments here and there. Please give him more control and a better script next time     ",
      "the-bad-guys-2022": "5/10 The animation was very good!!     ",
      "the-adventures-of-ichabod-and-mr-toad": "7/10 Mr. Toad was the first influencer     ",
      "fate-stay-night-heavens-feel-iii-spring-song": "7/10 BUFF KIREI BUFF KIREI     ",
      "schlock": "6/10 Shlock!     ",
      "the-three-caballeros": "4/10 Donald is shown to be in love with women, but he's part of a trio that explicitly sings about being \"three gay caballeros\". Which is it     ",
      "bambi": "5/10 Didn't think there was enough story content or compelling character moments to sustain a feature film sadly. If this was a short film I'd love it     ",
      "alice-in-wonderland-1951": "9/10 Tim Burton's live-action remake found dead in a ditch     ",
      "saludos-amigos": "6/10 I'd honestly love to see a modern interpretation of this half-documentary, half-animated short collection style of film, made by people who actually come from the culture that's being adapted. It'd be pretty cool without the blatant commodification of South American culture by U.S. businessmen.  Fun animated segments and a nice breezy watch at only 42 minutes.     ",
      "dumbo": "6/10 Grown ass elephant ladies beefing with a literal newborn lmao     ",
      "the-girl-who-leapt-through-time": "6/10 Oh no this girl hit her head leaping multiple times and has a concussion, now she thinks she's a time traveller     ",
      "george-lucas-in-love": "7/10 This is cute. I like this. I'm also hardcore procrastinating on my next video     ",
      "the-pickle-recipe": "5/10 Succession for pickle lovers     ",
      "creature-from-the-haunted-sea": "2/10 Plz direct me to a good Roger Corman movie I haven't seen one yet     ",
      "the-unbearable-weight-of-massive-talent": "5/10 This was like 5 different movies at once and the only good one was Nick Cage and Pedro Pascal vibing     ",
      "the-miracle-maker": "8/10 This movie gave me NIGHTMARES as a kid so I never wanted to rewatch it, but it's actually really cool and artistic and compelling, who knew? Crazy how good Christian cinema can be when it isn't pandering or hateful or embarrassing     ",
      "fate-stay-night-heavens-feel-ii-lost-butterfly": "7/10 If you think about it, this movie's conflict is very similar to the one in Wallace and Gromit: The Curse of the Were-Rabbit     ",
      "pinocchio": "6/10 Something so special about seeing a Disney icon like Pinocchio smoking a cigar     ",
      "robot-chicken-star-wars-episode-iii": "7/10 Probably the weakest one with some jokes that go on way too long, but man Yarael Poof is the best character in this trilogy     ",
      "robot-chicken-star-wars-episode-ii": "7/10 This trilogy has the best characterization for Boba Fett of all time lmao     ",
      "robot-chicken-star-wars": "8/10 Rey the Death Star construction worker >>>>> the other Rey  Can't believe how well this holds up lmao     ",
      "fate-stay-night-heavens-feel-i-presage-flower": "6/10 Look Shirou I love ya but can Sakura get some screen time in her own damn story     ",
      "kotaro-lives-alone-2022": "7/10 The anime equivalent of the 🥺 emoji     ",
      "snow-white-and-the-seven-dwarfs": "7/10 The Queen is so hung up on Snow White being prettier than her that she creates a potion to turn people ugly. She then uses it on herself? As a disguise to give Snow White a poisoned apple with? Instead of just forcing Snow White to drink the ugly potion and skipping the poison apple step entirely? Smh work smarter not harder     ",
      "high-school-musical": "7/10 Yo Zeke is the fucking MVP, I wish I had a friend who would consistently bake stuff for everyone and I can't believe these people are trying to discourage him from doing that. Fuck the haters, Zeke, keep it up!     ",
      "sonic-the-hedgehog-2": "7/10 Robotnik and Stone didn't even have sex once wtf     ",
      "the-tatami-galaxy": "8/10 Haha that's a funny little cowboy in the intro, I wonder what his character will be like-oh     ",
      "hellblazers": "2/10 I forgot literally every single thing about this movie 10 seconds after it finished     ",
      "barbie-as-the-princess-and-the-pauper": "6/10 It's no Bratz: Rock Angelz but it's still cinema     ",
      "bratz-rock-angelz": "10/10 I take my Letterboxd very seriously  Wendie Malick deserved an Oscar for this     ",
      "gibby": "10/10 Only caught the last 30 minutes of this but I'm convinced it's the best movie of all time     ",
      "belfast": "3/10 \"We had a neural network watch 100 Best Picture nominees and then asked it to create its own\"     ",
      "fate-apocrypha": "5/10 Was torn between a 5 and a 6 but the mere existence of Jack the Ripper drags this down to a 5. Needed more Shakespeare.     ",
      "drive-my-car": "9/10  \"It didn't sound like he was lying. I don't know if it's the truth, but he was telling you what was true to him.\"   Fucking hell this destroyed me emotionally. A rather unwieldy slow burn that didn't fully grab me at first, but as the story progressed it revealed the necessity of every seemingly irrelevant detail in the first half. I went from thinking \"Yeah it's a good movie that needed to shave down that 40 minute prologue\" to \"Holy...     ",
      "tick-tick-boom-2021": "8/10 You see how much good Lin-Manuel Miranda can do when he's not in front of the camera?     ",
      "moulin-rouge-2001": "8/10 Man this Obi-Wan/Satine prequel hits different  The first half of this is pretty much perfect, from the madcap editing and storytelling to the magnificently realized musical numbers. The second half took a bit of a tumble into bland melodrama (and the duke is kind of a supreme dumbass for not realizing the play was about him sooner) but overall it's a movie that I CANNOT believe I liked as much as I did. I normally hate jukebox musicals but this shit just hits imo     ",
      "new-york-ninja": "6/10 Men will literally become the New York Ninja instead of going to therapy     ",
      "who-killed-captain-alex": "10/10 I am physically incapable of giving this any less than 5 stars     ",
      "kakushigoto": "8/10 I love wacky slice-of-life anime, Charlie! I LOVE WACKY SLICE-OF-LIFE ANIMEEEEEEEEEEEEE     ",
      "turning-red": "5/10 Some good ideas at play here but an absolute mess of an execution. Idk just watch Lady Bird or Only Yesterday instead.  Edit: Here's my less dismissive and more elaborated upon thoughts: www.youtube.com/watch?v=nEwJBB6AUR4&t=2s     ",
      "batman-mask-of-the-phantasm": "8/10 Turns out the best Batman stories are the ones that actually deconstruct his philosophy and him as a character in general, who knew     ",
      "yona-of-the-dawn": "7/10 It ended just as it was getting really good :/     ",
      "the-batman": "8/10 Holy shit that score FUCKS. Michael Giacchino here are the keys to my house go fuck my wife  Yeah this movie is great! Robert Pattinson might be my favorite Batman to date, and his story actually has a ton of great shit to say about the very nature of the character. There's a line said towards the end that chilled me to the bone specifically because of who said it, and a scene shortly after which, while probably not intended...     ",
      "million-dollar-crocodile": "2/10 There was a crocodile     ",
      "the-satellite-girl-and-milk-cow": "5/10 This would honestly be one of my favorite movies ever if the people making it actually knew what they were doing     ",
      "flee-2021": "7/10 Insanely powerful and raw but I feel like the style kinda held me back from fully connecting with it unfortunately     ",
      "keep-your-hands-off-eizouken-2020": "7/10 EASY BREEZY  EASY BREEZY     ",
      "death-note-2017": "2/10 This is the hardest I've laughed in a long time     ",
      "tammy-and-the-t-rex": "5/10 One of the most insane concepts for a movie I've ever seen.  I just kinda wish it did more with that concept     ",
      "fullmetal-alchemist-brotherhood": "8/10    So funny how the main villain of this incredible epic sprawling story is a tiny little Mike Wazowski looking ass gremlin     ",
      "re-animator": "8/10 Ok this was epic     ",
      "kimi": "6/10 I liked it when she was in the apartment, after that ehhhhhhhhh. Congrats to this movie for being the first one to use dutch angles correctly though!     ",
      "tetsuo-the-iron-man": "6/10 Cool special effects and editing. Not really my thing tho. Great film to put on while eating     ",
      "coda-2021": "9/10 Crazy how such a cliche and predictable movie could be sooooooo endearing and enjoyable. Loved watching this so much, I always felt so emotionally attached and invested and it didn't feel like I was being Oscar-baited to in the slightest. Emilia Jones is going places. Loved the choir teacher in this too. Man I miss high school choir!     ",
      "sucker": "6/10 Why the fuck was I so invested in this     ",
      "cold-sweat": "4/10 This is a movie     ",
      "geteven": "2/10 The most plotless movie I've ever seen in my life     ",
      "the-tragedy-of-macbeth": "7/10 The kind of movie that the One Perfect Shot Twitter account was made for     ",
      "angels-egg": "8/10    The guy after destroying the girl's egg: \"It's just a prank bro\"     ",
      "the-jungle-book": "5/10 Idk man the songs were great but this was kinda boring overall     ",
      "ouija-shark": "2/10 Why do you give me your toughest battles Lord     ",
      "chud": "2/10 They forgot to resolve the main conflict of the movie     ",
      "attack-of-the-crab-monsters": "2/10 Imagine making a movie about giant enemy crabs boring     ",
      "star-wars-episode-ii-attack-of-the-clones": "2/10    This is such a fucking trainwreck in every conceivable way. I legitimately wanted to vomit watching Padme fall in love with a literal sociopath who murders not just the men, but the women, and the children too. This is the worst Star Wars film by a country mile. At least it has memes     ",
      "revue-starlight-the-movie": "6/10 Gay people gay people gay people  (Translation: While this movie outdoes the show in terms of visual spectacle, I had a much more difficult time following the story and getting emotionally invested in the characters' plights; the surreal and often confusing nature of the story suited an episodic format much better than a film, and the pacing unfortunately suffered with a ho-hum first act that could have used some of the revues they saved for later. It's a suitable enough...     ",
      "revue-starlight": "7/10 Gay people gay people gay people gay people gay people     ",
      "star-wars-episode-iii-revenge-of-the-sith": "6/10 One of my favorite comedies. It continues to drop the ball with Anakin's character, and anything involving him is a massive trainwreck. The first half of the movie is mostly boring as well. But once you hear the words \"I am the senate,\" this movie becomes an absolute blast. The story becomes strangely compelling, the action is solid, the memes really land. Anakin is way more compelling as an irredeemable antagonist than he is a fallen hero, after all. Overall,...     ",
      "fate-grand-order-final-singularity-grand-temple-of-time-solomon": "6/10 Ritsuka Fujimaru can't carry a movie! Who would've guessed?  But Mash is pretty epic 😎     ",
      "rollergator": "2/10 What if Channel Awesome made movies during the 90's     ",
      "raya-and-the-last-dragon": "6/10 Stop casting Awkwafina in things please I'm begging you     ",
      "the-social-network": "10/10 Haven't seen this movie since I was 12 and yet I vividly remembered nearly every single scene and so many lines of dialogue. Such a masterfully crafted film in every way; screenplay, direction, editing, performances, the whole shebang. This film had 100% of my attention from beginning to end and I'm disappointed it didn't continue for another 10 hours. Not awarding this film Best Picture may be the Academy's most egregious mistake in a long and torturous line of egregious mistakes.     ",
      "smiling-friends": "8/10 Needed more Alan     ",
      "komi-cant-communicate": "8/10 The sweetest anime ever 😊     ",
      "harry-potter-20th-anniversary-return-to-hogwarts": "7/10 Laughed out loud when they said \"multi-million pound film\" like lmao I forgot that was the name of British currency lol Britain is so weird     ",
      "cmon-cmon": "8/10 Still don't want kids but man do I want to be an uncle now     ",
      "dont-look-up-2021": "3/10 If anything this movie may have accelerated climate change     ",
      "shark-tale": "10/10 Why haven't I reviewed this yet? Best movie of all time for sure. Like, I deadass have no idea what score I would legitimately give this movie because I derive so much ironic enjoyment from it.  It's ok, a lot of white fish can't review movies.     ",
      "sky-sharks": "3/10 Boring ass movie with the best opening in cinematic history     ",
      "bad-cgi-sharks": "3/10 My New Years Resolution is to watch every bad shark movie     ",
      "hilda-and-the-mountain-king": "7/10 Now give us the She-Ra movie Netflix, don't be shy     ",
      "furry-nights": "1/10 Ah sweet! Man-made horrors beyond my comprehension     ",
      "spencer-2021": "6/10 I hope Kristen Stewart and Jonny Greenwood's backs are okay from carrying this movie     ",
      "pig-2021": "8/10 Haven't felt this much tension during a dinner scene since Shrek 2 (2004)     ",
      "an-extremely-goofy-movie": "6/10 Where is Roxanne 😡😡😡     ",
      "encanto": "9/10 I wish I could send this film back in time so 10-year-old me could see it. He really needed it.     ",
      "the-green-knight": "7/10 \"Why is he green, do you think?\"  Oh my God, Lady, you can't just ask people why they're green     ",
      "ciape": "2/10 My 600th movie logged on Letterboxd!  Absolute masterpiece that changed my life and watered my crops. Beautiful work of art that must be experienced by all. Truly epic     ",
      "how-the-grinch-stole-christmas-2000": "4/10 Extremely not good but MAN is it a ton of fun     ",
      "licorice-pizza": "9/10 Banger movie! Reeeeeeeeeeeeeeeally would have liked a more ambiguous and less rushed ending tho. Also pretty wild that the Asian jokes that caused such an uproar could've just been edited out of the movie entirely and nothing would change. So like, why didn't they  Was that John C. Reilly as Frankenstein for 2 seconds or am I going insane     ",
      "gremlins": "6/10 Every time Gizmo did literally anything I got super emotionally invested. I squealed with delight whenever he was happy, I shouted \"No no no no no no no no\" every time he was scared or in pain. I would fucking die for Gizmo you have no idea     ",
      "scrooged": "4/10 Am I still supposed to find the Scrooge character unlikeable and annoying and irredeemable 75 minutes into a 100 minute movie     ",
      "spider-man-no-way-home": "8/10    Never in a million years would I have predicted that Andrew Garfield's Peter Parker would be the best character in this movie     ",
      "spider-man-3": "9/10 The funniest superhero movie ever made, and my personal favorite of the Raimi trilogy. It never gets old to revisit.www.youtube.com/watch?v=fR-V1yukXB4     ",
      "the-power-of-the-dog": "6/10 I feel like this movie really hinged on its performances to tell the story rather than relying on the script, which is why it bums me out that I was just not sold on the performances given by Kodi Smit-McPhee and especially Banana Mania Cucumbersnatch. The latter just didn't convince me he was a rough-and-tumble cowboy at any point and it severely dampened what could otherwise have been an incredibly compelling character study.  The pacing is rather glacial, which wasn't...     ",
      "diary-of-a-wimpy-kid-2021": "3/10 One of the emptiest cinematic experiences I've had in a long time tbh     ",
      "saving-christmas": "1/10 This is an extremely funny movie and I would recommend that everyone watch it     ",
      "anna-and-the-apocalypse": "6/10 If there was a version of this movie that's gone through like 5 more script revisions it would be one of my all-time favorites     ",
      "the-muppet-christmas-carol": "5/10 I didn't actually watch it yet, I just wanted to read the comments if I did this     ",
      "darkness-light-darkness": "8/10 🍆🍑     ",
      "mr-deeds": " I watched this when I was 14 and did not like it     ",
      "ciao-alberto": "7/10 Needed more pasta     ",
      "under-the-helmet-the-legacy-of-boba-fett": "6/10 \"Why did Boba Fett become so popular? It was a accident\"     ",
      "its-such-a-beautiful-day": "8/10 Neat! I am in severe pain now but neat!     ",
      "winnie-the-pooh": "6/10 Tigger is the Kramer of the Winnie the Pooh universe. I will not elaborate     ",
      "shang-chi-and-the-legend-of-the-ten-rings": "5/10 What zero pussy does to a mf     ",
      "the-simpsons-in-plusaversary": "3/10 Y'know what? Could've been worse     ",
      "a-cars-life-sparkys-big-adventure": "2/10 That's cinema baybee     ",
      "last-night-in-soho": "4/10 For a couple years now, I've considered Edgar Wright to be my favorite director, thanks in no small part to the fact that the man just couldn't seem to miss. Every one of his prior films is absolutely excellent in their own wright, and I couldn't wait to see what he could do with a straight-up horror film for a change.  ...what the fuck happened?  I just found this so tasteless and vile, like, are cheap jumpscares the best way...     ",
      "christine-1983": "7/10 Arnie just fuck the car already     ",
      "the-cabin-in-the-woods": "9/10 Really fucking dope in spite of Joss Whedon's dialogue's best efforts     ",
      "halloween-1978": "7/10 John Carpenter putting the original Thing on a TV in this movie only to make his own Thing a few years later is peak foreshadowing     ",
      "the-mitchells-vs-the-machines": "8/10 WHY IS SONY PICTURES ANIMATION SO GOOD AT MAKING MOVIES NOW     ",
      "arthur-christmas": "8/10 This is the only kids movie I've seen that references the Cuban Missile Crisis and that's how you know it's good     ",
      "hotel-transylvania-3-summer-vacation": " There was a Kraken that sang a musical number and it reminded me of Tamatoa     ",
      "hotel-transylvania-2": " Wouldn't it be funny if I just never reveal my opinion on any of these movies until the Sony ranking comes out     ",
      "hotel-transylvania": " Who gives a shit what I think about this movie? SORA IS IN SMASH     ",
      "squid-game": "9/10 Aw hell yeah I love Splatoon     ",
      "who-framed-roger-rabbit": "8/10 Haha WHAT is this movie? How were they even allowed to make it? How were you guys allowed to watch this as kids? Haha great stuff     ",
      "dear-evan-hansen": "2/10 Fucking reprehensible. It will win 10 Golden Globes     ",
      "jaws": "7/10 Reminds me of Shark Tale (2004)     ",
      "goosebumps-2-haunted-halloween": "5/10 I liked the parts where Jack Black     ",
      "goosebumps": "7/10 Actually kinda fun ngl     ",
      "peter-rabbit": "6/10 Pretty fun movie actually. I really enjoyed the protagonist and thought the actor did a great job. His attempts to defeat the villain were also super fun, mostly because of how delightfully hatable said villain was. I guess playing irredeemable unlikable twats, like the borderline terrorist rabbit in this movie, is just one of James Corden's natural gifts.     ",
      "wish-dragon": "6/10 Everyone: \"You should review Wish Dragon, it's definitely not an Aladdin ripoff!\"  Me: \"Ok but consider this: it definitely is\"  I still liked it tho     ",
      "the-angry-birds-movie-2": "7/10 If this was anything other than an Angry Birds sequel it would have a 3.9 average     ",
      "open-season-scared-silly": "3/10 I have officially watched 13 of the 26 Sony Animated movies. Exactly half of the ranking is in place.  This movie is currently one of the top 5 best ones.  Yeah.     ",
      "open-season-3": "1/10 Make it stop     ",
      "open-season-2": "2/10 This is the hardest I've ever seen Joel McHale act     ",
      "open-season": "4/10 It could have been worse     ",
      "lake-michigan-monster": "9/10 If the movies Hollywood put out had even an ounce of this film's creativity, the film industry would be in a pretty good state. Drop whatever you're doing right now and watch this.     ",
      "surfs-up-2-wavemania": "1/10 Fuck you you fucking piece of shit fuck fuck fuck     ",
      "surfs-up": "8/10 Wait what the fuck why is this movie so great     ",
      "smurfs-the-lost-village": "2/10 First of all, Papa Smurf didn't create Smurfette. Gargamel did. She was sent in as Gargamel's evil spy with the intention of destroying the Smurf village. But the overwhelming goodness of the Smurf way of life transformed her. And as for the whole gang-bang scenario - It just couldn't happen. Smurfs are asexual. They don't even have reproductive organs under those little white pants. That's what's so illogical, you know, about being a Smurf. What's the point of living... if you don't have a dick?     ",
      "the-pirates-in-an-adventure-with-scientists": "8/10 Me: \"So this is the movie where the 'Well yes but actually no' line is from, right?\"  The movie: \"Well yes but actually no\"     ",
      "the-smurfs-2": "2/10 Kill yoursmurf 2     ",
      "the-smurfs": "2/10 Kill yoursmurf     ",
      "the-star-2017": "2/10 Why does the baby Jesus in this movie look like the Boss Baby     ",
      "cloudy-with-a-chance-of-meatballs-2": "7/10 Y'all are really mean to this movie it's cute 😭 I'm gonna go play some Bugsnax now     ",
      "the-emoji-movie": "2/10 At one point one of the main characters says \"Ok, buzzkill\", and at that moment I got down on my knees and prayed to God, thanking Him for the fact that this movie didn't release two years later.  Still better than Cars 2.     ",
      "colossal-2016": "7/10 Was not expecting to be intimidated by Jason Sudeikis of all people today     ",
      "mfkz": "3/10 Who the fuck edited this movie turn on your location I just wanna talk     ",
      "night-of-the-living-dead": "7/10 Old horror movies are so fucking cool man, nothing quite like 'em     ",
      "vivo": "7/10 Much like every Lin-Manuel Miranda project, it could've used less Lin-Manuel Miranda.  ...I did cry at the end tho     ",
      "the-suicide-squad": "9/10 Shoutout to that right-wing dipshit who cancelled James Gunn on Twitter so that we could get this banger AND Guardians 3. That REALLY backfired for them huh     ",
      "ex-machina-2015": "8/10 The main character in the movie looks like I Hate Everything     ",
      "persona-3-the-movie-4-winter-of-rebirth": "9/10 Wow video game movies can actually be phenomenal and adapt their source material perfectly while capturing the intricate and powerful emotions present in the original story now     ",
      "space-jam": "4/10 The Space Jam Duology > The Blade Runner Duology     ",
      "before-midnight": "9/10 Ouch   Is this the best trilogy of all time cause it might be      ",
      "before-sunset": "10/10 Hey wtf I believe in love now     ",
      "before-sunrise": "9/10 Damn I really wanted to see that play with the cow     ",
      "persona-3-the-movie-3-falling-down": "8/10 Wow Makoto and Ryoji are gay now     ",
      "your-name": "9/10    I watched this a few years back and thought it was good, but now that I \"\"\"\"\"\"\"\"\"\"\"\"like\"\"\"\"\"\"\"\"\"\"\"\" anime I figured I'd rewatch it. And yeah, it's phenomenal. Manages to blend a number of genres and concepts together while remaining cohesive throughout. I could nitpick some of the logistics at play here (how did neither of them notice what year it was for the other at any point) but at the end of the day, this is a fun, clever, beautiful film. Anime is good maybe?     ",
      "persona-3-the-movie-2-midsummer-knights-dream": "7/10 Wow Ken is compelling now     ",
      "space-jam-a-new-legacy": "3/10 It was awful and I loved it     ",
      "persona-3-the-movie-1-spring-of-birth": "6/10 Wow Junpei is tolerable now     ",
      "bo-burnham-make-happy": "8/10 Ended up writing and deleting a long-ass paragraph about how guilty and pathetic I feel for being unhappy with my moderately successful life. The bottom line is, Bo understands and conveys this feeling better than any performer I've ever seen. I can't wait to finish his back catalog of specials.  And good Lord would it kill them to make Pringles cans a little wider     ",
      "synecdoche-new-york": "10/10 Charlie Kaufman movies are really cool because they make you sob uncontrollably and regret all your life choices and also there's a silly man sleeping in the basement of a house that's on fire. That's not a good place to sleep, sillyhead!     ",
      "summer-wars": "7/10 anime     ",
      "black-widow-2021": "7/10 Makes some truly incomprehensible editing decisions in its first act but gradually gets better as it goes along. Fun characters, neat action, I had a good time with it. I also probably don't have enough to say about it for a video review oh well     ",
      "howl-from-beyond-the-fog": "6/10 Very cool and atmospheric, though I think the expressionless puppets held it back for me and prevented me from getting truly invested. I'd love to see a higher budget (and perhaps feature length) version of this with stop motion animation that allows the characters to have actual facial movement     ",
      "creature-from-the-black-lagoon": "4/10 I guess I just don't like G-rated horror movies devoid of interesting characters that abruptly end out of nowhere after blasting siren noises in my ears for 80 minutes and calling that a \"score\"     ",
      "earwig-and-the-witch": "2/10 At least Cars 2 had the decency to finish its story.     ",
      "when-marnie-was-there": "9/10 Beautiful. Too bad Ghibli never made any more movies after this. None whatsoever.     ",
      "the-tale-of-the-princess-kaguya": "10/10 I didn't even know movies could be this good.     ",
      "the-wind-rises": "6/10 God bless him, Hayao really loves his planes. I wish I did too.  Reminds me a lot of First Man, in the sense that it's an extremely well-made and well-directed biopic with a subject matter I couldn't care less about and couldn't get emotionally invested in no matter how hard I tried. The story picks up in the second half and the ending is good but this isn't something I intend on ever revisiting.  Did it deserve the Oscar over Frozen? Fucking obviously.     ",
      "the-secret-world-of-arrietty": "7/10 Just found out after the fact that there's a British dub featuring Saoirse Ronan AND non-Westernized character names and I'm so pissed I didn't watch that version instead     ",
      "tales-from-earthsea": "3/10 Worse than I expected tbh. An agonizing failure at worldbuilding with the dullest characters and story to ever be featured in a Ghibli film. Hilariously lifeless direction. Princess Mononoke had more levity than this trash. I wanted it to be over from the 15 minute mark and it just kept going for an eternity. To be fair Willem Dafoe is good in it.  I feel bad for Goro Miyazaki; like, he clearly wasn't ready to take on a feature film...     ",
      "howls-moving-castle": " Saw Howl's Moving Castle.     ",
      "the-cat-returns": "7/10 I 100% didn't want to marry a cat 5 seconds ago but now that I know this cat is cool? Damn ok I'll consider it     ",
      "spirited-away": "10/10 It's Spirited Away what the hell else do you need to know     ",
      "little-miss-sunshine": "8/10    I was already thrown for a loop when Bryan Cranston showed up for 1 minute but then Hank Schrader shows up out of nowhere too...sussy baka     ",
      "the-truman-show": "10/10 The most fun and lighthearted horror movie ever made     ",
      "in-the-heights": "7/10 The tradition of Lin being the worst singer in every musical he writes is still going strong I see  Top notch direction, performances, cinematography, energy, all that jazz. One of the best movie-to-musical adaptations in years. But MAN do they make some changes that undermine some of the best emotional moments in the original musical, and MAN am I mad about that.     ",
      "my-neighbors-the-yamadas": "7/10 Not quite as good as My Neighbor Totoro but still a worthwhile entry in the My Neighbor Cinematic Universe (MNCU)     ",
      "bo-burnham-inside": "10/10 I'm pretty new to Bo Burnham's work but the fact that he managed to treat me to a captivating rock opera odyssey without ever leaving his room is just...beyond incredible. I'm speechless     ",
      "princess-mononoke": "9/10 Nintendo really went and based the entirety of Breath of the Wild around this movie huh     ",
      "pom-poko": "6/10 Y'all gonna kill me for this but I liked Over the Hedge better     ",
      "enchanted": "8/10 Nathaniel do be a simp tho     ",
      "perfect-blue": "10/10 What the actual fuck     ",
      "the-lobster": "8/10 This was an extremely smart, tightly-written, borderline perfect movie for about the first 75% of its runtime. But that last 25% was...kinda clunky? And didn't make great use of this incredibly creative premise all that well? And the score got really repetitive after a while?  It's still a great movie, but it's always a little disappointing when it seems like you've got a new all-time favorite on your hands and instead you're left with just a regular great movie. If the first act was the weak part, I might be singing a different tune. But still, pretty great overall     ",
      "ocean-waves": "3/10 This fucking sucks     ",
      "a-matter-of-loaf-and-death": "7/10 How many businesses do these mfs have     ",
      "a-close-shave-1995": "8/10 Shaun the Sheep getting into Super Mario Maker despite originating in a Wallace and Gromit short is like how Persona got into Smash Bros despite being a Shin Megami Tensei spinoff. In this essay I will     ",
      "the-wrong-trousers": "10/10 Wallace not recognizing the penguin until he took off his chicken hat has extreme Dr. Doofenshmirtz energy     ",
      "a-grand-day-out": "8/10 Note: Wallace and Gromit died on the way back to their home planet :(     ",
      "only-yesterday": "9/10 I've only seen two of his movies so far and I'm already prepared to declare Isao Takahata one of the greatest writer/directors in animation history     ",
      "nobody-2021": "6/10 It's always rough when movies end just as they start getting good. Cool to see Christopher Lloyd again tho     ",
      "the-7th-voyage-of-sinbad": "7/10 Yo when Temuera Morrison lost his lamp I was literally crying and shaking     ",
      "shrek-the-musical": "4/10 These stars are for Lord Farquaad and nothing else     ",
      "little-shop-of-horrors": "8/10 I've always championed this as the one movie adaptation of a musical that actually improved upon the original stage version, but after rewatching it for the first time in forever, I'm not so sure that's true. I think I was just taken in by the best puppet effects ever put to film and the insanely incredible \"Mean Green Mother from Outer Space\" song to notice how many songs that contribute crucial story and character beats were cut. It's not like...     ",
      "road-house": "4/10 Extremely boring but I liked when the guy shot at the falling polar bear statue instead of just, y'know, moving out of its way     ",
      "shazam": "9/10 I can't believe they got Sans Undertale to play the villain in this movie     ",
      "paddington-2": "10/10 I was gonna give it a 9/10 but that last shot before the credits...fuck it 10/10. It may not be the single greatest movie ever made, but I can think of nothing else that deserves the title of \"best-reviewed film of all time\" more than this.     ",
      "paddington": "7/10 Paddington!     ",
      "jesus-christ-superstar": "7/10 This movie is goofy as sin in so many ways, and while it works for certain songs (Simon Zealotes, Herod's Song, etc.), it really betrays the tone in other areas. Nothing quite like getting wrapped up in the drama of Judas receiving his silver pieces for betraying Jesus, only for the film to suddenly cut to jet planes flying overhead. It's...a lot, but it is, at the very least, consistently entertaining with a fairly good balance of humor and drama. Happy Good Friday my fellow Greeks!     ",
      "the-wizard-of-oz-1939": "9/10 Yeah it was good but it's no Phineas and Ferb Season 2 Episode 56 \"Wizard of Odd\"     ",
      "the-muppet-movie": "6/10 These Muppets gave a woman a severe allergic reaction to get an audition, they don't fuck around     ",
      "house": "8/10 Not a single creative decision was questioned by anyone during the making of this movie, and that's exactly why it's so great.  (Also William told me I had to watch The Muppet Movie before watching this movie. Fuck you William I do what I want)     ",
      "streets-of-fire": "7/10 Willem Dafoe? More like Willem \"DA FOE\" :O  (this is my worst review of all time)     ",
      "shiva-baby-2020": "7/10 Loved the sheer fucking chaos of this movie, I only wish it would have built up to something more climactic by the end. But overall, super fun time     ",
      "chaos-walking": "3/10 There sure was a lot of chaos and walking     ",
      "whiplash-2013": "8/10 Surprised I never checked this out before, it's a neat little watch! It's cool to see this prototype version of a scene from the film that surprisingly has most of the same dialogue intact. It also made me appreciate the lighting, editing, and especially Miles Teller's performance in the film even more cause this kid...ain't that great     ",
      "the-father-2020": "8/10 Man, fuck Paul     ",
      "the-trial-of-the-chicago-7": "8/10 I was expecting to be bored out of my mind but this was honestly really engaging from start to near-finish. Top notch editing and the direction isn't nearly as bad as everyone on here is saying. Rylance steals the show amidst the excellent stacked cast. I think a couple of Sorkin's lines are too Sorkin-y for their own good, and it ends on an extremely bizarre and out-of-nowhere note, but overall, a highly enjoyable film.     ",
      "minari": "9/10 Intimate and gorgeous. I was a bit iffy on the score, but otherwise, one of the best slice-of-life films I've seen in ages. I hope it gets all the Oscars, but even if it doesn't, it got my heart. And that's all that matters.     ",
      "twisted-the-untold-story-of-a-royal-vizier": "9/10 Oh this is on Letterboxd? Cool.  ...  ...HE FUCKED A TIGER     ",
      "grave-of-the-fireflies": "9/10 I'm struggling to think of any other movie that eviscerated my heart quite like this one.     ",
      "promising-young-woman": "7/10 This movie's pretty neat!   I wish the ending wasn't terrible tho!     ",
      "looper": "8/10    GOT HIRED TO KILL MY FUTURE SELF (NOT CLICKBAIT)!!!     ",
      "the-goddess-of-spring": "6/10 Not to imply unoriginality, but this does remind me of Cuphead 🤔     ",
      "el-camino-a-breaking-bad-movie": "7/10 Just finished the series for the first time and immediately watched this afterwards.   I know that whole \"name a character that suffered more, I'll wait\" thing is a big funny haha meme, but honestly. Name a character that suffered more than Jesse fucking Pinkman. I...really needed this.   Todd is so weird lmao     ",
      "judas-and-the-black-messiah": "9/10 Fuck, man. What else is there to say?     ",
      "nausicaa-of-the-valley-of-the-wind": "7/10 I liked when the big meatball man shot all the spaghetti tongued bugs     ",
      "star-wars-the-clone-wars": "4/10 If you have any attachment to Ahsoka's character whatsoever, don't rewatch this movie.     ",
      "ace-attorney": "6/10 While extremely faithful to the original game in terms of its tone, look, and storyline, I feel like the most of the game's character work was lost in translation. The condensed time spent with these characters means the loss of some great character arcs for Phoenix, Maya, Edgeworth, and Gumshoe. I feel like I barely know who these people are, since the plot is always the focal point of the film and there's little time to breathe.  Coming fresh off...     ",
      "the-muppets": "9/10 I threw up a little when I saw the Cars 2 billboard     ",
      "gotti": "10/10 Alright guys I reviewed Gotti you can stop asking(I have not seen Gotti)     ",
      "the-croods-a-new-age": "7/10 Heartbreaking: the worst movie you know just had a great sequel     ",
      "anastasia-1997": "7/10 The villain was entirely pointless to the story but on the other hand In The Dark of the Night is a banger, do you see the dilemma I'm in     ",
      "atlantis-the-lost-empire": "9/10 I can't believe how amazing this movie is.  Then again, these are the directors behind Beauty and the Beast, Hunchback of Notre Dame, and The Madagascar Penguins in a Christmas Caper, so I can't believe I didn't expect this to be amazing.     ",
      "never-rarely-sometimes-always": "9/10    A film that manages to say so much by explicitly saying very little. A mastercraft in terms of how to tell a story through subtext and silence, complete with illuminating performances and direction.  After the scene with the dog, I feel like it became clear that Autumn's father was the father of her child, and I kept waiting for that gut punch scene where she would explicitly tell someone this. But it never came. And that's perfect. Because it really...     ",
      "ratatouille-the-tiktok-musical": " Wtf who put this on Letterboxd     ",
      "the-secret-of-kells": "6/10 Absolutely enchanting animation, but it feels like an unfinished beta version of Song of the Sea and Wolfwalkers. Easily Cartoon Saloon's weakest film, but not a bad start for the studio by any means.     ",
      "bolt": "5/10 If the main character was voiced by Adam West it would've been good     ",
      "meet-the-robinsons": "7/10 This movie had no business being as funny and clever as it was     ",
      "the-breadwinner": "8/10 Damn these Cartoon Saloon movies for being insanely good and flying under my radar for the past decade     ",
      "ma-raineys-black-bottom": "8/10 I hope they cleaned that piano in the rehearsal room     ",
      "feels-good-man": "10/10 The most uncomfortable and uplifting viewing experience of 2020. An absolutely gut-wrenching account of the ongoing battle against hatred and the horror of seeing your creation spiral out of control and become unrecognizable. Gonna be thinking about this one for a long time.     ",
      "wolfwalkers": "8/10 This movie has the most weirdly inconsistent animation I've ever seen, there are some scenes that are straight-up some of the most gorgeous things I've ever witnessed, and then others where the character designs look like parodies and I can't tell what the focal point of the shot is supposed to be  But it was great otherwise so go watch it     ",
      "the-madagascar-penguins-in-a-christmas-caper": "8/10 \"There he is! He just went to bed.\"  (lifts covers)  \"What the?! WHAT HAVE YOU DONE WITH PRIVATE?\"     ",
      "wonder-woman-1984": "5/10 The Mandalorian touches a lot of people through the Make-a-Wish Foundation.     ",
      "soul-2020": "8/10 A more intellectual and artistic take on the same concepts that Inside Out and Coco tackled. I feel like these three movies make for a pretty interesting thematic trilogy, and while I think this might be the slight weakest of the three, it's nonetheless another hit for a fairly hit-or-miss studio these days.     ",
      "brother-bear": "4/10 Disney stop turning POC into animals challenge     ",
      "dinosaur": "2/10 Literally the most boring movie I have ever seen in my life     ",
      "fantasia-2000": "8/10 The toy soldier segment kinda blew, as did some of the celebrity hosts, but hot damn the rest of this was incredible     ",
      "song-of-the-sea": "8/10 I wanted to watch Wolfwalkers but Apple TV Plus declined my credit card :(  This is good too :)     ",
      "fargo": "8/10 I really, REALLY, wanted to punch William H. Macy's character in the face the whole movie     ",
      "mank": "8/10 Why the fuck is no one talking about the fact that Bill Nye the Science Guy played Upton Sinclair in this movie     ",
      "a-charlie-brown-thanksgiving": "9/10 I fucking love watching Snoopy get bodied by that folding chair every Thanksgiving     ",
      "treasure-planet": "6/10 John Silver is honestly way too interesting and well-written of a character for this movie  Doppler and Amelia seemed potentially interesting, cool of the movie to forget they exist and shove them into a forced rushed side romance  The only way I can imagine a character as annoying as B.E.N. working is if he was voiced by the guy who voices Master Shake/Gazpacho  Mr. Arrow was not the impostor  I have nothing but respect for Ron and John but I can't believe THIS was the passion project they desperately wanted to make for nearly 20 years     ",
      "cloudy-with-a-chance-of-meatballs": "8/10 Imagine being lactose intolerant and it just fucking rains ice cream. That's like acid rain. Fuck you Flint Lockwood for not taking food allergies seriously     ",
      "what-we-do-in-the-shadows": "8/10 WE'RE 👏 WEREWOLVES 👏 NOT 👏 SWEARWOLVES 👏     ",
      "the-iron-giant": "7/10 From a purely directorial standpoint, this has all the hallmarks of Brad Bird's signature genius. It's also pretty solid emotionally with some excellent animation to boot. I really wish I could join the rest of y'all in saying it's a 10/10 masterpiece, but much like HTTYD2, I just have a ton of story and character problems that piled up over time.   The villain is a horrendously embarrassing and annoying dipshit, the mother is sidelined incredibly hard, the beatnik guy is...     ",
      "the-meyerowitz-stories-new-and-selected": "9/10 I think Noah Baumbach has become my favorite screenwriter; his movies capture the complexity and messiness of relationships so effortlessly, be they friendships, marriages, or in this case, parental bonds (or lack thereof). There's a whole lot of truth in this script and these performances, and the film choked me up on more than one occasion.  The first half of the film is basically flawless but the second half loses the snappy, nonstop compelling dialogue in favor of slower, less interesting shenanigans and a really awkwardly edited fight scene. Couldn't really decide when to end either, but overall, another excellent entry in Baumbach's amazing repertoire.     ",
      "dr-strangelove-or-how-i-learned-to-stop-worrying-and-love-the-bomb": "9/10 The sexual tension between President Muffley and Premier Dimitri tho     ",
      "the-lighthouse-2019": "10/10 The closest thing we'll get to a modern-day 2001: A Space Odyssey.  Robert Eggers has given us an absolutely mesmerizing piece of art that begs to be interpreted in a number of ways. I couldn't tell what the hell it meant while I was watching it, and from the sound of things, neither could the other 20-somethings I left the theater with. This is not a film that will appeal to everyone; not in the slightest.  And yet, even though...     ",
      "borat-subsequent-moviefilm": "8/10 THAT LAST TWIST THO HOLY FUCK  Not quite as hysterical as the first, but it makes up for that by being actually kinda solid emotionally? And the fact that this storyline was constructed in real time during the pandemic is actually kind of mind-blowing. It's just so nice to get a belated sequel that works as a perfect continuation and companion piece to the original for a change.     ",
      "borat-cultural-learnings-of-america-for-make-benefit-glorious-nation-of-kazakhstan": "8/10 Probably includes the funniest fight scene ever put to film     ",
      "once-upon-a-snowman": "4/10 End my suffering     ",
      "sing-street": "9/10 John Carney's progression as a writer/director is really exciting to watch; this is a tremendous step up in every way from the earnest but mediocre Once. It's an absolute overload of charm from beginning to end and it's ridiculously hard to dislike. I mean this boy just made up an entire band out of nowhere just to impress this one girl, that's some r/madlads shit     ",
      "ratatoing": "3/10 A dense political thriller filled with thought-provoking social commentary and an explicit critique of capitalism and monopolistic business practices.  It was unironically better than Cars 2.     ",
      "persona": "8/10 This movie didn't even have a rowdy group of teenagers reforming society by stealing hearts, what a ripoff     ",
      "se7en": " Due to an overwhelming amount of people screaming at me in the comment section whenever I dare to give a supposedly mediocre movie a higher score than Se7en, I have now removed my score for Se7en in order to cut down on spam in my comment sections. Sorry for not liking your boring cop movie that only becomes great in the last 20 minutes.     ",
      "high-school-musical-2": "6/10 24 Frames of Nick is gonna kill me for this     ",
      "robots": "6/10 Fender is canon trans :)     ",
      "coco-2017": "8/10 Kinda flawed in the story department in a lot of ways but I honestly don't care. This is a beautiful love letter to Mexican culture and a great musical to boot. The characters are super endearing and the complex interwoven backstory holds up so well on repeat viewings. It also has the best ending of any Pixar film, period.     ",
      "finding-dory": "7/10 This is easily the best non-Toy Story Pixar sequel but y'all aren't ready for that conversation     ",
      "lava-2014": "8/10 Those two volcanoes banged and gave birth to Te Fiti. This was all a prequel to Moana     ",
      "cars-2": "2/10 I take back every mean thing I ever said about Shrek the Third. And The Good Dinosaur. And Turbo. And MINIONS. Fuck you John Lasseter     ",
      "cars": "5/10 In my junior year of high school we had to watch this movie in health class and write a paper on Lightning McQueen's character growth and how he forms healthy relationships with the people around him over the course of the movie. So that was fun     ",
      "once": "6/10 I'm definitely missing something here cause this didn't work very well for me at all. It leaves a terrible first impression with the cinematography at the beginning, but that aspect improves as the film goes along (even if the flat lighting doesn't). The bigger issue for me is how the script feels entirely barebones, rendering the story and romance very basic and unengaging. I don't feel a particularly strong connection between the main characters and I don't feel like I...     ",
      "being-john-malkovich": "7/10 Honestly fuck Maxine, Lotte deserves so much better     ",
      "im-thinking-of-ending-things": "10/10 Every single line of dialogue in this movie is entirely deliberate, a piece of an exceedingly intricate puzzle that you slowly start to piece together over the course of the film's runtime. Shockingly, at no point does it become tedious, repetitive, or boring. It's a genuine thrill to see how even the most mundane conversation can be warped into something far more important and meaningful over time.  I can't even begin to process how deeply this movie affected me. I...     ",
      "mulan-2020": "1/10 Fucking worthless. It strips the original film of nearly everything that made it special, but forgets to add anything worthwhile as a substitute. It is inferior to the original in literally every respect. If that's not enough, it also contains the most fucking abysmal editing I've ever seen in a major motion picture. I'm baffled that Disney considered this theater-worthy for the longest time, and doubly insulted that they have the gall to charge $30 for such an irredeemably awful pile of garbage. A new low for the Disney live-action remakes.  But at least it's better than Artemis Fowl.     ",
      "almost-famous": "9/10 \"Rock stars have kidnapped my son.\"  Not just a highly entertaining movie, but a visceral, palpable experience. A movie that feels entirely authentic in spite of its larger-than-life characters. A real treat of a film that I can't wait to see again.     ",
      "toy-story-2": "10/10 Great comedy, strong dramatic touches, a really engaging central conflict, a ton of character depth...this is the bestest one     ",
      "inside-llewyn-davis": "8/10 Llewyn: \"Hey, Mr. Turner, I'm wondering. Would that cane fit all the way up your ass, or would a little bit stay sticking out?\"  Mr. Turner: \"What the fuck did you just fucking say about me, you little bitch? I'll have you know I graduated top of my class in the Navy Seals, and I've been involved in numerous secret raids on Al-Quaeda, and I have over 300 confirmed kil     ",
      "chef": "9/10 The scene where all the main characters poured cornstarch on their balls was a little weird but other than that it was fantastic!  ...that sounds like a joke but I promise you that is a real thing that happens in this movie     ",
      "phineas-and-ferb-the-movie-candace-against-the-universe": "8/10 Can't believe this movie finally gave Jeremy a personality trait     ",
      "trolls-world-tour": "3/10 K-Pop trolls imply the existence of Troll Korea     ",
      "abominable-2019": "6/10 This was really excellent for like 25 minutes and then it just turned into a worse version of Up     ",
      "how-to-train-your-dragon-the-hidden-world": "9/10 This is the best one. A truly moving story about a world unable to adapt to change despite the best efforts of those who try to champion peace. Entire sequences are carried by the score, much like the first film. The character dynamics are incredibly strong, the animation is flat-out insane, the villain is a significant improvement over the last movie, and this is the first one of these movies to make me cry. An absolutely perfect ending to what is easily the best animated trilogy of all time.     ",
      "the-boss-baby": "2/10 Everything I wanted it to be and more     ",
      "trolls": "4/10 Bro why do you need to autotune Justin Timberlake, he's JUSTIN TIMBERLAKE JUST LET HIM SING NORMALLY     ",
      "home-2015": "5/10 I'm impressed, this wasn't terrible!  It also wasn't good!     ",
      "mr-peabody-sherman": "8/10 Cannot believe I liked this movie as much as I did     ",
      "turbo": "2/10 We have officially reached the \"let's just get this over with\" phase of the DreamWorks marathon. This was truly fucking agonizing. Every character, relationship, and story beat feels artificial and hollow. Even the racial stereotypes from Shark Tale are back in full force. It's a completely worthless experience; basically, the DreamWorks equivalent of The Good Dinosaur. Gonna go rewatch Ratatouille to wash the taste of this piece of shit out of my mouth     ",
      "the-croods": "5/10 GRUG MOMENT  Can't believe this is getting a sequel and not Rise of the Guardians smh     ",
      "madagascar-3-europes-most-wanted": "4/10 I like to move it move it out of the theater after the first 20 minutes are over cause wow the movie goes downhill hard     ",
      "puss-in-boots": "6/10 \"Mom, can we get Rango?\"  \"We have Rango at home.\"  Rango at home:     ",
      "into-the-unknown-making-frozen-ii": "8/10 It's probably a bad sign when the behind-the-scenes documentary is more consistently entertaining than the movie, right?     ",
      "mistress-america": "8/10 Ok but seriously where is Karen's husband? I'm getting very concerned  Little bit messier than the typical Greta/Noah project; the pacing is kinda all over the place and I feel like some extra scenes to flesh Brooke out more would be welcome. However, this movie picks up the slack with its constant witty dialogue and great scene blocking. I had a great time, even though this movie didn't quite hit me with the same relatable feels as Frances Ha     ",
      "a-silent-voice": "9/10 What does it mean to live with your mistakes?  What does it mean to feel remorse?  What does it mean to want to make things right?  Can you ever really make things right?  Will anything ever take away the shame?  The pain?  The remorse?  You lost a piece of yourself all those years ago.  Will this finally fill the hole?     ",
      "monsters-vs-aliens": "5/10 Tall Girl     ",
      "howard-2018": "8/10 Really touching tribute to an artist we lost far too soon. There's not much available footage of his pre-Little Shop life, which makes the front end of the documentary less engaging than it should be, but it's worth it to see the inspiring, tragic story of his life's work.     ",
      "bee-movie": "5/10 Such a bizarre movie conceptually, but it's kinda boring in its execution. The plot is haphazard but it's not Shark Tale levels of hilariously incompetent so there's not a ton of ironic enjoyment to be had. Patrick Warburton is the best part but that goes without saying     ",
      "airplane": "7/10 I feel like we don't talk about the lady who fucked a horse enough     ",
      "spirit-stallion-of-the-cimarron": "8/10 Why does nobody talk about this one it's SO GOOD  ...ok the Matt Damon narration and pop songs really bite but THE REST OF IT IS SO GOOD     ",
      "chicken-run": "6/10    Are we just not gonna talk about the fact that Mr. Tweedy murdered his wife     ",
      "taxi-driver": "7/10 The first 40 and last 30 minutes are pretty much perfect, but for some reason those middle 40 minutes, in-between the cab ride with Scorsese and the scene where Travis talks to Iris, feel incredibly dull and aimless and I can't figure out why. I'm glad nobody else seems to have this problem at least     ",
      "groundhog-day": "8/10    Phil spending an entire day making as many people happy as humanly possible is literally just me on my final 3-day cycle before I fight the final boss in Majora's Mask     ",
      "hamilton-2020": "10/10 It was neat     ",
      "the-prince-of-egypt": "10/10 I mean this is basically the best animated film ever made     ",
      "antz": "6/10 I am entirely baffled by nearly every single aspect of this film.   But I think I enjoyed it?     ",
      "shrek-the-third": "2/10 There is actually no reason to watch this     ",
      "drive-2011": "4/10 Y'all are gonna hate me for this but I can't remember the last time I was simultaneously this bored AND turned off by unnecessary gratuitous gore. Elevator scene slaps tho     ",
      "uncut-gems": "9/10 The best live-action Shark Tale remake I could ask for     ",
      "artemis-fowl": "1/10 The most insulting adaptation since The Last Airbender. An absolutely worthless piece of dogshit that sucks every compelling element out of an incredible book series and deforms it into an unrecognizable pulp. Every character is uninteresting, every directorial choice is incomprehensible, every scene is indescribably awful in its own unique way. Avoid this movie at all costs, especially if you have even the slightest attachment to the original source material.     ",
      "shrek-2": "9/10 Legitimately one of the best sequels ever made, building upon everything that made the original movie special, while adding its own signature flavor to the franchise. Prepare to feel an unexpected feel.     ",
      "far-far-away-idol": "10/10 Fuck it 5 stars     ",
      "heathers": "6/10 Stilted and awkward in a lot of ways; while it does tell a compelling story and offer a handful of great quotes, it does it with such little energy and poor pacing that it's really hard to get invested.  I should mention that I'm a massive fan of Heathers the Musical, which takes the elements of this film that work and really goes all out in crafting an outrageous, tense, compelling comedy-thriller. This film is more of a novelty as...     ",
      "eternal-sunshine-of-the-spotless-mind": "9/10 Wish I could erase this film from my mind just so I can watch it for the first time all over again     ",
      "logan-2017": "9/10 Imagine thinking this isn't the best superhero movie of the 2010s lmfao     ",
      "unbreakable-kimmy-schmidt-kimmy-vs-the-reverend": "9/10 Everything I could've hoped for and more. Unironically better than Bandersnatch. It helps that I'm a huge fan of the show already, but I feel like even if you're not, you'll still have a ton of fun with it. Give it a playthrough or five     ",
      "ratatouille": "10/10 The polar opposite of Happy Feet: a rich, intelligent, funny, thought-provoking masterpiece. This is the most underrated Pixar film by far and one of my Top 3 Pixar favorites. It genuinely feels like a smart indie film made for adults, which again, is a testament to Brad Bird's ingenious writing. I will never get tired of revisiting this movie.     ",
      "flushed-away": "7/10 Simon Pegg and Nick Frost really let themselves go     ",
      "rise-of-the-guardians": "7/10 Pretty good but the villain sucks ass. It looks like a car ran over his face. How did his design ever get approved. I expect much higher quality character design from the studio behind Shark Tale     ",
      "over-the-hedge": "7/10 Fun fact: the animals in this movie do not, in fact, go OVER the titular hedge. They go THROUGH it. I hope someone got fired for that blunder     ",
      "star-wars-the-rise-of-skywalker": "5/10 Starts out pretty fun but gets infinitely worse the longer it goes on. There are no characters in this movie; just action figures that are whisked from planet to planet in an excessively manic story that feels like it was written by an 8-year-old. Palpatine sucks ASS in this movie. Everyone other than Rey and Kylo pretty much sucks. It rings hollow, far more than any Star Wars movie that came before it.  And yes, The Last Jedi was better....     ",
      "her": "8/10 I didn't like this movie when I was 15 and I think I was just an idiot back then because this is really great. Very smart screenplay that showcases Theodore's loneliness and Samantha's insecurities in increasingly profound and sad ways.  I just...don't really care for the last arc of the movie? It doesn't feel very well set up and it didn't really hook me emotionally like the rest of the film. Still, it's really touching and I'm gonna go punch 15-year-old me in the face for saying otherwise     ",
      "phineas-and-ferb-star-wars-2014": "9/10 Legitimately the best Star Wars movie since the Disney purchase     ",
      "a-goofy-movie": "8/10 \"On The Open Road\" walked so \"Another Day of Sun\" from La La Land could run     ",
      "do-the-right-thing": "9/10 God, I'm overwhelmed by just about everything in this movie. The writing. The performances. The cinematography. EVERYTHING.  There are some slow patches here and there, but those are easy to overlook when you take into account how masterfully this film sets up its pieces over time only to knock them all down in one enthralling, breathtaking final act.  Fuck, man. THIS is a movie.     ",
      "kikis-delivery-service": "9/10 Don't really have much to say. It's just cute. :)     ",
      "maggie-simpson-in-playdate-with-destiny": "7/10 Better than the movie it was bizarrely stapled to     ",
      "onward-2020": " Looks like another step in the right direction for Sony Pictures Animation :)     ",
      "knives-out-2019": "9/10 Rian Johnson subverted my expectations except it was good this time  Absolutely brilliant deconstruction of the murder mystery genre. Hardly anything played out in the way I expected, and I was glued to my seat the whole time. The excellent script, tight direction, and wonderful performances all come together to make such a pretty picture. I would've liked more development for some of the characters, but ultimately, I realize that they aren't the focus of the story. Which is great;...     ",
      "the-peanut-butter-falcon": "5/10 Really charming but also kinda boring with some truly awful shot continuity and confusing character motivations. Also I'm not convinced that Dakota Johnson has ever acted before. Also also, I'm not convinced that Jon Bernthal has ever appeared in a movie for longer than 10 minutes.  But on the plus side, Zack steals every scene he's in. Great performance     ",
      "two-cars-one-night": "7/10 Charming in its simplicity, and striking from a visual perspective. A great opening act for my boy Taika     ",
      "cleo-from-5-to-7": "8/10 This deserved Oscars for Cinematography and also Supporting Actor for the man who ate 3 frogs and projectile vomited     ",
      "sonic-the-hedgehog": "6/10 Crazy Carl's drawing SENT ME     ",
      "the-bakery-girl-of-monceau": "3/10 Effortlessly unlikable     ",
      "coraline": "8/10 The dad in this movie looks like Hugh Neutron mixed with Waluigi     ",
      "hair-love": "9/10 OWWWWWWW MY HEARTTTTTTTT     ",
      "i-lost-my-body": "7/10 I really gotta hand it to this movie     ",
      "ford-v-ferrari": "8/10 I can't decide what's more shocking; the fact that this movie was actually pretty great, or the fact that this is the second Best Picture nominee this year where Tracy Letts plays a stuffy old rich dude who I don't like at first but actually starts to grow on me over time     ",
      "exit-through-the-gift-shop": "8/10 Watched this in film class and my God this is BONKERS. Easily the most insane documentary I've ever seen. Is it real? Was it staged? Who cares?  Thierry Guetta cements himself as the Tommy Wiseau of the art world, and his story is as hilarious as it is thought-provoking. I'm gonna be pondering the nature of art criticism and subjectivity for weeks to come after seeing this. Great stuff.     ",
      "1917": "8/10 This was really good but I could never shake the feeling that I was watching a 2-hour cutscene and never getting a chance to actually play the game.   At least Roger Deakins will be a 2-time Oscar winner now.     ",
      "persepolis": "7/10 Pretty good adaptation of an exceptional graphic novel. It just suffers from an incredibly rushed pace since they're trying to cram a lot of plot into a 90 minute runtime, which deflates a lot of the dramatic weight from certain story arcs. It's still a good, powerful film, but I strongly recommend reading the book first, if possible.     ",
      "kung-fu-panda-3": "7/10 Po had two dads and he turned out fine!  The weakest one, but still pretty good :)     ",
      "kung-fu-panda-2": "8/10 Great sequel that isn't afraid to tell an even more emotionally rich story than its predecessor. It's much slower paced and not nearly as funny, but it shines in its second half and leads to a sensational climax. Ending really made me soft <3     ",
      "kung-fu-panda": "9/10 Wtf why this movie so damn good? It's absolutely stunning from an animation perspective and delivers a story with a surprising amount of emotional heft. Incredible fight scenes, great characters, striking colors, the works. One of the best DreamWorks movies by far     ",
      "marriage-story-2019": "9/10 Absolutely beautiful. Stellar performances all around. Even the kid is pretty good. That argument scene? Couldn't stop crying. That scene towards the end at the pub? Sensational.  I'm not sure if some of the dialogue was quite as tight as I wanted, plus the score is a little overbearing at times (Randy Newman, man. Sigh.), but the actors easily pick up all the slack. Career-best turns from Driver and ScarJo.  Interestingly enough, a ton of people have said they found...     ",
      "how-to-train-your-dragon-2": "7/10 Didn't really get into this one as much, I thought the middle was significantly slow and didn't progress as masterfully as the first. Third act felt rushed in comparison. Wasn't a fan of many choices the characters made. The humor from the side characters was passable in the original but obnoxious here. And the score was a massive step down.   But hey, the main characters were still great and the emotional beats hit extremely hard, maybe even harder than the...     ",
      "how-to-train-your-dragon": "9/10 Wtf why this movie so damn good? It's perfectly paced, incredibly powerful, striking from an animation perspective (save for a poorly rendered character here and there). Why did I never like this as a kid? It's the best DreamWorks movie of 2010, the year that also gave us Megamind and Shrek 4. HOW DO YOU MANAGE THAT OUTPUT OF QUALITY IN THE SAME YEAR. SHARK TALE HAS NO EXCUSE ANYMORE     ",
      "cats-2019": "2/10 This is literally just a typical production of Cats, y'all are overreacting like hell. \"Weirdest movie ever?\" Come on. I'm a theatre kid. I've had weirder shit for breakfast.  That said, Cats is such a shitty musical that a painfully average production of it is still REALLY bad     ",
      "john-wick-chapter-3-parabellum": "8/10    TOP 10 ANIME BETRAYALS FUCK YOU WINSTON  My new favorite in the series.     ",
      "shrek-the-halls": "6/10 Ok but that dancing roast turkey was fuckin dope     ",
      "portrait-of-a-lady-on-fire": "9/10 I guess we're adding the number 28 to the list of things I never expected to emotionally destroy me and send me into a fit of sobbing     ",
      "the-farewell-2019": "6/10 Gonna have to sort this into the \"I don't get the hype\" category of films sadly. It's a really great concept for a story, but it feels thoroughly underdeveloped. I wanted to learn more about who Billi is as a person, get more scenes exploring the cultural differences between America and China, and really see the main conflict and the ethics surrounding it get explored and fleshed out to a greater degree. But the movie just kinda felt repetitive after a while, never quite reaching the dramatic or comedic heights the story really deserved. Sorry, Nai Nai.     ",
      "the-lion-king-2019": "2/10 Fuck     ",
      "pain-and-glory": "6/10    During one of the scenes when he was a kid I literally thought to myself \"What if this is just some random other kid and not actually him?\" AND SHIT I WAS KINDA RIGHT     ",
      "the-irishman-2019": "7/10 The last 90 minutes of this movie are sensational.  The first 2 hours are ok.  I really wish I could join everyone else on the hype train with this movie, but I found much of it overstuffed and messy. The direction and cinematography didn't really stand out. The de-aging effects are a little jarring for the first 30 minutes or so, tho they fortunately blend into the background after a while. And I never really got the decision to solely...     ",
      "star-wars-the-last-jedi": "5/10    (sigh)  PROS-Luke, Rey, and Kylo are all interesting as shit. I'm totally on board with their plotlines, even if Rey getting shafted from the narrative in the climax is a little disappointing. Still, the final showdown between Luke and Kylo is powerful as hell.-The cinematography is stunning. That shot of Luke exiting the base at the end, walking across the red-stained battlefield, is straight up my favorite shot in all of Star Wars.-Great direction and acting all...     ",
      "star-wars-the-force-awakens": "8/10 This movie RULES! It remains just as exciting, impactful, funny, and magical as it was 4 years ago. The New Hope rehashing surprisingly works for me, because the script and direction evoke a very different tone to that of the original Star Wars even though they follow the same plot beats. Sometimes the movie bends a little too far backwards to justify a New Hope parallel (Starkiller Base is the lamest shit ever) but for the most part, I'm really...     ",
      "return-of-the-jedi": "9/10 I like this one better than A New Hope! Phenomenal sets and creatures, the best action of the trilogy, incredibly strong emotion. The fact that Luke doesn't give up on redeeming Vader, even when Obi-Wan and Yoda tell him Anakin is long gone, is immensely powerful.   The Ewoks are hilarious and I don't have much to complain about with them. Jabba slays me with all of his wacky line deliveries. Overall, the humor in this film works surprisingly well, to...     ",
      "rogue-one-a-star-wars-story": "6/10 Overwhelmingly fine. Man, oh man, this sure is a fine movie. Those characters are definitely very fine. The writing reeks of fineness. Oh by gosh by golly the story sure is fine. It's all fine. I had a fine time watching it.  To be fair tho, Krennic and K-2SO are amazing. The last 10 minutes are sufficiently powerful and dramatic. The action is stellar. Fits very snugly into the canon and compliments A New Hope nicely. I understand why this...     ",
      "frozen-2": "6/10 Simultaneously feels bigger and smaller than the first film. I was really invested in the first hour and the mystery it was building up, but then the story kinda fizzled out into nothingness. Really wastes the vast majority of its characters, both old and new. Stakes feel relatively low due to the vagueness of the story. Songs ranged from pretty good to pretty forgettable; nothing awful tho.  I can't decide which one I like better; nothing in this movie angered...     ",
      "frances-ha": "9/10 Love it. A beautiful portrait of a woman trying to find purpose in spite of numerous personal and career setbacks. The use of music to highlight those fleeting moments of happiness and fulfillment in Frances' life was inspired. Black-and-white cinematography didn't seem necessary but it's hard to complain when the film is visually stunning regardless. Gerwig and Baumbach make their voices equally heard throughout the script, and the result is sensational.  Also...I may have a crush on Adam Driver now? More at 11     ",
      "the-matrix": "5/10 Sorry Keanu I don't like this movie all that much. Maybe the sequels will be better     ",
      "klaus": "8/10 A beautifully animated, heartwarming, funny, thoroughly delightful film. Even though the main character is literally just Kuzco     ",
      "dolemite-is-my-name": "8/10 An absolute blast. I had inexplicably never heard of Rudy Ray Moore or Dolemite before watching this, but I kinda want to check out everything he's ever done now. This movie is just a burst of fun and energy anchored by great performances all around, with Eddie Murphy stealing the show in every scene. Plus, as an Unbreakable Kimmy Schmidt fan, Titus Burgess is always a plus.  I got tons of Disaster Artist vibes from this, but I think this...     ",
      "olafs-frozen-adventure": "2/10 5 minutes in I was ready to walk out of the theater and just wait till Coco came out on DVD     ",
      "jojo-rabbit": "10/10 \"What did they do?\"  \"What they could.\"  I sobbed all the way through the credits. I couldn't even begin to compose myself. I was absolutely shaken to my core. And once I was able to find my footing and exit the theater, the first thing I did was buy a ticket to see it again.  Jojo Rabbit is a story of overcoming blind fanaticism and indoctrination, showcasing that monsters aren't born; they're made. They're manipulated. The transition Waititi's Adolf Hitler...     ",
      "phineas-and-ferb-the-movie-across-the-2nd-dimension": "9/10 MASTAPEECE. Should not work nearly as well as it does     ",
      "joker-2019": "7/10 I've never been less enthusiastic to give a 7/10. This movie and the endless media cycle around it has genuinely exhausted me. It's not worth all the hype or fuss, it's just a good standalone movie with a hilariously bad story bolstered by an excellent score, great cinematography, and an intensely committed central performance. Calling it a masterpiece, however, is a bit of a joke.     ",
      "tall-girl": " So then I said to her \"Taylor Swift? More like Taller Swift\" and the entire class laughed. The teacher laughed too and started clapping. Soon the entire school was applauding and the local news came to do a story on me and my amazing joke     ",
      "ralph-breaks-the-internet": "3/10 I can't decide if I hate the movie itself more or I hate what it represents more but suffice to say I hate both of them pretty significantly     ",
      "penguins-of-madagascar-2014": "6/10 This is like Minions except not terrible     ",
      "shrek-forever-after": "8/10 Something tells me I should review this movie...  ...eh, nobody wants to see that probably.     ",
      "the-worlds-end": "9/10 A bit weak comedically, but it's still an incredible, subversive, witty, amazing film. The dramatic stuff here is the best in the trilogy, the stakes are easily the highest, the characters are fun and entertaining. It's a fantastic finish to one of the greatest trilogies ever made, even if it falls ever so slightly short of Hot Fuzz.     ",
      "hot-fuzz": "9/10 A bit of a slow burn at times and those twat side cops are really irritating. But the payoff is beyond phenomenal; this is a fantastic, hilarious murder mystery turned action masterwork, where every line of dialogue can and will come back later in some shape or form. An step up from Shaun of the Dead in terms of tight direction and an even tighter screenplay.     ",
      "shaun-of-the-dead": "8/10 Surprisingly works better for me from a dramatic standpoint than a comedic one. It's still really funny, but I'm also incredibly invested in Shaun trying to repair and come to grips with his relationships in the midst of a zombie apocalypse. Tons of stellar scenes and impeccable direction make this a blast to revisit.     ",
      "madagascar": "6/10 Comedy itself peaked when Melman said \"Guys, we're running out of time\" with a clock stuck to his head     ",
      "mikes-new-car": "9/10 I think it's safe to say this is better than the entirety of Monsters University     ",
      "club-oscar": "1/10 This cosmic dance of bursting decadence and withheld permissions, twists all our arms collectively, but if sweetness can win, and it can, then I'll still be here tomorrow to high-five you yesterday, my friend.     ",
      "megamind": "8/10 Why haven't I logged this yet     ",
      "solo-a-star-wars-story": "6/10 I don't even know what to talk about. I guess I like it? It's mildly entertaining with some great action scenes. L3 is far worse than Jar Jar but she gets blowed up after 20 minutes so it's ok. Donald Glover is having fun with it. But yeah I see no reason to ever watch this movie again     ",
      "the-rescuers-down-under": "5/10 Only watched this one out of moral obligation. A resounding meh. It's not even really worth my time to talk about here, I already wrote its portion of the video script and that's all the thought I need to devote to this film for the rest of my life.     ",
      "once-upon-a-time-in-hollywood": "7/10 Damn Robin from Stranger Things made a really good life choice in this movie  Tonally alien from most of Tarantino's other works, Once Upon a Time in Hollywood plays out more like a loosely connected series of vignettes rather than a flowing narrative. Unfortunately, unlike something like Pulp Fiction, where every segment intersects in some way while the film remains entertaining throughout, this movie feels much less focused and has largely underdeveloped themes and character motivations.  Sharon Tate has nothing...     ",
      "mulan": "7/10 Pretty good. I think it's a really well-told story, but the comedy doesn't always land for me and the villain, while really menacing, is so disconnected from the hero that it's hard to get invested in them. As a musical, this one is kinda weird; there are less songs than usual, which I guess is owed to the more serious, war-like tone. But still, it kinda feels like there's something missing from this one compared to the other Renaissance films.  Also they didn't have to go that hard with I'll Make a Man Out of You but they did and it slaps     ",
      "the-little-mermaid": "9/10 Got a new big video ranking coming! This time, I'll take a look at all the Disney Renaissance films.  THIS ONE IS SO GOOD. Perfect pacing, stunning cinematography, breathtaking animation, vibrant colors, phenomenal songs, great characters. Ursula is such a bad bitch, Sebastian is hilarious, Ariel is really compelling. Seriously I don't remember this movie being this fantastic when did that happen???     ",
      "phantom-thread": "8/10 The first half-hour is pretty slow but after that this movie becomes an absolutely engrossing tale of a couple desperately trying to manipulate each other and gain the upper hand in their relationship. I didn't see many of these plot points coming and I was always on the edge of my seat. It's also surprisingly funny and a great, if unconventional, final role for Daniel Day-Lewis.     ",
      "kubo-and-the-two-strings": "6/10 It's not great, it's not terrible. Some absolutely stunning animation anchors an aggressively predictable and mediocre story with a really annoying side character. It's fine but I really don't anticipate checking it out again     ",
      "spider-man-far-from-home": "9/10 The best live-action Spider-Man by far. Leaps and bounds ahead of Homecoming (and Endgame for that matter). One of the best villains in the MCU. Funny, emotional, trippy, heartwarming. Next-level callbacks. That mid-credits scene HNNNNNNG     ",
      "sauce": "10/10 \"Bitch, you da sauce\" will go down as one of the greatest lines in cinematic history     ",
      "toy-story-4": "7/10 Good movie that never really justifies its existence. The supporting characters are great but they don't have a ton of funny jokes unfortunately. The stakes feel relatively low and a lot of the plotlines could have used more development. I liked it enough but it just barely rises above Finding Dory and Incredibles 2.  Oh, and it's better than the first movie at least. This is a solid 7 while that one is a shaky 7 teetering on 6     ",
      "toy-story": "7/10 It's not really amazing until the last 20 minutes, but man are those last 20 minutes amazing. Woody is an annoying asshole most of the movie, Sid's house is such an unpleasant location, and the animation has aged way worse than I remember. But ultimately the Woody-Buzz dynamic carries this movie pretty far. Still, 2 and 3 outshine it pretty hard.     ",
      "bumblebee": "6/10 Gets worse the longer it goes on but it's mostly really charming and cute. John Cena's line about the Decepticons' name made me belly laugh cause that's exactly what I was thinking     ",
      "hoodwinked": "7/10 Low-key iconic     ",
      "arrival-2016": "7/10 A really intriguing and well-crafted sci-fi mystery. Denis Villeneuve is such a master of his craft that it's truly astounding, and I love how this movie takes its time to establish how difficult it would be to communicate with an alien race. Amy Adams is excellent as always as well. But not every scene felt necessary to me and it kinda dragged on at some parts. Still, one of the better sci-fi films in recent years     ",
      "rocketman-2019": "6/10 While BoRap was one straight line of quality, this film is one of soaring highs and dull lows. Anytime it goes into a musical sequence, it's enthralling with amazing filmmaking and performances. Anytime it isn't, it's...kind of dull? There's some good drama towards the end but for the most part I was just kinda waiting for the next musical number the whole time.  Still better than BoRap     ",
      "booksmart": "8/10 Plays like a mix of Lady Bird and The Nice Guys, which is a surprisingly good combo. So utterly fun and enjoyable with some hilarious characters, great direction, and amazing editing. Some characters could've been set up better and the ending kinda confused me but suffice to say I can't wait to see this again     ",
      "spider-man-into-the-spider-verse": "10/10 I can't think of another movie that genuinely gets better and better on repeat viewings to this extent. Wow.     ",
      "zootopia": "7/10 The Shakira song is laughably terrible but I like this movie a lot otherwise. Great dynamic between the two main characters and some interesting, mature themes for a kids movie. I wish the story was a little more engaging but still very intriguing and fun     ",
      "inside-out-2015": "8/10 Creativity overload, in a good way. The story isn't great and the plot holes are pretty problematic but this movie's so engaging and fun that it doesn't matter. There are so many funny, expressive, heartfelt moments and characters that make this film an absolute Joy to revisit. It's not one of Pixar's absolute best, but it's pretty close.     ",
      "big-hero-6": "5/10 THAT WAS HIS MISTAKE  If it wasn't for Baymax this movie would legitimately bore me out of my mind. It's really lame as a superhero movie and a Disney movie, and I hate T.J. Miller in this sooooooo much. But y'know it's not awful or anything. Just...10 years behind the curve. Actually, scratch that, Pixar made The Incredibles 10 years before this came out so it's more like 15 or 20 years behind.     ",
      "aladdin-2019": "5/10 Half the time it's surprisingly good, well-acted and compelling. The other half it's hilariously incompetent to the point of providing tons of ironic enjoyment. So, I had a good time overall and I don't regret seeing it. It's a little sad that that's the bar I'm judging these live-action remakes on, but there we are.     ",
      "brave-2012": "3/10    Yeah no this is worse than Happy Feet. It's dull, it's predictable, it's a complete embarrassment of a movie. Merida is the most unlikable Pixar protagonist and Disney princess by far, she never gets any comeuppance for turning her mother INTO A BEAR. I hate this movie so much that I don't even want to write about it anymore, it does not deserve a train of thought     ",
      "rango": "7/10 The only Animated Feature winner I never saw before starting this project, I must say that I was absolutely stunned by the animation on this one. The lighting, the character designs, the environments, everything just pops and makes for such an engaging visual experience. I was really bored with the story for the first half hour or so but things really picked up after a while, leading to some truly breathtaking action sequences and genuinely funny moments. This is also...     ",
      "toy-story-3": "9/10 The inverse of Up, where the ending is what's always praised to no end and the rest of the film is kinda forgotten about. The good news is that unlike Up, this is a rich, thoroughly enjoyable story throughout the entire film. I'm a sucker for elaborate prison escapes and this film delivers, complete with a fantastic villain and great jokes. It's not quite as good as 2 but it's still a worthy successor that builds on 2's themes in a beautiful way     ",
      "john-wick-chapter-2": "8/10 A significant improvement from the first, the action is more enticing and the story is more engaging. The two halves of this movie are kinda two different movies, and while the first half is solid enough, the second half is exhilarating and satisfying. I love how well set up the rules of this universe are, to the point where I actually said \"Oh no\" out loud during a certain scene. You know the one.     ",
      "john-wick": "6/10    Took an animation break and watched these movies for the first time. The action here is solid and Keanu is great but I feel like there's way too many conveniences and easy outs for a lot of the characters. Like, John could've just shot the kid at the pool and ended it right there, right? But y'know it's still decent overall     ",
      "up": "7/10 Cute kiddie fluff with an excellent opening and score. Take those out and ehhhhh. Don't get me wrong, Dug is really funny and it's a nice little adventure but it's not really thematically cohesive like Wall-E or Shrek 2. If people could stop calling this the greatest Pixar movie based off of the opening alone that'd be great.     ",
      "happy-feet": "3/10 Astonishingly bad. There is no story structure, the characters are either flat or annoying, random plot points and themes are piled on top of each other with no rhyme or reason, the character designs are unappealing. I thought Brave was the worst Best Animated Feature winner for sure, but leave it to this movie to prove me incredibly wrong. I can't even believe this is a real movie.     ",
      "wallace-gromit-the-curse-of-the-were-rabbit": "8/10 Effortlessly charming with great characters and expressive animation. Horror parodies usually make me roll my eyes out of my skull but this one does it with such finesse and absurdity that I genuinely adore it.     ",
      "the-incredibles": "10/10 An absolutely flawless, mature family drama. It genuinely feels like it was written for adults first and kids were kind of an afterthought. Animation as a medium rarely gets better than this.     ",
      "finding-nemo": "7/10 A lot funnier than I remember. Stunning animation, very emotional and entertaining. I'm not a huge fan of Dory or the Tank Gang and some scenes aren't as good as others. But a really good entry in the Pixar canon, even if it's not a favorite     ",
      "shrek": "7/10 I'm in the process of going through every Best Animated Feature winner for an upcoming video. Might as well review them yo  So Shrek is really good. The cast is pitch-perfect and their line deliveries add so much to their characters. Very mature love story with great humor, though a little dull at some points. Pales in comparison to Shrek 2 but still a great movie in its own right     ",
      "pokemon-detective-pikachu": "7/10 This. Movie. Is. BONKERS. Suffice to say I will have a full review out in a couple days but in summary I really really really liked it     ",
      "the-shape-of-water": "6/10 Such a strong year for movies, such a forgettable Best Picture winner. The direction and score are fantastic; Del Toro and Desplat definitely earned those Oscars, but the story is largely uninteresting and the slow pace doesn't help matters. Michael Shannon's character is kind of a joke and not really intimidating, and even though I love weird stuff in movies I draw the line at fish sex. Oh, and that scene in the movie theatre? Painfully pandering. You're better than that, Guillermo.     ",
      "first-man": "5/10 Damien Chazelle is my favorite director, and his direction is the best part about this movie. But maaaaaaaan, this script does not match the brilliance of his presentation. It's exceptionally dull and I don't buy Ryan Gosling in this role, I'm sorry. Great performance from Claire Foy and some excellent sequences here and there but the screenplay really sinks this one for me.     ",
      "edge-of-tomorrow": "9/10 A phenomenal, underrated action movie. Time loops are my jam (I'm the biggest Majora's Mask fan on the planet, after all) so this movie's fun premise, coupled with great performances and solid direction makes for such an incredible moviegoing experience. More people need to see this.     ",
      "avengers-endgame": "7/10 Good-ass movie about a rat that saved the universe     ",
      "avengers-infinity-war": "9/10 Better log this before I see Endgame tomorrow.  As of right now, the best MCU movie. A monumental achievement that I rewatch scenes from on at least a weekly basis. I could never sufficiently put into words how much I adore this movie.     ",
      "incredibles-2": "6/10 Ah yes, the original \"painfully average\" movie. Upon further thought, it's way better than the other films I've given that moniker to. It's fun, has great writing and inventive action, and the score is solid. Filler nonsense and a weak plot/villain/finale really drag it down, and it has little to no emotional weight. But it's still enjoyable; if we only had to wait 2 years for this instead of 14 then I think I'd feel a lot better about it overall.     ",
      "spider-man-homecoming": "7/10 Better than I remember. Funny, cute, exciting. It's cool to see how normal people live within this universe and I like the small stakes story that still manages to give the hero a chance to prove himself. The car scene is top tier MCU.     ",
      "captain-america-civil-war": "8/10 The smartest Marvel movie, but also kind of the dumbest. If Cap had just communicated better with Tony then 80% of the movie's conflict would've been solved. Also Zemo's plan is bonkers. But yeah pretty fantastic in spite of the narrative flaws     ",
      "ant-man": "5/10 It's cute for an hour but then I got really bored and I wanted to turn it off. Rewatches have usually slightly improved the Marvel origin movies for me, but it did the opposite here     ",
      "a-quiet-place-2018": "6/10 John Krasinski is clearly a very talented horror director, but unfortunately his deft touch is burdened with a really stupid script that puts its characters in unnecessary danger for the sake of getting more scares. Worth a watch, but I don't expect to check it out again.     ",
      "the-nightmare-before-christmas": "7/10 I'm not sure why they hired a different voice actor for Jack's speaking voice when he has like 5 spoken lines  Anyway yeah good movie, visually stunning if a bit slight on story. Songs are aight     ",
      "iron-man-3": "8/10 The best Iron Man movie. Y'all just hate fun.     ",
      "the-big-sick": "9/10 An exceptionally enjoyable rom-com with solid performances from everyone involved. You can tell this was a passion project for Kumail and his wife, it comes across so strongly in this funny, heartfelt film. Ray Romano's voice is like butter in any movie he's in so there's that too     ",
      "the-good-dinosaur": "3/10 ...at least it's pretty.     ",
      "boyhood": "3/10 A miserable experience that thinks it's way more profound than it actually is. It has nothing to say and its only value as a film comes from the novelty of its gimmick. Watch Lady Bird or The Florida Project instead.     ",
      "iron-man-2": "4/10 This movie is actually pretty solid for a first hour, but after Tony Stark pees in his suit the movie enters a downward spiral that it never recovers from. Still, if this is the weakest MCU movie, we could be doing a lot worse.     "
   }
}